{
  "Đề 1 (Q. 1 -> Q. 74)": [
    {
      "Câu": "Q. 1: Cho bảng chuyển đổi trạng thái (hình Sơ đồ trạng thái ở trang 2), chuỗi (test case) nào dưới đây sẽ bao phủ chuỗi chuyển đổi trạng thái sau: S1 -> SO -> S1 -> S2 -> SO",
      "các đáp án": [
        "A. D, A, B, C.",
        "B. A, B, C, D.",
        "C. D, A, B.",
        "D. A, B, C."
      ],
      "đáp án đúng": "A. D, A, B, C.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 3: Đâu là một nhiệm vụ CHÍNH của việc lập kế hoạch kiểm thử (test planning)?",
      "các đáp án": [
        "A. Lập lịch trình cho các nhiệm vụ phân tích và thiết kế kiểm thử.",
        "B. Khởi tạo các hành động khắc phục.",
        "C. Giám sát tiến độ và độ bao phủ kiểm thử.",
        "D. Đo lường và phân tích kết quả."
      ],
      "đáp án đúng": "A. Lập lịch trình cho các nhiệm vụ phân tích và thiết kế kiểm thử.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 5: Kiểm thử chức năng có thể được thực hiện ở đâu?",
      "các đáp án": [
        "A. Chỉ ở các mức kiểm thử hệ thống và chấp nhận.",
        "B. Ở tất cả các mức độ kiểm thử.",
        "C. Ở tất cả các mức độ trên kiểm thử tích hợp.",
        "D. Chỉ ở mức kiểm thử chấp nhận."
      ],
      "đáp án đúng": "B. Ở tất cả các mức độ kiểm thử.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 6: Mục tiêu CHÍNH khi xem xét (review) một sản phẩm phần mềm (software deliverable) là gì?",
      "các đáp án": [
        "A. Để xác định các hỏng hóc (failure) ứng dụng tiềm ẩn bằng cách sử dụng đặc tả kiểm thử.",
        "B. Để xác định các khuyết tật (defect) trong bất kỳ sản phẩm công việc phần mềm nào.",
        "C. Để xác định các lỗi chính tả trong đặc tả yêu cầu.",
        "D. Để xác định sự không nhất quán về tiêu chuẩn trong mã nguồn (code)."
      ],
      "đáp án đúng": "B. Để xác định các khuyết tật (defect) trong bất kỳ sản phẩm công việc phần mềm nào.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 9: Tài liệu nào sau đây định nghĩa các kết quả mong đợi (expected results) của một bài kiểm thử?",
      "các đáp án": [
        "A. Đặc tả trường hợp kiểm thử (Test case specification).",
        "B. Đặc tả thiết kế kiểm thử (Test design specification).",
        "C. Đặc tả thủ tục kiểm thử (Test procedure specification).",
        "D. Kết quả kiểm thử (Test results)."
      ],
      "đáp án đúng": "A. Đặc tả trường hợp kiểm thử (Test case specification).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 10: Một số công cụ phù hợp hơn cho nhà phát triển sử dụng. Với 5 công cụ được liệt kê, phát biểu nào mô tả ĐÚNG NHẤT những công cụ dành cho nhà phát triển: i) Công cụ kiểm thử hiệu năng. ii) Công cụ đo độ bao phủ. iii) Công cụ so sánh kiểm thử. iv) Công cụ phân tích động. v) Công cụ quản lý sự cố.",
      "các đáp án": [
        "A. i, iii. và iv. phù hợp hơn cho nhà phát triển.",
        "B. ii. và iv. phù hợp hơn cho nhà phát triển.",
        "C. ii, iii. và iv. phù hợp hơn cho nhà phát triển.",
        "D. ii. và iii. phù hợp hơn cho nhà phát triển."
      ],
      "đáp án đúng": "B. ii. và iv. phù hợp hơn cho nhà phát triển.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 11: Phát biểu nào sau đây là đúng?",
      "các đáp án": [
        "A. Phân tích tác động (Impact analysis) đánh giá ảnh hưởng đối với hệ thống của một khuyết tật được tìm thấy trong kiểm thử hồi quy.",
        "B. Phân tích tác động đánh giá ảnh hưởng của việc một người mới tham gia vào nhóm kiểm thử hồi quy.",
        "C. Phân tích tác động đánh giá xem một khuyết tật tìm thấy trong kiểm thử hồi quy đã được sửa đúng hay chưa.",
        "D. Phân tích tác động đánh giá ảnh hưởng của một thay đổi đối với hệ thống để xác định cần thực hiện bao nhiêu kiểm thử hồi quy."
      ],
      "đáp án đúng": "D. Phân tích tác động đánh giá ảnh hưởng của một thay đổi đối với hệ thống để xác định cần thực hiện bao nhiêu kiểm thử hồi quy.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 12: Bạn xác định tiêu chí rút lui (exit criteria) như một phần của quy trình kiểm thử nào?",
      "các đáp án": [
        "A. Lập kế hoạch kiểm thử (Test planning).",
        "B. Đánh giá tiêu chí rút lui và báo cáo (Evaluating exit criteria and reporting).",
        "C. Đóng kiểm thử (Test closure).",
        "D. Kiểm soát kiểm thử (Test control)."
      ],
      "đáp án đúng": "A. Lập kế hoạch kiểm thử (Test planning).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 13: Cho sơ đồ chuyển đổi trạng thái sau (hình Sơ đồ ở trang 4), chuỗi chuyển đổi trạng thái nào sau đây chứa một chuyển đổi KHÔNG HỢP LỆ có thể chỉ ra lỗi trong thiết kế hệ thống?",
      "các đáp án": [
        "A. Login -> Browse -> Basket -> Checkout -> Basket -> Checkout -> Pay -> Logout.",
        "B. Login -> Browse -> Basket -> Checkout -> Pay -> Logout.",
        "C. Login -> Browse -> Basket -> Checkout -> Basket -> Logout.",
        "D. Login -> Browse -> Basket -> Browse -> Basket -> Checkout -> Pay -> Logout."
      ],
      "đáp án đúng": "C. Login -> Browse -> Basket -> Checkout -> Basket -> Logout.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 14: Đâu là một nhiệm vụ CHÍNH của việc triển khai và thực hiện kiểm thử (test implementation and execution)?",
      "các đáp án": [
        "A. Đo lường và phân tích kết quả.",
        "B. Báo cáo các điểm khác biệt (discrepancies) dưới dạng sự cố (incidents).",
        "C. Xác định các điều kiện kiểm thử hoặc yêu cầu kiểm thử.",
        "D. Đánh giá xem có cần thêm bài kiểm thử hay không."
      ],
      "đáp án đúng": "B. Báo cáo các điểm khác biệt (discrepancies) dưới dạng sự cố (incidents).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 15: Kiểm thử Beta (Beta testing) là gì?",
      "các đáp án": [
        "A. Kiểm thử được thực hiện bởi các khách hàng tiềm năng tại địa điểm của nhà phát triển.",
        "B. Kiểm thử được thực hiện bởi các khách hàng tiềm năng tại địa điểm của riêng họ.",
        "C. Kiểm thử được thực hiện bởi các nhà phát triển sản phẩm tại địa điểm của khách hàng.",
        "D. Kiểm thử được thực hiện bởi các nhà phát triển sản phẩm tại địa điểm của riêng họ."
      ],
      "đáp án đúng": "B. Kiểm thử được thực hiện bởi các khách hàng tiềm năng tại địa điểm của riêng họ.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 16: Cho đoạn mã sau, cần bao nhiêu trường hợp kiểm thử để đạt 100% độ bao phủ quyết định (decision coverage)?\nif width > length\nthen\n  biggest_dimension = width\n  if height > width\n  then\n    biggest_dimension = height\n  end_if\nelse\n  biggest_dimension = length\n  if height > length\n  then\n    biggest_dimension = height\n  end_if\nend_if",
      "các đáp án": [
        "A. 3",
        "B. 4",
        "C. 2",
        "D. 1"
      ],
      "đáp án đúng": "B. 4",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 17: Bạn đã thiết kế các trường hợp kiểm thử để cung cấp 100% độ bao phủ câu lệnh và 100% độ bao phủ quyết định cho đoạn mã [if width > length...]. Các dòng 'print' sau đã được thêm vào cuối đoạn mã trên. Cần thêm bao nhiêu trường hợp kiểm thử?",
      "các đáp án": [
        "A. Cần thêm một trường hợp kiểm thử cho 100% độ bao phủ quyết định.",
        "B. Cần thêm hai trường hợp kiểm thử cho 100% độ bao phủ câu lệnh...",
        "C. Không cần, các trường hợp kiểm thử hiện có có thể được sử dụng.",
        "D. Cần thêm một trường hợp kiểm thử cho 100% độ bao phủ câu lệnh."
      ],
      "đáp án đúng": "C. Không cần, các trường hợp kiểm thử hiện có có thể được sử dụng.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 18: Một nhiệt kế chỉ đo nhiệt độ ở số nguyên. Nếu nhiệt độ giảm xuống dưới 18 độ, hệ thống sưởi bị tắt. Nó được bật lại khi nhiệt độ đạt 21 độ. Các giá trị nào (tính bằng độ) là tốt nhất để bao phủ tất cả các phân vùng tương đương?",
      "các đáp án": [
        "A. 15, 19 và 25.",
        "B. 17, 18 và 19.",
        "C. 18, 20 và 22.",
        "D. 16, 26 và 32."
      ],
      "đáp án đúng": "A. 15, 19 và 25.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 19: Hoạt động nào trong quy trình kiểm thử cơ bản tạo ra các bộ kiểm thử (test suites) để thực thi kiểm thử hiệu quả?",
      "các đáp án": [
        "A. Triển khai và thực hiện (Implementation and execution).",
        "B. Lập kế hoạch và kiểm soát (Planning and control).",
        "C. Phân tích và thiết kế (Analysis and design).",
        "D. Đóng kiểm thử (Test closure)."
      ],
      "đáp án đúng": "A. Triển khai và thực hiện (Implementation and execution).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 20: Phát biểu nào sau đây là ĐÚNG?",
      "các đáp án": [
        "A. Kiểm thử xác nhận (Confirmation testing) là kiểm thử các bản sửa lỗi cho một tập hợp các khuyết tật và Kiểm thử hồi quy (Regression testing) là kiểm thử để xác định xem có bất kỳ khuyết tật nào được đưa vào do các thay đổi hay không.",
        "B. Kiểm thử xác nhận là kiểm thử để xác định xem có bất kỳ khuyết tật nào được đưa vào do các thay đổi hay không và Kiểm thử hồi quy là kiểm thử các bản sửa lỗi cho một tập hợp các khuyết tật.",
        "C. Cả Kiểm thử xác nhận và Kiểm thử hồi quy đều là kiểm thử để xác định xem có bất kỳ khuyết tật nào được đưa vào do các thay đổi hay không.",
        "D. Cả Kiểm thử xác nhận và Kiểm thử hồi quy đều là kiểm thử các bản sửa lỗi cho một tập hợp các khuyết tật."
      ],
      "đáp án đúng": "A. Kiểm thử xác nhận (Confirmation testing) là kiểm thử các bản sửa lỗi cho một tập hợp các khuyết tật và Kiểm thử hồi quy (Regression testing) là kiểm thử để xác định xem có bất kỳ khuyết tật nào được đưa vào do các thay đổi hay không.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 21: Cho bảng quyết định sau: [Bảng quy tắc về Tuổi và Hạng bảo hiểm]. Trường hợp kiểm thử và kết quả mong đợi nào sau đây là HỢP LỆ? (Lưu ý: Có lỗi hiển thị trong tài liệu gốc, giả định 'Premium is 0' là lỗi và chỉ kiểm tra 'excess')",
      "các đáp án": [
        "A. 23 tuổi, hạng bảo hiểm A. Phí bảo hiểm là 0 và miễn thường là 500.",
        "B. 51 tuổi, hạng bảo hiểm C. Phí bảo hiểm là 0 và miễn thường là 00.",
        "C. 31 tuổi, hạng bảo hiểm B. Phí bảo hiểm là 0 và miễn thường là 500.",
        "D. 43 tuổi, hạng bảo hiểm C. Phí bảo hiểm là 0 và miễn thường là 000."
      ],
      "đáp án đúng": "C. 31 tuổi, hạng bảo hiểm B. Phí bảo hiểm là 0 và miễn thường là 500.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 23: Đâu là đặc điểm của kiểm thử hồi quy? i) Kiểm thử hồi quy CHỈ chạy một lần. ii) Kiểm thử hồi quy được sử dụng sau khi đã sửa lỗi. iii) Kiểm thử hồi quy thường được tự động hóa. iv) Các bài kiểm thử hồi quy không cần được bảo trì.",
      "các đáp án": [
        "A. ii, iv.",
        "B. ii, iii.",
        "C. i, iii, iv.",
        "D. iii."
      ],
      "đáp án đúng": "B. ii, iii.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 24: Một nhà bán buôn bán hộp mực máy in. Số lượng đặt hàng tối thiểu là 5. Giảm giá 20% cho đơn hàng từ 100 hộp mực trở lên. Bạn được yêu cầu chuẩn bị các trường hợp kiểm thử... Nhóm nào sau đây chứa ba đầu vào thử nghiệm sẽ được tạo bằng Phân tích giá trị biên (Boundary Value Analysis)?",
      "các đáp án": [
        "A. 5, 6, 20",
        "B. 4, 5, 80",
        "C. 4, 5, 99",
        "D. 1, 20, 100"
      ],
      "đáp án đúng": "C. 4, 5, 99",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 26: Lợi ích CHÍNH của việc thiết kế kiểm thử sớm (designing tests early) trong vòng đời là gì?",
      "các đáp án": [
        "A. Nó rẻ hơn so với thiết kế kiểm thử trong các giai đoạn kiểm thử.",
        "B. Nó giúp ngăn chặn các khuyết tật (defects) bị đưa vào mã (code).",
        "C. Các bài kiểm thử được thiết kế sớm hiệu quả hơn các bài kiểm thử được thiết kế sau này.",
        "D. Nó tiết kiệm thời gian trong các giai đoạn kiểm thử khi người kiểm thử bận rộn."
      ],
      "đáp án đúng": "B. Nó giúp ngăn chặn các khuyết tật (defects) bị đưa vào mã (code).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 29: Mục đích của tiêu chí rút lui (exit criteria) là gì?",
      "các đáp án": [
        "A. Để xác định khi nào một mức độ kiểm thử (test level) hoàn tất.",
        "B. Để xác định khi nào một bài kiểm thử (test) hoàn tất.",
        "C. Để xác định khi nào một hệ thống phần mềm nên ngừng hoạt động (retired).",
        "D. Để xác định xem một bài kiểm thử (test) đã vượt qua (passed) hay chưa."
      ],
      "đáp án đúng": "A. Để xác định khi nào một mức độ kiểm thử (test level) hoàn tất.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 32: Những hoạt động nào sau đây là một phần của lập kế hoạch kiểm thử (test planning)? i) Phát triển các trường hợp kiểm thử. ii) Xác định phương pháp tiếp cận tổng thể để kiểm thử. iii) Phân bổ nguồn lực. iv) Xây dựng môi trường kiểm thử. v) Viết các điều kiện kiểm thử.",
      "các đáp án": [
        "A. i, ii & iv là đúng, iii & v là sai.",
        "B. ii & iii là đúng, i, iv & v là sai.",
        "C. iv & v là đúng, i, ii & iii là sai.",
        "D. i, ii & iii là đúng, iv & v là sai."
      ],
      "đáp án đúng": "B. ii & iii là đúng, i, iv & v là sai.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 33: Ghép các thuật ngữ và phát biểu sau: 1. Kiểm thử Bảng quyết định. 2. Kiểm thử Quyết định. 3. Kiểm thử Chuyển đổi trạng thái. 4. Kiểm thử Khám phá. \nW. Kiểm thử được thực hiện... để đạt được các mục tiêu kiểm thử cụ thể, có thể để bổ sung cho kiểm thử có cấu trúc. \nX. Một kỹ thuật kiểm thử được sử dụng có thể dùng để xác minh các phản ứng khác nhau của hệ thống tùy thuộc vào điều kiện hiện tại hoặc lịch sử trước đó. \nY. Một kỹ thuật kiểm thử kết hợp các tổ hợp đầu vào mà có thể không được thực hiện trong quá trình kiểm thử. \nZ. Một dạng kiểm thử luồng điều khiển dựa trên các kết quả quyết định.",
      "các đáp án": [
        "A. 1Y, 2Z, 3X, 4W.",
        "B. 1X, 2W, 3Z, 4Y.",
        "C. 1Z, 2X, 3W, 4Y.",
        "D. 1Z, 2Y, 3X, 4W."
      ],
      "đáp án đúng": "A. 1Y, 2Z, 3X, 4W.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 34: Phát biểu sau đây mô tả tốt nhất loại kỹ thuật thiết kế kiểm thử nào: một quy trình để lấy ra các trường hợp kiểm thử dựa trên đặc tả của một thành phần?",
      "các đáp án": [
        "A. Kỹ thuật Hộp đen (Black Box Techniques).",
        "B. Kỹ thuật Hộp trắng (White Box Techniques).",
        "C. Kỹ thuật Hộp xám (Glass Box Techniques).",
        "D. Kỹ thuật Dựa trên kinh nghiệm (Experience Based Techniques)."
      ],
      "đáp án đúng": "A. Kỹ thuật Hộp đen (Black Box Techniques).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 35: Công cụ phân tích tĩnh (static analysis tool) sẽ hữu ích NHẤT cho việc nào sau đây?",
      "các đáp án": [
        "A. Hỗ trợ các buổi đánh giá (reviews).",
        "B. Xác thực (Validating) các mô hình của phần mềm.",
        "C. Kiểm thử mã được thực thi trong một bộ khai thác kiểm thử đặc biệt (test harness).",
        "D. Thực thi các tiêu chuẩn lập trình (coding standards)."
      ],
      "đáp án đúng": "D. Thực thi các tiêu chuẩn lập trình (coding standards).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 36: Kiểm thử trường hợp sử dụng (use case testing) CÓ KHẢ NĂNG NHẤT phát hiện ra loại khuyết tật nào sau đây? i) Lỗi trong luồng quy trình trong quá trình sử dụng hệ thống ngoài đời thực. ii) Lỗi trong các tham số giao diện khi kiểm thử tích hợp. iii) Lỗi tích hợp gây ra bởi sự tương tác và can thiệp của các thành phần khác nhau. iv) Lỗi trong hệ thống khi nó chuyển đổi giữa trạng thái này và trạng thái khác.",
      "các đáp án": [
        "A. ii, iii.",
        "B. i, iii.",
        "C. iii, iv.",
        "D. i, ii"
      ],
      "đáp án đúng": "B. i, iii.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 37: Điều nào sau đây là QUAN TRỌNG NHẤT trong việc lựa chọn phương pháp kiểm thử (test approach)?",
      "các đáp án": [
        "A. Tính sẵn có của các công cụ hỗ trợ các kỹ thuật được đề xuất.",
        "B. Ngân sách cho phép để đào tạo về các kỹ thuật được đề xuất.",
        "C. Các kỹ năng và kinh nghiệm hiện có về các kỹ thuật được đề xuất.",
        "D. Sự sẵn lòng của nhóm kiểm thử để học các kỹ thuật mới."
      ],
      "đáp án đúng": "C. Các kỹ năng và kinh nghiệm hiện có về các kỹ thuật được đề xuất.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 38: Đâu là lợi ích của tính độc lập trong kiểm thử (test independence)?",
      "các đáp án": [
        "A. Nó không yêu cầu sự quen thuộc với mã nguồn.",
        "B. Nó rẻ hơn so với việc sử dụng các nhà phát triển tự kiểm thử mã của họ.",
        "C. Nó tránh được sự thiên vị của tác giả (author bias) khi định nghĩa các bài kiểm thử hiệu quả.",
        "D. Người kiểm thử tìm ra khuyết tật giỏi hơn nhà phát triển."
      ],
      "đáp án đúng": "C. Nó tránh được sự thiên vị của tác giả (author bias) khi định nghĩa các bài kiểm thử hiệu quả.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 39: Sơ đồ trên biểu diễn các đường đi (path) sau đây qua mã nguồn. A. vwy, B. vwz, C. vxy, D. vxz. Sự kết hợp TỐI THIỂU nào của các đường đi là cần thiết để cung cấp độ bao phủ câu lệnh (statement coverage) đầy đủ?",
      "các đáp án": [
        "A. A",
        "B. ABD",
        "C. ABCD",
        "D. ACD"
      ],
      "đáp án đúng": "D. ACD",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 40: Điều nào sau đây là đặc trưng NHẤT của các kỹ thuật dựa trên đặc tả (specification based / black-box)?",
      "các đáp án": [
        "A. Các trường hợp kiểm thử có thể dễ dàng được tự động hóa.",
        "B. Các trường hợp kiểm thử độc lập với nhau.",
        "C. Các trường hợp kiểm thử được lấy ra một cách có hệ thống từ các mô hình của hệ thống.",
        "D. Các trường hợp kiểm thử được lấy ra một cách có hệ thống từ mã nguồn đã giao."
      ],
      "đáp án đúng": "C. Các trường hợp kiểm thử được lấy ra một cách có hệ thống từ các mô hình của hệ thống.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 41: Sự kết hợp nào sau đây mô tả đúng một phương pháp hợp lệ để kiểm thử thành phần (component testing): i) Kiểm thử chức năng của thành phần một cách riêng rẽ. ii) Kiểm thử dựa trên cấu trúc của mã mà không ghi lại sự cố. iii) Các bài kiểm thử tự động được chạy cho đến khi thành phần vượt qua. iv) Kiểm thử chức năng của các giao diện giữa các mô-đun.",
      "các đáp án": [
        "A. i and ii.",
        "B. I ii and iii",
        "C. iii.",
        "D. ii and iv"
      ],
      "đáp án đúng": "A. i and ii.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 44: Định nghĩa nào tốt nhất cho kiểm thử hoàn chỉnh (complete testing):",
      "các đáp án": [
        "A. Bạn đã phát hiện ra mọi lỗi (bug) trong chương trình.",
        "B. Bạn đã kiểm thử mọi câu lệnh, nhánh và sự kết hợp của các nhánh trong chương trình.",
        "C. Bạn đã hoàn thành mọi kiểm thử trong kế hoạch kiểm thử (test plan).",
        "D. Bạn đã đạt đến ngày giao hàng theo lịch trình."
      ],
      "đáp án đúng": "C. Bạn đã hoàn thành mọi kiểm thử trong kế hoạch kiểm thử (test plan).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 45: Độ bao phủ câu lệnh (statement coverage) và nhánh (branch coverage) hoàn chỉnh có nghĩa là:",
      "các đáp án": [
        "A. Rằng bạn đã kiểm thử mọi câu lệnh trong chương trình.",
        "B. Rằng bạn đã kiểm thử mọi câu lệnh và mọi nhánh trong chương trình.",
        "C. Rằng bạn đã kiểm thử mọi câu lệnh IF trong chương trình.",
        "D. Rằng bạn đã kiểm thử mọi sự kết hợp các giá trị của câu lệnh IF trong chương trình."
      ],
      "đáp án đúng": "B. Rằng bạn đã kiểm thử mọi câu lệnh và mọi nhánh trong chương trình.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 47: Các khuyết tật điển hình dễ tìm thấy trong đánh giá (reviews) hơn là trong kiểm thử động (dynamic testing) là:",
      "các đáp án": [
        "A. Sai lệch so với tiêu chuẩn,",
        "B. Khuyết tật yêu cầu,",
        "C. Khuyết tật thiết kế,",
        "D. Khả năng bảo trì không đủ và đặc tả giao diện không chính xác.",
        "E. Tất cả những điều trên."
      ],
      "đáp án đúng": "E. Tất cả những điều trên.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 48: Đánh giá (Reviews), phân tích tĩnh (static analysis) và kiểm thử động (dynamic testing) có cùng mục tiêu",
      "các đáp án": [
        "A. Xác định các khuyết tật (Identifying defects).",
        "B. Sửa chữa các khuyết tật (Fixing defects).",
        "C. A. và B",
        "D. Không có điều nào ở trên"
      ],
      "đáp án đúng": "A. Xác định các khuyết tật (Identifying defects).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 49: Chúng ta có thể đạt được độ bao phủ câu lệnh (statement coverage) hoàn chỉnh nhưng vẫn bỏ sót lỗi (bugs) vì:",
      "các đáp án": [
        "A. Hư hỏng (failure) chỉ xảy ra nếu bạn đến một câu lệnh bằng cách đi theo nhánh TRUE của câu lệnh IF, và bạn đã đến câu lệnh đó bằng một bài kiểm thử đi qua nhánh FALSE.",
        "B. Hư hỏng phụ thuộc vào việc chương trình không thể xử lý các giá trị dữ liệu cụ thể, thay vì phụ thuộc vào luồng điều khiển của chương trình.",
        "C. Chúng ta không bắt buộc phải kiểm thử mã mà khách hàng không có khả năng thực thi.",
        "D. Tất cả những điều trên"
      ],
      "đáp án đúng": "B. Hư hỏng phụ thuộc vào việc chương trình không thể xử lý các giá trị dữ liệu cụ thể, thay vì phụ thuộc vào luồng điều khiển của chương trình.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 51: Những hậu quả quan trọng của việc không thể kiểm thử toàn bộ (impossibility of complete testing) là (Chọn một hoặc nhiều):",
      "các đáp án": [
        "A. Chúng ta không bao giờ có thể chắc chắn rằng chương trình không có lỗi.",
        "B. Chúng ta không có điểm dừng rõ ràng cho việc kiểm thử, điều này khiến một số nhà quản lý dễ dàng tranh luận cho việc kiểm thử rất ít.",
        "C. Chúng ta không có câu trả lời dễ dàng cho những nhiệm vụ kiểm thử nào luôn phải được yêu cầu, bởi vì mọi nhiệm vụ đều tốn thời gian...",
        "D. Tất cả những điều trên."
      ],
      "đáp án đúng": "D. Tất cả những điều trên.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 52: Các đặc điểm phần mềm kém (Poor software characteristics) là",
      "các đáp án": [
        "A. Chỉ là Rủi ro dự án (Project risks)",
        "B. Chỉ là Rủi ro sản phẩm (Product risks)",
        "C. Rủi ro dự án và Rủi ro sản phẩm",
        "D. Rủi ro dự án hoặc Rủi ro sản phẩm"
      ],
      "đáp án đúng": "B. Chỉ là Rủi ro sản phẩm (Product risks)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 53: Kiểm thử hệ thống (System testing) nên điều tra",
      "các đáp án": [
        "A. Chỉ các yêu cầu phi chức năng, không phải yêu cầu chức năng",
        "B. Chỉ các yêu cầu chức năng, không phải yêu cầu phi chức năng",
        "C. Các yêu cầu phi chức năng và các yêu cầu chức năng",
        "D. Các yêu cầu phi chức năng hoặc các yêu cầu chức năng"
      ],
      "đáp án đúng": "C. Các yêu cầu phi chức năng và các yêu cầu chức năng",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 54: Kiểm thử hợp đồng và quy định (Contract and regulation testing) là một phần của",
      "các đáp án": [
        "A. Kiểm thử hệ thống (System testing)",
        "B. Kiểm thử chấp nhận (Acceptance testing)",
        "C. Kiểm thử tích hợp (Integration testing)",
        "D. Kiểm thử khói (Smoke testing)"
      ],
      "đáp án đúng": "B. Kiểm thử chấp nhận (Acceptance testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 56: Đâu không phải là mục tiêu của kiểm thử (testing objectives)",
      "các đáp án": [
        "A. Tìm ra các khuyết tật (Finding defects)",
        "B. Đạt được sự tự tin về mức độ chất lượng và cung cấp thông tin",
        "C. Ngăn ngừa các khuyết tật (Preventing defects).",
        "D. Gỡ lỗi (Debugging) các khuyết tật"
      ],
      "đáp án đúng": "D. Gỡ lỗi (Debugging) các khuyết tật",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 58: Đâu không phải là rủi ro dự án (project risks)",
      "các đáp án": [
        "A. Các vấn đề từ nhà cung cấp (Supplier issues)",
        "B. Các yếu tố tổ chức (Organization factors)",
        "C. Các vấn đề kỹ thuật (Technical issues)",
        "D. Phần mềm dễ bị lỗi được giao (Error-prone software delivered)"
      ],
      "đáp án đúng": "D. Phần mềm dễ bị lỗi được giao (Error-prone software delivered)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 61: 'X' đã cung cấp dữ liệu về tuổi của một người, phải nằm trong khoảng từ 1 đến 99. Sử dụng Phân tích giá trị biên (BVA), bộ nào là phù hợp",
      "các đáp án": [
        "A. 0, 1, 2, 99",
        "B. 1, 99, 100, 98",
        "C. 0, 1, 99, 100",
        "D. -1, 0, 1, 99"
      ],
      "đáp án đúng": "C. 0, 1, 99, 100",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 62: Đâu không phải là một nguyên tắc kiểm thử (testing principle)",
      "các đáp án": [
        "A. Kiểm thử sớm (Early testing)",
        "B. Sự tập trung của khuyết tật (Defect clustering)",
        "C. Nghịch lý thuốc trừ sâu (Pesticide paradox)",
        "D. Kiểm thử toàn bộ (Exhaustive testing)"
      ],
      "đáp án đúng": "D. Kiểm thử toàn bộ (Exhaustive testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 64: [...] Kiểm thử sẽ được thực hiện bởi mọi người tại địa điểm riêng của khách hàng (client own locations)",
      "các đáp án": [
        "A. Kiểm thử Alpha (Alpha testing)",
        "B. Kiểm thử tại chỗ (Field testing)",
        "C. Kiểm thử hiệu năng (Performance testing)",
        "D. Kiểm thử hệ thống (System testing)"
      ],
      "đáp án đúng": "B. Kiểm thử tại chỗ (Field testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 66: Đâu không phải là kỹ thuật kiểm thử hộp đen (black box testing technique)",
      "các đáp án": [
        "A. Phân vùng tương đương (Equivalence partition)",
        "B. Bảng quyết định (Decision tables)",
        "C. Sơ đồ giao dịch (Transaction diagrams)",
        "D. Kiểm thử quyết định (Decision testing)"
      ],
      "đáp án đúng": "D. Kiểm thử quyết định (Decision testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 68: Các trường hợp sử dụng (Use cases) có thể được thực hiện để kiểm thử",
      "các đáp án": [
        "A. Kiểm thử hiệu năng (Performance testing)",
        "B. Kiểm thử đơn vị (Unit testing)",
        "C. Các kịch bản nghiệp vụ (Business scenarios)",
        "D. Kiểm thử tĩnh (Static testing)"
      ],
      "đáp án đúng": "C. Các kịch bản nghiệp vụ (Business scenarios)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 69: Mục đích của kỹ thuật thiết kế kiểm thử (test design technique) là",
      "các đáp án": [
        "A. Chỉ xác định các điều kiện kiểm thử, không xác định các trường hợp kiểm thử",
        "B. Không xác định các điều kiện kiểm thử, chỉ xác định các trường hợp kiểm thử",
        "C. Xác định các điều kiện kiểm thử và Xác định các trường hợp kiểm thử",
        "D. Xác định các điều kiện kiểm thử hoặc Xác định các trường hợp kiểm thử"
      ],
      "đáp án đúng": "C. Xác định các điều kiện kiểm thử và Xác định các trường hợp kiểm thử",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 73: Arc testing (Kiểm thử cung) còn được gọi là",
      "các đáp án": [
        "A. Kiểm thử nhánh (Branch testing)",
        "B. Kiểm thử linh hoạt (Agile testing)",
        "C. Kiểm thử Beta (Beta testing)",
        "D. Kiểm thử đặc biệt (Ad-hoc testing)"
      ],
      "đáp án đúng": "A. Kiểm thử nhánh (Branch testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 74: Mục đích của tiêu chí rút lui (exit criteria) là",
      "các đáp án": [
        "A. Xác định khi nào dừng kiểm thử",
        "B. Kết thúc một mức độ kiểm thử",
        "C. Khi một tập hợp các bài kiểm thử đã đạt được một điều kiện tiên quyết cụ thể",
        "D. Tất cả những điều trên"
      ],
      "đáp án đúng": "D. Tất cả những điều trên",
      "nguồn ảnh": null
    }
  ],
  "Đề 2 (Q. 75 -> Q. 154)": [
    {
      "Câu": "Q. 75: Kỹ thuật [...] có thể được sử dụng để đạt được độ bao phủ đầu vào và đầu ra",
      "các đáp án": [
        "A. Phân tích giá trị biên (Boundary value analysis)",
        "B. Phân vùng tương đương (Equivalence partitioning)",
        "C. Kiểm thử bảng quyết định (Decision table testing)",
        "D. Kiểm thử chuyển đổi trạng thái (State transition testing)"
      ],
      "đáp án đúng": "B. Phân vùng tương đương (Equivalence partitioning)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 76: Kiểm thử [...] được thực hiện tại địa điểm của tổ chức phát triển",
      "các đáp án": [
        "A. Kiểm thử đơn vị (Unit testing)",
        "B. Kiểm thử hồi quy (Regression testing)",
        "C. Kiểm thử Alpha (Alpha testing)",
        "D. Kiểm thử tích hợp (Integration testing)"
      ],
      "đáp án đúng": "C. Kiểm thử Alpha (Alpha testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 78: Đâu không phải là Kiểm thử thành phần (Component testing)",
      "các đáp án": [
        "A. Kiểm tra rò rỉ bộ nhớ (Check the memory leaks)",
        "B. Kiểm tra tính mạnh mẽ (Check the robustness)",
        "C. Kiểm tra độ bao phủ nhánh (Check the branch coverage)",
        "D. Kiểm tra bảng quyết định (Check the decision tables)"
      ],
      "đáp án đúng": "D. Kiểm tra bảng quyết định (Check the decision tables)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 80: Đâu không phải là quy trình kiểm thử cơ bản (fundamental test process)",
      "các đáp án": [
        "A. Lập kế hoạch và kiểm soát (Planning and control)",
        "B. Các hoạt động đóng kiểm thử (Test closure activities)",
        "C. Phân tích và thiết kế (Analysis and design)",
        "D. Không có (None)"
      ],
      "đáp án đúng": "D. Không có (None)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 85: Một [...] là phương pháp từng bước được tuân theo để đảm bảo rằng các tiêu chuẩn được đáp ứng",
      "các đáp án": [
        "A. SDLC (Vòng đời phát triển phần mềm)",
        "B. Kế hoạch dự án (Project Plan)",
        "C. Chính sách (Policy)",
        "D. Thủ tục (Procedure)"
      ],
      "đáp án đúng": "D. Thủ tục (Procedure)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 88: Đâu là kiểm thử phi chức năng (non-functional testing)",
      "các đáp án": [
        "A. Kiểm thử hiệu năng (Performance testing)",
        "B. Kiểm thử đơn vị (Unit testing)",
        "C. Kiểm thử hồi quy (Regression testing)",
        "D. Kiểm thử nhanh (Sanity testing)"
      ],
      "đáp án đúng": "A. Kiểm thử hiệu năng (Performance testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 89: Đề cương Kế hoạch kiểm thử (Test Plan Outline) chứa những nội dung nào sau đây: i. Các hạng mục kiểm thử (Test Items). ii. Các kịch bản kiểm thử (Test Scripts). iii. Các sản phẩm bàn giao của kiểm thử (Test Deliverables). iv. Trách nhiệm (Responsibilities).",
      "các đáp án": [
        "A. i, ii, iii là đúng và iv là sai",
        "B. i, iii, iv là đúng và ii là sai",
        "C. ii, iii là đúng và i và iv là sai",
        "D. i, ii là sai và iii, iv là đúng"
      ],
      "đáp án đúng": "B. i, iii, iv là đúng và ii là sai",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 90: Kiểm thử trong đó chúng ta đưa đối tượng kiểm thử vào các khối lượng công việc khác nhau để đo lường và đánh giá các hành vi hiệu năng và khả năng của đối tượng tiếp tục hoạt động đúng đắn dưới các khối lượng công việc khác nhau này.",
      "các đáp án": [
        "A. Kiểm thử tải (Load Testing)",
        "B. Kiểm thử tích hợp (Integration Testing)",
        "C. Kiểm thử hệ thống (System Testing)",
        "D. Kiểm thử tính khả dụng (Usability Testing)"
      ],
      "đáp án đúng": "A. Kiểm thử tải (Load Testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 91: Đâu là nhiệm vụ của một Người kiểm thử (Tester)? i. Tương tác với Nhà cung cấp công cụ kiểm thử... ii. Chuẩn bị và thu thập Dữ liệu kiểm thử. iii. Thực hiện Kiểm thử ở tất cả các cấp độ, thực thi và ghi lại (log) các bài kiểm thử. iv. Tạo ra các Đặc tả kiểm thử.",
      "các đáp án": [
        "A. i, ii, iii là đúng và iv là sai",
        "B. ii, iii, iv là đúng và i là sai",
        "C. i là đúng và ii, iii, iv là sai",
        "D. iii và iv là đúng và i và ii là sai"
      ],
      "đáp án đúng": "B. ii, iii, iv là đúng và i là sai",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 92: Phân tích tĩnh (static analysis) KHÔNG thể tìm thấy gì?",
      "các đáp án": [
        "A. Việc sử dụng một biến trước khi nó được định nghĩa",
        "B. Mã không thể truy cập ('mã chết' - dead code)",
        "C. Rò rỉ bộ nhớ (Memory leaks)",
        "D. Vi phạm giới hạn mảng (Array bound violations)"
      ],
      "đáp án đúng": "C. Rò rỉ bộ nhớ (Memory leaks)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 93: Các Kỹ thuật Hộp trắng (White Box Techniques) còn được gọi là:",
      "các đáp án": [
        "A. Kiểm thử cấu trúc (Structural Testing)",
        "B. Kiểm thử dựa trên thiết kế (Design Based Testing)",
        "C. Kỹ thuật đoán lỗi (Error Guessing Technique)",
        "D. Kỹ thuật dựa trên kinh nghiệm (Experience Based Technique)"
      ],
      "đáp án đúng": "A. Kiểm thử cấu trúc (Structural Testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 94: Xem xét Cơ sở kiểm thử (Test Basis) là một phần của pha nào",
      "các đáp án": [
        "A. Phân tích và Thiết kế Kiểm thử (Test Analysis and Design)",
        "B. Triển khai và Thực thi Kiểm thử (Test Implementation and execution)",
        "C. Các hoạt động Đóng Kiểm thử (Test Closure Activities)",
        "D. Đánh giá tiêu chí rút lui và báo cáo (Evaluating exit criteria and reporting)"
      ],
      "đáp án đúng": "A. Phân tích và Thiết kế Kiểm thử (Test Analysis and Design)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 95: Kiểm thử thành phần (Component Testing) còn được gọi là: i. Kiểm thử đơn vị (Unit Testing). ii. Kiểm thử chương trình (Program Testing). iii. Kiểm thử mô-đun (Module Testing). iv. Kiểm thử thành phần hệ thống (System Component Testing).",
      "các đáp án": [
        "A. i, ii, iii là đúng và iv là sai",
        "B. i, ii, iii, iv là sai",
        "C. i, ii, iv là đúng và iii là sai",
        "D. tất cả ở trên đều đúng"
      ],
      "đáp án đúng": "D. tất cả ở trên đều đúng",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 96: Đâu không phải là nhiệm vụ chính của việc Đánh giá tiêu chí rút lui (Evaluating Exit Criteria)?",
      "các đáp án": [
        "A. Kiểm tra nhật ký kiểm thử (test logs) so với các tiêu chí rút lui được chỉ định trong kế hoạch kiểm thử.",
        "B. Ghi lại (Logging) kết quả của việc thực thi kiểm thử.",
        "C. Đánh giá xem có cần thêm bài kiểm thử hay không.",
        "D. Viết báo cáo tóm tắt kiểm thử cho các bên liên quan."
      ],
      "đáp án đúng": "B. Ghi lại (Logging) kết quả của việc thực thi kiểm thử.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 99: Hoạt động kiểm thử được thực hiện để phát hiện các khuyết tật trong các giao diện và trong sự tương tác giữa các thành phần được tích hợp là:",
      "các đáp án": [
        "A. Kiểm thử mức hệ thống (System Level Testing)",
        "B. Kiểm thử mức tích hợp (Integration Level Testing)",
        "C. Kiểm thử mức đơn vị (Unit Level Testing)",
        "D. Kiểm thử thành phần (Component Testing)"
      ],
      "đáp án đúng": "B. Kiểm thử mức tích hợp (Integration Level Testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 101: Công tắc được tắt khi nhiệt độ giảm xuống dưới 18 và sau đó được bật khi nhiệt độ lớn hơn 21. Xác định các giá trị Tương đương (Equivalance) thuộc cùng một lớp.",
      "các đáp án": [
        "Α. 12, 16, 22",
        "Β. 24, 27, 17",
        "C. 22, 23, 24",
        "D. 14, 15, 19"
      ],
      "đáp án đúng": "C. 22, 23, 24",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 102: Phân vùng tương đương (equivalence partition) (còn được gọi là lớp tương đương) là gì?",
      "các đáp án": [
        "A. Một tập hợp các trường hợp kiểm thử để kiểm thử các lớp (class) của đối tượng",
        "B. Một dải giá trị đầu vào hoặc đầu ra sao cho chỉ một giá trị trong dải trở thành một trường hợp kiểm thử",
        "C. Một dải giá trị đầu vào hoặc đầu ra sao cho mỗi giá trị trong dải trở thành một trường hợp kiểm thử",
        "D. Một dải giá trị đầu vào hoặc đầu ra sao cho cứ mỗi mười giá trị trong dải trở thành một trường hợp kiểm thử."
      ],
      "đáp án đúng": "B. Một dải giá trị đầu vào hoặc đầu ra sao cho chỉ một giá trị trong dải trở thành một trường hợp kiểm thử",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 103: Đâu không phải là một phần của Pha Triển khai và Thực thi Kiểm thử (Test Implementation and Execution Phase)",
      "các đáp án": [
        "A. Tạo các bộ kiểm thử (test suites) từ các trường hợp kiểm thử",
        "B. Thực thi các trường hợp kiểm thử bằng tay hoặc bằng các công cụ thực thi kiểm thử",
        "C. So sánh kết quả thực tế",
        "D. Thiết kế các Bài kiểm thử (Designing the Tests)"
      ],
      "đáp án đúng": "D. Thiết kế các Bài kiểm thử (Designing the Tests)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 104: Link Testing (Kiểm thử liên kết) còn được gọi là:",
      "các đáp án": [
        "A. Kiểm thử tích hợp thành phần (Component Integration testing)",
        "B. Kiểm thử hệ thống thành phần (Component System Testing)",
        "C. Kiểm thử hệ thống con thành phần (Component Sub System Testing)",
        "D. Kiểm thử bảo trì (Maintenance testing)"
      ],
      "đáp án đúng": "A. Kiểm thử tích hợp thành phần (Component Integration testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 106: Phát biểu nào sau đây về kiểm thử tĩnh (static testing) là sai:",
      "các đáp án": [
        "A. Kiểm thử tĩnh yêu cầu chạy các bài kiểm thử qua mã nguồn",
        "B. Kiểm thử tĩnh bao gồm việc kiểm tra tại bàn (desk checking)",
        "C. Kiểm thử tĩnh bao gồm các kỹ thuật như đánh giá (reviews) và kiểm tra (inspections)",
        "D. Kiểm thử tĩnh có thể đưa ra các phép đo như độ phức tạp cyclomatic"
      ],
      "đáp án đúng": "A. Kiểm thử tĩnh yêu cầu chạy các bài kiểm thử qua mã nguồn",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 107: Thiết kế việc thiết lập môi trường kiểm thử (test environment set-up) và xác định bất kỳ cơ sở hạ tầng và công cụ cần thiết nào là một phần của pha nào",
      "các đáp án": [
        "A. Triển khai và thực thi kiểm thử (Test Implementation and execution)",
        "B. Phân tích và thiết kế kiểm thử (Test Analysis and Design)",
        "C. Đánh giá tiêu chí rút lui và báo cáo (Evaluating the Exit Criteria and reporting)",
        "D. Các hoạt động đóng kiểm thử (Test Closure Activities)"
      ],
      "đáp án đúng": "A. Triển khai và thực thi kiểm thử (Test Implementation and execution)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 108: Một loại Kiểm thử chức năng, điều tra các chức năng liên quan đến việc phát hiện các mối đe dọa, chẳng hạn như vi-rút từ bên ngoài.",
      "các đáp án": [
        "A. Kiểm thử bảo mật (Security Testing)",
        "B. Kiểm thử phục hồi (Recovery Testing)",
        "C. Kiểm thử hiệu năng (Performance Testing)",
        "D. Kiểm thử chức năng (Functionality Testing)"
      ],
      "đáp án đúng": "A. Kiểm thử bảo mật (Security Testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 110: Các Trường hợp kiểm thử (Test Cases) được lấy từ các trường hợp sử dụng (use cases)",
      "các đáp án": [
        "A. Hữu ích nhất trong việc phát hiện các khuyết tật trong các luồng quy trình (process flows) trong quá trình sử dụng hệ thống ngoài đời thực",
        "B. Hữu ích nhất trong việc phát hiện các khuyết tật trong các luồng quy trình trong quá trình sử dụng hệ thống để kiểm thử",
        "C. Hữu ích nhất trong việc bao phủ các khuyết tật trong các luồng quy trình trong quá trình sử dụng hệ thống ngoài đời thực",
        "D. Hữu ích nhất trong việc bao phủ các khuyết tật ở Mức độ tích hợp (Integration Level)"
      ],
      "đáp án đúng": "A. Hữu ích nhất trong việc phát hiện các khuyết tật trong các luồng quy trình (process flows) trong quá trình sử dụng hệ thống ngoài đời thực",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 111: Một trong các trường trên một biểu mẫu (form) chứa một hộp văn bản (text box) chấp nhận các giá trị chữ và số (alpha numeric). Xác định Lớp tương đương (Equivalence class) Hợp lệ",
      "các đáp án": [
        "A. BOOK",
        "B. Book",
        "C. Boo01k",
        "D. book"
      ],
      "đáp án đúng": "C. Boo01k",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 112: Trong một kỳ thi, một thí sinh phải đạt tối thiểu 24 điểm để đỗ. Số điểm tối đa anh ta có thể đạt được là 40 điểm. Xác định các giá trị Tương đương (Equivalance) Hợp lệ nếu sinh viên đỗ kỳ thi.",
      "các đáp án": [
        "A. 22, 23, 26",
        "Β. 21, 39, 40",
        "C. 29, 30, 31",
        "D. 0, 15, 22"
      ],
      "đáp án đúng": "C. 29, 30, 31",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 114: Rủi ro dự án (Project risk) bao gồm điều nào sau đây:",
      "các đáp án": [
        "A. Các yếu tố tổ chức (Organizational Factors)",
        "B. Các đặc điểm phần mềm kém (Poor Software characteristics)",
        "C. Phần mềm dễ bị lỗi được giao (Error Prone software delivered).",
        "D. Phần mềm không thực hiện các chức năng dự định của nó (Software that does not perform its intended functions)"
      ],
      "đáp án đúng": "A. Các yếu tố tổ chức (Organizational Factors)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 116: Kỹ thuật nào sau đây KHÔNG phải là kỹ thuật Hộp trắng (White box technique)?",
      "các đáp án": [
        "A. Kiểm thử câu lệnh và độ bao phủ (Statement Testing and coverage)",
        "B. Kiểm thử quyết định và độ bao phủ (Decision Testing and coverage)",
        "C. Độ bao phủ điều kiện (Condition Coverage)",
        "D. Phân tích giá trị biên (Boundary value analysis)"
      ],
      "đáp án đúng": "D. Phân tích giá trị biên (Boundary value analysis)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 117: Báo cáo các điểm khác biệt (Reporting Discrepancies) dưới dạng sự cố (incidents) là một phần của pha nào:",
      "các đáp án": [
        "A. Phân tích và thiết kế kiểm thử (Test Analysis and Design)",
        "B. Triển khai và thực thi kiểm thử (Test Implementation and execution)",
        "C. Các hoạt động đóng kiểm thử (Test Closure Activities)",
        "D. Đánh giá tiêu chí rút lui và báo cáo (Evaluating exit criteria and reporting)"
      ],
      "đáp án đúng": "B. Triển khai và thực thi kiểm thử (Test Implementation and execution)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 118: Trong phương pháp tiếp cận dựa trên rủi ro (risk-based approach), các rủi ro được xác định có thể được sử dụng để: i. Xác định kỹ thuật kiểm thử sẽ được sử dụng. ii. Xác định mức độ kiểm thử sẽ được thực hiện. iii. Ưu tiên kiểm thử nhằm cố gắng tìm ra các khuyết tật nghiêm trọng càng sớm càng tốt. iv. Xác định chi phí của dự án",
      "các đáp án": [
        "A. ii là Đúng; i, iii, iv & v là Sai",
        "B. i, ii, iii là đúng và iv là sai",
        "C. ii & iii là Đúng; i, iv là Sai",
        "D. ii, iii & iv là Đúng; i là sai"
      ],
      "đáp án đúng": "B. i, ii, iii là đúng và iv là sai",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 121: Triển khai và thực thi kiểm thử (Test Implementation and execution) có những nhiệm vụ chính nào sau đây? i. Phát triển và ưu tiên các trường hợp kiểm thử, tạo dữ liệu kiểm thử... ii. Tạo bộ kiểm thử (test suite) từ các trường hợp kiểm thử... iii. Xác minh rằng môi trường kiểm thử đã được thiết lập chính xác. iv. Xác định các tiêu chí rút lui.",
      "các đáp án": [
        "A. i, ii, iii là đúng và iv là sai",
        "B. i,, iv là đúng và ii là sai",
        "C. i, ii là đúng và iii, iv là sai",
        "D. ii, iii, iv là đúng và i là sai"
      ],
      "đáp án đúng": "A. i, ii, iii là đúng và iv là sai",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 122: Một trong các trường trên một biểu mẫu (form) chứa một hộp văn bản (text box) chấp nhận các giá trị số trong khoảng từ 18 đến 25. Xác định Lớp tương đương (Equivalance class) không hợp lệ",
      "các đáp án": [
        "A. 17",
        "B. 19",
        "C. 24",
        "D. 21"
      ],
      "đáp án đúng": "A. 17",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 123: Kiểm thử toàn bộ (Exhaustive Testing) là",
      "các đáp án": [
        "A. Không thực tế nhưng có thể thực hiện được",
        "B. Có thể thực hiện được về mặt thực tế",
        "C. Không thực tế và không thể thực hiện được",
        "D. Luôn luôn có thể thực hiện được"
      ],
      "đáp án đúng": "C. Không thực tế và không thể thực hiện được",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 124: Bàn giao Testware (Phần mềm kiểm thử) là một phần của Pha nào",
      "các đáp án": [
        "A. Phân tích và Thiết kế Kiểm thử (Test Analysis and Design)",
        "B. Lập kế hoạch và Kiểm soát Kiểm thử (Test Planning and control)",
        "C. Các hoạt động Đóng Kiểm thử (Test Closure Activities)",
        "D. Đánh giá tiêu chí rút lui và báo cáo (Evaluating exit criteria and reporting)"
      ],
      "đáp án đúng": "C. Các hoạt động Đóng Kiểm thử (Test Closure Activities)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 126: Ở pha nào thì kiểm thử tĩnh (static tests) được sử dụng",
      "các đáp án": [
        "A. Yêu cầu (Requirements)",
        "B. Thiết kế (Design)",
        "C. Lập trình (Coding)",
        "D. Tất cả những điều trên"
      ],
      "đáp án đúng": "D. Tất cả những điều trên",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 127: Nhược điểm của Kiểm thử Hộp đen (Black Box Testing) là gì",
      "các đáp án": [
        "A. Có khả năng lặp lại các bài kiểm thử đã được lập trình viên thực hiện.",
        "B. Dữ liệu đầu vào kiểm thử cần phải lấy từ một không gian mẫu lớn.",
        "C. Khó xác định tất cả các đầu vào có thể có trong thời gian kiểm thử giới hạn. Vì vậy, việc viết các trường hợp kiểm thử chậm và khó khăn",
        "D. Tất cả ở trên"
      ],
      "đáp án đúng": "D. Tất cả ở trên",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 128: Các công cụ phân tích tĩnh (Static analysis tools) thường được sử dụng bởi",
      "các đáp án": [
        "A. Người kiểm thử (Testers)",
        "B. Nhà phát triển (Developers)",
        "C. Người kiểm thử & Nhà phát triển (Testers & Developers)",
        "D. Không ai cả (None)"
      ],
      "đáp án đúng": "B. Nhà phát triển (Developers)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 130: Đặc tả mô tả các bước cần thiết để vận hành hệ thống và thực hiện các trường hợp kiểm thử để triển khai thiết kế kiểm thử liên quan",
      "các đáp án": [
        "A. Đặc tả Trường hợp kiểm thử (Test Case Specification)",
        "B. Đặc tả Thiết kế kiểm thử (Test Design Specification)",
        "C. Đặc tả Thủ tục kiểm thử (Test Procedure Specification)",
        "D. Không có (None)"
      ],
      "đáp án đúng": "C. Đặc tả Thủ tục kiểm thử (Test Procedure Specification)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 132: Khi một khuyết tật được phát hiện và sửa chữa, phần mềm nên được kiểm thử lại (retested) để xác nhận rằng khuyết tật ban đầu đã được loại bỏ thành công. Điều này được gọi là",
      "các đáp án": [
        "A. Kiểm thử hồi quy (Regression testing)",
        "B. Kiểm thử bảo trì (Maintenance testing)",
        "C. Kiểm thử xác nhận (Confirmation testing)",
        "D. Không có điều nào ở trên"
      ],
      "đáp án đúng": "C. Kiểm thử xác nhận (Confirmation testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 133: Kiểm thử tương đương (Equivalence testing) chia miền đầu vào thành các lớp dữ liệu mà từ đó các trường hợp kiểm thử có thể được lấy ra để giảm tổng số trường hợp kiểm thử phải được phát triển.",
      "các đáp án": [
        "A. Đúng (True)",
        "B. Sai (False)"
      ],
      "đáp án đúng": "A. Đúng (True)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 135: Với việc kiểm thử kỹ lưỡng (thorough testing), có thể loại bỏ tất cả các khuyết tật khỏi một chương trình trước khi giao cho khách hàng.",
      "các đáp án": [
        "A. Đúng (True)",
        "B. Sai (False)"
      ],
      "đáp án đúng": "B. Sai (False)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 139: Thực hiện đủ kiểm thử để đánh giá mọi đường đi (path) và điều kiện (condition) có thể có trong hệ thống ứng dụng. Phương pháp kiểm thử duy nhất đảm bảo chức năng hoạt động đúng của hệ thống ứng dụng được gọi là",
      "các đáp án": [
        "A. Kiểm thử hồi quy (Regression Testing)",
        "B. Kiểm thử toàn bộ (Exhaustive Testing)",
        "C. Kiểm thử đường đi cơ bản (Basic Path Testing)",
        "D. Kiểm thử nhánh (Branch Testing)"
      ],
      "đáp án đúng": "B. Kiểm thử toàn bộ (Exhaustive Testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 142: Các Trường hợp kiểm thử (Test Case) được nhóm thành các đơn vị có thể quản lý (và lên lịch) được gọi là",
      "các đáp án": [
        "A. Bộ khai thác kiểm thử (Test Harness)",
        "B. Bộ kiểm thử (Test Suite)",
        "C. Chu kỳ kiểm thử (Test Cycle)",
        "D. Trình điều khiển kiểm thử (Test Driver)"
      ],
      "đáp án đúng": "B. Bộ kiểm thử (Test Suite)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 144: Loại công cụ nào được sử dụng cho Kiểm thử hồi quy (Regression Testing)",
      "các đáp án": [
        "A. Hiệu năng (Performance)",
        "B. Ghi/Phát lại (Record/Playback)",
        "C. A. & B.",
        "D. Không có (None)"
      ],
      "đáp án đúng": "B. Ghi/Phát lại (Record/Playback)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 146: Trong sự kiện này, toàn bộ hệ thống được kiểm thử để xác minh rằng tất cả các yêu cầu về chức năng, thông tin cấu trúc và chất lượng đã được đáp ứng...",
      "các đáp án": [
        "A. Kiểm thử xác nhận (Validation Testing)",
        "B. Kiểm thử tích hợp (Integration Testing)",
        "C. Kiểm thử chấp nhận người dùng (User Acceptance Testing)",
        "D. Kiểm thử hệ thống (System Testing)"
      ],
      "đáp án đúng": "D. Kiểm thử hệ thống (System Testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 147: Trật tự thông thường của các hoạt động tổ chức kiểm thử phần mềm là gì?",
      "các đáp án": [
        "A. Đơn vị (Unit), tích hợp (integration), hệ thống (system), xác nhận (validation)",
        "B. Hệ thống (System), tích hợp (integration), đơn vị (unit), xác nhận (validation)",
        "C. Đơn vị (Unit), tích hợp (integration), xác nhận (validation), hệ thống (system)",
        "D. Không có điều nào ở trên"
      ],
      "đáp án đúng": "A. Đơn vị (Unit), tích hợp (integration), hệ thống (system), xác nhận (validation)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 148: Mục tiêu của người kiểm thử phần mềm là tìm ra lỗi (bugs), tìm chúng càng sớm càng tốt và đảm bảo chúng được sửa chữa.",
      "các đáp án": [
        "A. Đúng (True)",
        "B. Sai (False)"
      ],
      "đáp án đúng": "A. Đúng (True)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 149: Kiểm thử Beta (Beta testing) được thực hiện tại địa điểm của tổ chức phát triển trong khi Kiểm thử Alpha (Alpha testing) được thực hiện bởi mọi người tại địa điểm của riêng họ.",
      "các đáp án": [
        "A. Đúng (True)",
        "B. Sai (False)"
      ],
      "đáp án đúng": "B. Sai (False)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 150: Các thuộc tính chính của công cụ và tự động hóa là",
      "các đáp án": [
        "A. Tốc độ & hiệu quả (Speed & efficiency)",
        "B. Độ chính xác & độ chuẩn xác (Accuracy & precision)",
        "C. Tất cả những điều trên",
        "D. Không có điều nào ở trên"
      ],
      "đáp án đúng": "C. Tất cả những điều trên",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 153: Kỹ thuật kiểm thử yêu cầu thiết kế các trường hợp kiểm thử để chứng minh rằng mỗi chức năng của chương trình đều hoạt động được gọi là",
      "các đáp án": [
        "A. Kiểm thử hộp đen (Black-box testing)",
        "B. Kiểm thử hộp kính (Glass-box testing).",
        "C. Kiểm thử hộp xám (Grey-box testing)",
        "D. Kiểm thử hộp trắng (White-box testing)"
      ],
      "đáp án đúng": "A. Kiểm thử hộp đen (Black-box testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 154: Một kỹ thuật kiểm thử hộp trắng đo lường số lượng hoặc tỷ lệ phần trăm các hướng quyết định (decision directions) được thực thi bởi các trường hợp kiểm thử được thiết kế được gọi là",
      "các đáp án": [
        "A. Độ bao phủ điều kiện (Condition coverage)",
        "B. Độ bao phủ quyết định/điều kiện (Decision/Condition coverage)",
        "C. Độ bao phủ quyết định (Decision Coverage)",
        "D. Độ bao phủ nhánh (Branch coverage)"
      ],
      "đáp án đúng": "C. Độ bao phủ quyết định (Decision Coverage)",
      "nguồn ảnh": null
    }
  ],
  "Đề 3 (Q. 155 -> Q. 224)": [
    {
      "Câu": "Q. 155: Tài liệu nào tóm tắt các hoạt động kiểm thử liên quan đến một hoặc nhiều đặc tả thiết kế kiểm thử.",
      "các đáp án": [
        "A. Báo cáo tóm tắt kiểm thử (Test Summary report)",
        "B. Nhật ký kiểm thử (Test Log)",
        "C. Báo cáo sự cố kiểm thử (Test Incident Report)",
        "D. Kịch bản kiểm thử (Test Script)"
      ],
      "đáp án đúng": "A. Báo cáo tóm tắt kiểm thử (Test Summary report)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 158: Xác minh (Verification) có thể được định nghĩa là 'Chúng ta có đang xây dựng sản phẩm đúng cách không?'",
      "các đáp án": [
        "A. Đúng (True)",
        "B. Sai (False)"
      ],
      "đáp án đúng": "A. Đúng (True)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 159: Kiểm thử nào được sử dụng để xác minh rằng hệ thống có thể hoạt động đúng khi các giới hạn của chương trình hoặc hệ thống nội bộ bị vượt qua",
      "các đáp án": [
        "A. Kiểm thử căng thẳng (Stress Testing)",
        "B. Kiểm thử tải (Load Testing)",
        "C. Kiểm thử hiệu năng (Performance Testing)",
        "D. Kiểm thử khối lượng (Volume testing)"
      ],
      "đáp án đúng": "A. Kiểm thử căng thẳng (Stress Testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 160: Các khuyết tật được ghi lại vì ba mục đích chính. Chúng là: 1. Để sửa khuyết tật 2. Để báo cáo trạng thái của ứng dụng 3. Để cải thiện quy trình phát triển phần mềm",
      "các đáp án": [
        "A. Đúng (True)",
        "B. Sai (False)"
      ],
      "đáp án đúng": "A. Đúng (True)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 161: Drivers (Trình điều khiển) là các công cụ được sử dụng để kiểm soát và vận hành phần mềm đang được kiểm thử.",
      "các đáp án": [
        "A. Đúng (True)",
        "B. Sai (False)"
      ],
      "đáp án đúng": "A. Đúng (True)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 162: Các khuyết tật điển hình được phát hiện bằng phân tích tĩnh (static analysis) bao gồm",
      "các đáp án": [
        "A. Vi phạm tiêu chuẩn lập trình",
        "B. Tham chiếu đến một biến có giá trị không xác định",
        "C. Lỗ hổng bảo mật",
        "D. Tất cả ở trên"
      ],
      "đáp án đúng": "D. Tất cả ở trên",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 164: [...] là một bản dựng (build) rất sớm nhằm mục đích phân phối giới hạn cho một vài khách hàng chủ chốt và cho bộ phận tiếp thị cho mục đích demo.",
      "các đáp án": [
        "A. Bản phát hành Alpha (Alpha release)",
        "B. Bản phát hành Beta (Beta release)",
        "C. Tài liệu phát hành kiểm thử (Test release document)",
        "D. Bản dựng (Build)"
      ],
      "đáp án đúng": "A. Bản phát hành Alpha (Alpha release)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 167: Kiểm thử nào có thể không mô phỏng các tình huống thực tế (real world situations)",
      "các đáp án": [
        "A. Kiểm thử chức năng (Functional testing)",
        "B. Kiểm thử cấu trúc (Structural Testing)",
        "C. Tất cả những điều trên",
        "D. Không có điều nào ở trên"
      ],
      "đáp án đúng": "B. Kiểm thử cấu trúc (Structural Testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 169: Kiểm thử toàn bộ (Exhaustive testing) là có thể thực hiện được",
      "các đáp án": [
        "A. Đúng (True)",
        "B. Sai (False)"
      ],
      "đáp án đúng": "B. Sai (False)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 170: Công cụ lưu trữ các câu lệnh yêu cầu, kiểm tra tính nhất quán và cho phép các yêu cầu được ưu tiên và cho phép các kiểm thử cá nhân có thể truy vết đến các yêu cầu, chức năng và tính năng.",
      "các đáp án": [
        "A. Công cụ quản lý sự cố (Incident management tools)",
        "B. Công cụ quản lý yêu cầu (Requirements management tools)",
        "C. Công cụ quản lý cấu hình (Configuration management tools)",
        "D. Không có (None)"
      ],
      "đáp án đúng": "B. Công cụ quản lý yêu cầu (Requirements management tools)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 171: Số lượng bài kiểm thử để kiểm tra tất cả các câu lệnh điều khiển bằng với độ phức tạp cyclomatic",
      "các đáp án": [
        "A. Đúng (True)",
        "B. Sai (False)"
      ],
      "đáp án đúng": "A. Đúng (True)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 172: Phân tích giá trị biên (Boundary value analysis) chỉ có thể được sử dụng trong kiểm thử hộp trắng.",
      "các đáp án": [
        "A. Đúng (True)",
        "B. Sai (False)"
      ],
      "đáp án đúng": "B. Sai (False)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 173: Đâu là mục tiêu của kiểm thử phần mềm?",
      "các đáp án": [
        "A. Xác định năng suất của lập trình viên",
        "B. Loại bỏ nhu cầu bảo trì chương trình trong tương lai",
        "C. Loại bỏ mọi lỗi trước khi phát hành",
        "D. Phát hiện các lỗi phần mềm (Uncover software errors)"
      ],
      "đáp án đúng": "D. Phát hiện các lỗi phần mềm (Uncover software errors)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 174: Hư hỏng (Failure) là",
      "các đáp án": [
        "A. Hành vi chương trình không chính xác do một lỗi (fault) trong chương trình",
        "B. Lỗi (Bug) được tìm thấy trước khi phát hành sản phẩm",
        "C. Lỗi (Bug) được tìm thấy sau khi phát hành sản phẩm",
        "D. Lỗi (Bug) được tìm thấy trong giai đoạn Thiết kế"
      ],
      "đáp án đúng": "A. Hành vi chương trình không chính xác do một lỗi (fault) trong chương trình",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 175: Trong quá trình phát triển phần mềm, quy trình kiểm thử có thể bắt đầu tại thời điểm nào?",
      "các đáp án": [
        "A. Khi mã nguồn (code) hoàn tất.",
        "B. Khi thiết kế (design) hoàn tất.",
        "C. Khi các yêu cầu phần mềm (requirements) đã được phê duyệt.",
        "D. Khi mô-đun mã nguồn đầu tiên sẵn sàng để kiểm thử đơn vị"
      ],
      "đáp án đúng": "C. Khi các yêu cầu phần mềm (requirements) đã được phê duyệt.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 176: 'Bao nhiêu kiểm thử là đủ?'",
      "các đáp án": [
        "A. Câu hỏi này không thể trả lời được",
        "B. Câu hỏi này dễ trả lời",
        "C. Câu trả lời phụ thuộc vào rủi ro đối với ngành của bạn, hợp đồng và các yêu cầu đặc biệt",
        "D. Câu trả lời này phụ thuộc vào sự trưởng thành của các nhà phát triển của bạn"
      ],
      "đáp án đúng": "C. Câu trả lời phụ thuộc vào rủi ro đối với ngành của bạn, hợp đồng và các yêu cầu đặc biệt",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 177: Công cụ nào sau đây sẽ tham gia vào việc tự động hóa kiểm thử hồi quy?",
      "các đáp án": [
        "A. Trình kiểm thử dữ liệu (Data tester)",
        "B. Trình kiểm thử biên (Boundary tester)",
        "C. Ghi/Phát lại (Capture/Playback)",
        "D. Trình so sánh đầu ra (Output comparator)."
      ],
      "đáp án đúng": "C. Ghi/Phát lại (Capture/Playback)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 178: Hình thức không chính xác của Độ bao phủ Logic (Logic coverage) là:",
      "các đáp án": [
        "A. Độ bao phủ câu lệnh (Statement Coverage)",
        "B. Độ bao phủ cực (Pole Coverage)",
        "C. Độ bao phủ điều kiện (Condition Coverage)",
        "D. Độ bao phủ đường đi (Path Coverage)"
      ],
      "đáp án đúng": "B. Độ bao phủ cực (Pole Coverage)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 179: Độ bao phủ mã (Code Coverage) được sử dụng làm thước đo cho điều gì?",
      "các đáp án": [
        "A. Các khuyết tật (Defects)",
        "B. Phân tích xu hướng (Trends analysis)",
        "C. Hiệu quả kiểm thử (Test Effectiveness)",
        "D. Thời gian dành cho kiểm thử (Time Spent Testing)"
      ],
      "đáp án đúng": "C. Hiệu quả kiểm thử (Test Effectiveness)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 182: Một lý do chính khiến các nhà phát triển gặp khó khăn khi kiểm thử công việc của chính họ là:",
      "các đáp án": [
        "A. Thiếu tài liệu kỹ thuật",
        "B. Thiếu công cụ kiểm thử trên thị trường dành cho nhà phát triển",
        "C. Thiếu đào tạo",
        "D. Thiếu tính khách quan (Lack of Objectivity)"
      ],
      "đáp án đúng": "D. Thiếu tính khách quan (Lack of Objectivity)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 183: Độ bao phủ câu lệnh (Statement Coverage) sẽ không kiểm tra điều nào sau đây.",
      "các đáp án": [
        "A. Các câu lệnh bị thiếu (Missing Statements)",
        "B. Các nhánh không được sử dụng (Unused Branches)",
        "C. Mã chết (Dead Code)",
        "D. Câu lệnh không được sử dụng (Unused Statement)"
      ],
      "đáp án đúng": "A. Các câu lệnh bị thiếu (Missing Statements)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 185: Để kiểm thử một hàm (function), lập trình viên phải viết một [...] để gọi hàm cần kiểm thử và truyền dữ liệu kiểm thử cho nó.",
      "các đáp án": [
        "A. Stub (Giả lập bị động)",
        "B. Driver (Trình điều khiển)",
        "C. Proxy (Ủy quyền)",
        "D. Không có điều nào ở trên"
      ],
      "đáp án đúng": "B. Driver (Trình điều khiển)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 186: Chọn định nghĩa tốt nhất về chất lượng (quality)",
      "các đáp án": [
        "A. Chất lượng là công việc số một",
        "B. Không có lỗi (Zero defects)",
        "C. Tuân thủ các yêu cầu (Conformance to requirements)",
        "D. Hoạt động như được thiết kế"
      ],
      "đáp án đúng": "C. Tuân thủ các yêu cầu (Conformance to requirements)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 187: Kiểm thử giá trị biên (Boundary value testing)",
      "các đáp án": [
        "A. Giống như kiểm thử phân vùng tương đương",
        "B. Kiểm tra các điều kiện biên trên, dưới và tại các cạnh của các lớp tương đương đầu vào và đầu ra",
        "C. Kiểm tra sự kết hợp của các trường hợp đầu vào",
        "D. Được sử dụng trong chiến lược kiểm thử hộp trắng"
      ],
      "đáp án đúng": "B. Kiểm tra các điều kiện biên trên, dưới và tại các cạnh của các lớp tương đương đầu vào và đầu ra",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 188: Một trường nhập liệu (input field) nhận năm sinh trong khoảng từ 1900 đến 2004. Các giá trị biên để kiểm thử trường này là",
      "các đáp án": [
        "A. 0, 1900, 2004, 2005",
        "B. 1900, 2004",
        "C. 1899, 1900, 2004, 2005",
        "D. 1899, 1900, 1901, 2003, 2004, 2005"
      ],
      "đáp án đúng": "C. 1899, 1900, 2004, 2005",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 190: Một kỹ thuật kiểm thử phổ biến trong quá trình kiểm thử thành phần (component test) là",
      "các đáp án": [
        "A. Kiểm thử câu lệnh và nhánh (Statement and branch testing)",
        "B. Kiểm thử tính khả dụng (Usability testing)",
        "C. Kiểm thử bảo mật (Security testing)",
        "D. Kiểm thử hiệu năng (Performance testing)"
      ],
      "đáp án đúng": "A. Kiểm thử câu lệnh và nhánh (Statement and branch testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 192: Các trường hợp kiểm thử chấp nhận (Acceptance test cases) dựa trên điều gì?",
      "các đáp án": [
        "A. Yêu cầu (Requirements)",
        "B. Thiết kế (Design)",
        "C. Mã nguồn (Code)",
        "D. Bảng quyết định (Decision table)"
      ],
      "đáp án đúng": "A. Yêu cầu (Requirements)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 193: Đâu là các phương pháp kiểm thử phi chức năng (non-functional testing)?",
      "các đáp án": [
        "A. Kiểm thử hệ thống (System testing)",
        "B. Kiểm thử tính khả dụng (Usability testing)",
        "C. Kiểm thử hiệu năng (Performance testing)",
        "D. Cả B & C"
      ],
      "đáp án đúng": "D. Cả B & C",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 194: Xác minh & Xác nhận Độc lập (Independent Verification & Validation) là",
      "các đáp án": [
        "A. Được thực hiện bởi Nhà phát triển (Developer)",
        "B. Được thực hiện bởi các Kỹ sư kiểm thử (Test Engineers)",
        "C. Được thực hiện bởi Ban quản lý (Management)",
        "D. Được thực hiện bởi một Thực thể bên ngoài phạm vi ảnh hưởng của Dự án"
      ],
      "đáp án đúng": "D. Được thực hiện bởi một Thực thể bên ngoài phạm vi ảnh hưởng của Dự án",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 196: Đâu có thể là lý do gây ra hư hỏng (failure)? 1) Lỗi kiểm thử (Testing fault). 2) Lỗi phần mềm (Software fault). 3) Lỗi thiết kế (Design fault). 4) Lỗi môi trường (Environment Fault). 5) Lỗi tài liệu (Documentation Fault).",
      "các đáp án": [
        "A. 2 là lý do hợp lệ; 1, 3, 4 & 5 thì không",
        "B. 1, 2, 3, 4 là lý do hợp lệ; 5 thì không",
        "C. 1, 2, 3 là lý do hợp lệ; 4 & 5 thì không",
        "D. Tất cả chúng đều là lý do hợp lệ cho hư hỏng"
      ],
      "đáp án đúng": "D. Tất cả chúng đều là lý do hợp lệ cho hư hỏng",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 197: Các bài kiểm thử được ưu tiên để:",
      "các đáp án": [
        "A. Bạn rút ngắn thời gian cần thiết cho kiểm thử",
        "B. Bạn thực hiện kiểm thử tốt nhất trong thời gian có sẵn",
        "C. Bạn thực hiện kiểm thử hiệu quả hơn",
        "D. Bạn tìm thấy nhiều lỗi (faults) hơn."
      ],
      "đáp án đúng": "B. Bạn thực hiện kiểm thử tốt nhất trong thời gian có sẵn",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 199: Trong hoạt động kiểm thử nào, các lỗi (faults) có thể được tìm thấy với chi phí hiệu quả nhất?",
      "các đáp án": [
        "A. Thực thi (Execution)",
        "B. Thiết kế (Design)",
        "C. Lập kế hoạch (Planning)",
        "D. Kiểm tra hoàn thành tiêu chí rút lui (Check Exit criteria completion)"
      ],
      "đáp án đúng": "C. Lập kế hoạch (Planning)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 201: Đầu vào để phát triển một kế hoạch kiểm thử (test plan) được lấy từ",
      "các đáp án": [
        "A. Kế hoạch dự án (Project plan)",
        "B. Kế hoạch kinh doanh (Business plan)",
        "C. Kế hoạch hỗ trợ (Support plan)",
        "D. Không có điều nào ở trên"
      ],
      "đáp án đúng": "A. Kế hoạch dự án (Project plan)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 202: Để kiểm thử một hàm (function), lập trình viên phải viết một [...] để gọi hàm cần kiểm thử và truyền dữ liệu kiểm thử cho nó. (Câu này lặp lại Q. 185)",
      "các đáp án": [
        "A. Stub (Giả lập bị động)",
        "B. Driver (Trình điều khiển)",
        "C. Proxy (Ủy quyền)",
        "D. Không có điều nào ở trên"
      ],
      "đáp án đúng": "B. Driver (Trình điều khiển)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 203: Đâu không phải là kỹ thuật kiểm thử tĩnh (static testing technique)",
      "các đáp án": [
        "A. Đoán lỗi (Error guessing)",
        "B. Đánh giá đồng cấp (Walkthrough)",
        "C. Phân tích luồng dữ liệu (Data flow analysis)",
        "D. Kiểm tra (Inspections)"
      ],
      "đáp án đúng": "A. Đoán lỗi (Error guessing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 204: Phát biểu nào sau đây về kiểm thử thành phần (component testing) là không đúng?",
      "các đáp án": [
        "A. Kiểm thử thành phần nên được thực hiện bởi bộ phận phát triển",
        "B. Kiểm thử thành phần còn được gọi là kiểm thử cô lập hoặc kiểm thử mô-đun",
        "C. Kiểm thử thành phần nên có các tiêu chí hoàn thành được lập kế hoạch",
        "D. Kiểm thử thành phần không bao gồm kiểm thử hồi quy"
      ],
      "đáp án đúng": "D. Kiểm thử thành phần không bao gồm kiểm thử hồi quy",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 205: Kiểm tra (Inspections) có thể tìm thấy tất cả những điều sau đây ngoại trừ",
      "các đáp án": [
        "A. Các biến không được định nghĩa trong mã nguồn",
        "B. Lỗi chính tả và ngữ pháp trong tài liệu",
        "C. Các yêu cầu đã bị bỏ qua khỏi tài liệu thiết kế",
        "D. Bao nhiêu phần trăm mã nguồn đã được bao phủ (covered)"
      ],
      "đáp án đúng": "D. Bao nhiêu phần trăm mã nguồn đã được bao phủ (covered)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 208: Phân vùng tương đương (Equivalence partitioning) là:",
      "các đáp án": [
        "A. Một kỹ thuật kiểm thử hộp đen chỉ được sử dụng bởi các nhà phát triển",
        "B. Một kỹ thuật kiểm thử hộp đen chỉ có thể được sử dụng trong quá trình kiểm thử hệ thống",
        "C. Một kỹ thuật kiểm thử hộp đen phù hợp với tất cả các cấp độ kiểm thử",
        "D. Một kỹ thuật kiểm thử hộp trắng phù hợp với kiểm thử thành phần"
      ],
      "đáp án đúng": "C. Một kỹ thuật kiểm thử hộp đen phù hợp với tất cả các cấp độ kiểm thử",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 209: Nếu một kết quả mong đợi (expected result) không được chỉ định thì:",
      "các đáp án": [
        "A. Chúng ta không thể chạy bài kiểm thử",
        "B. Có thể khó lặp lại bài kiểm thử",
        "C. Có thể khó xác định xem bài kiểm thử đã đỗ (passed) hay trượt (failed)",
        "D. Chúng ta không thể tự động hóa các đầu vào của người dùng"
      ],
      "đáp án đúng": "C. Có thể khó xác định xem bài kiểm thử đã đỗ (passed) hay trượt (failed)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 210: Bao nhiêu kiểm thử là đủ",
      "các đáp án": [
        "A. Câu hỏi này không thể trả lời được",
        "B. Câu trả lời phụ thuộc vào rủi ro đối với ngành của bạn, hợp đồng và các yêu cầu đặc biệt",
        "C. Câu trả lời phụ thuộc vào sự trưởng thành của các nhà phát triển của bạn",
        "D. Câu trả lời nên được tiêu chuẩn hóa cho ngành công nghiệp phát triển phần mềm"
      ],
      "đáp án đúng": "B. Câu trả lời phụ thuộc vào rủi ro đối với ngành của bạn, hợp đồng và các yêu cầu đặc biệt",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 211: Mục đích của pha yêu cầu (requirement phase) là",
      "các đáp án": [
        "A. Để chốt (freeze) các yêu cầu",
        "B. Để hiểu nhu cầu của người dùng",
        "C. Để xác định phạm vi của kiểm thử",
        "D. Tất cả những điều trên"
      ],
      "đáp án đúng": "D. Tất cả những điều trên",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 212: Phương pháp Kiểm thử vòng lặp (Loop Testing) có thể kiểm thử thành công loại nào trong số này?",
      "các đáp án": [
        "A. Vòng lặp đơn (Simple Loops)",
        "B. Vòng lặp lồng nhau (Nested Loops)",
        "C. Vòng lặp nối tiếp (Concatenated Loops)",
        "D. Tất cả những điều trên"
      ],
      "đáp án đúng": "D. Tất cả những điều trên",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 213: Phương pháp Độ phức tạp Cyclomatic (Cyclomatic Complexity) thuộc phương pháp kiểm thử nào.",
      "các đáp án": [
        "A. Hộp trắng (White box)",
        "B. Hộp đen (Black box)",
        "C. Hộp xanh (Green box)",
        "D. Hộp vàng (Yellow box)"
      ],
      "đáp án đúng": "A. Hộp trắng (White box)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 214: Một hệ thống đáng tin cậy (reliable system) sẽ là một hệ thống:",
      "các đáp án": [
        "A. Không có khả năng hoàn thành đúng tiến độ",
        "B. Không có khả năng gây ra hư hỏng (failure)",
        "C. Có khả năng không có lỗi (fault-free)",
        "D. Có khả năng được người dùng yêu thích"
      ],
      "đáp án đúng": "B. Không có khả năng gây ra hư hỏng (failure)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 216: Một bài kiểm thử hồi quy (regression test):",
      "các đáp án": [
        "A. Sẽ luôn luôn được tự động hóa",
        "B. Sẽ giúp đảm bảo các khu vực không thay đổi của phần mềm không bị ảnh hưởng",
        "C. Sẽ giúp đảm bảo các khu vực đã thay đổi của phần mềm không bị ảnh hưởng",
        "D. Chỉ có thể được chạy trong quá trình kiểm thử chấp nhận người dùng"
      ],
      "đáp án đúng": "B. Sẽ giúp đảm bảo các khu vực không thay đổi của phần mềm không bị ảnh hưởng",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 219: Xác minh (Verification) là:",
      "các đáp án": [
        "A. Kiểm tra rằng chúng ta đang xây dựng đúng hệ thống (right system)",
        "B. Kiểm tra rằng chúng ta đang xây dựng hệ thống đúng cách (system right)",
        "C. Được thực hiện bởi một nhóm kiểm thử độc lập",
        "D. Đảm bảo rằng đó là những gì người dùng thực sự muốn"
      ],
      "đáp án đúng": "B. Kiểm tra rằng chúng ta đang xây dựng hệ thống đúng cách (system right)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 220: Sự khác biệt giữa kiểm thử lại (re-testing) và kiểm thử hồi quy (regression testing) là",
      "các đáp án": [
        "A. Kiểm thử lại là chạy lại một bài kiểm thử; kiểm thử hồi quy tìm kiếm các tác dụng phụ không mong muốn",
        "B. Kiểm thử lại tìm kiếm các tác dụng phụ không mong muốn; kiểm thử hồi quy là lặp lại các bài kiểm thử đó",
        "C. Kiểm thử lại được thực hiện sau khi các lỗi được sửa; kiểm thử hồi quy được thực hiện sớm hơn",
        "D. Kiểm thử lại sử dụng các môi trường khác nhau, kiểm thử hồi quy sử dụng cùng một môi trường",
        "E. Kiểm thử lại được thực hiện bởi các nhà phát triển, kiểm thử hồi quy được thực hiện bởi những người kiểm thử độc lập"
      ],
      "đáp án đúng": "A. Kiểm thử lại là chạy lại một bài kiểm thử; kiểm thử hồi quy tìm kiếm các tác dụng phụ không mong muốn",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 221: Nên dừng kiểm thử khi:",
      "các đáp án": [
        "A. Tất cả các bài kiểm thử đã lên kế hoạch đã được chạy",
        "B. Đã hết thời gian",
        "C. Tất cả các lỗi đã được sửa chữa chính xác",
        "D. Cả A. và C.",
        "E. Tùy thuộc vào rủi ro đối với hệ thống đang được kiểm thử"
      ],
      "đáp án đúng": "E. Tùy thuộc vào rủi ro đối với hệ thống đang được kiểm thử",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 222: Đâu là mục đích chính của chiến lược tích hợp (integration strategy) cho kiểm thử tích hợp ở quy mô nhỏ (in the small)?",
      "các đáp án": [
        "A. Để đảm bảo rằng tất cả các mô-đun nhỏ được kiểm thử đầy đủ",
        "B. Để đảm bảo rằng hệ thống giao tiếp với các hệ thống và mạng khác",
        "C. Để chỉ định mô-đun nào cần kết hợp khi nào và bao nhiêu mô-đun cùng một lúc",
        "D. Để đảm bảo rằng kiểm thử tích hợp có thể được thực hiện bởi một nhóm nhỏ",
        "E. Để chỉ định cách phần mềm nên được chia thành các mô-đun"
      ],
      "đáp án đúng": "C. Để chỉ định mô-đun nào cần kết hợp khi nào và bao nhiêu mô-đun cùng một lúc",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 224: Kiểm thử hồi quy (Regression testing) nên được thực hiện: v) Hàng tuần. w) Sau khi phần mềm đã thay đổi. x) Càng thường xuyên càng tốt. y) Khi môi trường đã thay đổi. z) Khi quản lý dự án nói",
      "các đáp án": [
        "A. v & w là đúng, X-z là sai",
        "B. w, x & y là đúng, v & z là sai",
        "C. w & y là đúng, v, x & z là sai",
        "D. w là đúng, v, x y và z là sai",
        "E. Tất cả những điều trên đều đúng"
      ],
      "đáp án đúng": "C. w & y là đúng, v, x & z là sai",
      "nguồn ảnh": null
    }
  ],
  "Đề 4 (Q. 225 -> Q. 302)": [
    {
      "Câu": "Q. 225: Một công cụ hỗ trợ truy xuất nguồn gốc (traceability), ghi lại các sự cố (incidents) hoặc lên lịch kiểm thử (scheduling of tests) được gọi là:",
      "các đáp án": [
        "A. Một công cụ phân tích động (dynamic analysis tool)",
        "B. Một công cụ thực thi kiểm thử (test execution tool)",
        "C. Một công cụ gỡ lỗi (debugging tool)",
        "D. Một công cụ quản lý kiểm thử (test management tool)",
        "E. Một công cụ quản lý cấu hình (configuration management tool)"
      ],
      "đáp án đúng": "D. Một công cụ quản lý kiểm thử (test management tool)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 226: Chi phí sửa một lỗi (fault):",
      "các đáp án": [
        "A. Không quan trọng",
        "B. Tăng lên khi chúng ta đưa sản phẩm đến gần hơn với việc sử dụng thực tế (live use)",
        "C. Giảm xuống khi chúng ta đưa sản phẩm đến gần hơn với việc sử dụng thực tế",
        "D. Đắt hơn nếu được tìm thấy trong yêu cầu so với thiết kế chức năng",
        "E. Không bao giờ có thể xác định được"
      ],
      "đáp án đúng": "B. Tăng lên khi chúng ta đưa sản phẩm đến gần hơn với việc sử dụng thực tế (live use)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 227: Số đơn đặt hàng trên hệ thống kiểm soát kho hàng có thể nằm trong khoảng từ 10000 đến 99999 (bao gồm). Những đầu vào nào sau đây có thể là kết quả của việc thiết kế kiểm thử chỉ cho các lớp tương đương hợp lệ và các biên hợp lệ:",
      "các đáp án": [
        "A. 1000, 5000, 99999",
        "B. 9999, 50000, 100000",
        "C. 10000, 50000, 99999",
        "D. 10000, 99999",
        "E. 9999, 10000, 50000, 99999, 10000"
      ],
      "đáp án đúng": "C. 10000, 50000, 99999",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 228: Khi những gì người dùng cuối nhìn thấy là một sự sai lệch so với hành vi cụ thể hoặc mong đợi, điều này được gọi là:",
      "các đáp án": [
        "A. Một lỗi (An error)",
        "B. Một lỗi (A fault)",
        "C. Một hư hỏng (A failure)",
        "D. Một khuyết tật (A defect)",
        "E. Một nhầm lẫn (A mistake)"
      ],
      "đáp án đúng": "C. Một hư hỏng (A failure)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 232: Đâu KHÔNG phải là một phần của kiểm thử hệ thống (system testing):",
      "các đáp án": [
        "A. Kiểm thử dựa trên quy trình nghiệp vụ (Business process-based testing)",
        "B. Kiểm thử hiệu năng, tải và căng thẳng (Performance, load and stress testing)",
        "C. Kiểm thử dựa trên yêu cầu (Requirements-based testing)",
        "D. Kiểm thử tính khả dụng (Usability testing)",
        "E. Kiểm thử tích hợp từ trên xuống (Top-down integration testing)"
      ],
      "đáp án đúng": "E. Kiểm thử tích hợp từ trên xuống (Top-down integration testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 234: Đâu không phải là một phần của kiểm thử hiệu năng (performance testing):",
      "các đáp án": [
        "A. Đo lường thời gian phản hồi (Measuring response time)",
        "B. Đo lường tỷ lệ giao dịch (Measuring transaction rates)",
        "C. Kiểm thử phục hồi (Recovery testing)",
        "D. Mô phỏng nhiều người dùng (Simulating many users)",
        "E. Tạo ra nhiều giao dịch (Generating many transactions)"
      ],
      "đáp án đúng": "C. Kiểm thử phục hồi (Recovery testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 235: Mục đích của tiêu chí hoàn thành kiểm thử (test completion criteria) trong một kế hoạch kiểm thử là gì:",
      "các đáp án": [
        "A. Để biết khi nào một bài kiểm thử cụ thể đã kết thúc việc thực thi",
        "B. Để đảm bảo rằng đặc tả trường hợp kiểm thử đã hoàn chỉnh",
        "C. Để đặt ra các tiêu chí được sử dụng khi tạo ra các đầu vào kiểm thử",
        "D. Để biết khi nào việc lập kế hoạch kiểm thử hoàn tất",
        "E. Để lên kế hoạch khi nào dừng kiểm thử"
      ],
      "đáp án đúng": "E. Để lên kế hoạch khi nào dừng kiểm thử",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 237: Mã không thể truy cập (Unreachable code) sẽ được tìm thấy tốt nhất bằng cách sử dụng:",
      "các đáp án": [
        "A. Đánh giá mã (Code reviews)",
        "B. Kiểm tra mã (Code inspections)",
        "C. Một công cụ đo độ bao phủ (coverage tool)",
        "D. Một công cụ quản lý kiểm thử (test management tool)",
        "E. Một công cụ phân tích tĩnh (static analysis tool)"
      ],
      "đáp án đúng": "E. Một công cụ phân tích tĩnh (static analysis tool)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 238: Thông tin nào không cần thiết phải bao gồm trong một báo cáo sự cố kiểm thử (test incident report):",
      "các đáp án": [
        "A. Cách sửa lỗi (How to fix the fault)",
        "B. Cách tái hiện lỗi (How to reproduce the fault)",
        "C. Chi tiết môi trường kiểm thử (Test environment details)",
        "D. Mức độ nghiêm trọng, độ ưu tiên (Severity, priority)",
        "E. Kết quả thực tế và kết quả mong đợi (The actual and expected outcomes)"
      ],
      "đáp án đúng": "A. Cách sửa lỗi (How to fix the fault)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 239: Đâu KHÔNG được bao gồm trong tài liệu Kế hoạch Kiểm thử (Test Plan) của Tiêu chuẩn Tài liệu Kiểm thử (Test Documentation Standard):",
      "các đáp án": [
        "A. Các hạng mục kiểm thử (Test items) (tức là các phiên bản phần mềm)",
        "B. Những gì không được kiểm thử (What is not to be tested)",
        "C. Môi trường kiểm thử (Test environments)",
        "D. Kế hoạch chất lượng (Quality plans)",
        "E. Lịch trình và thời hạn (Schedules and deadlines)"
      ],
      "đáp án đúng": "D. Kế hoạch chất lượng (Quality plans)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 251: Đâu KHÔNG phải là kỹ thuật hộp đen (black box technique):",
      "các đáp án": [
        "A. Phân vùng tương đương (Equivalence partitioning)",
        "B. Kiểm thử chuyển đổi trạng thái (State transition testing)",
        "C. LCSAJ (Linear Code Sequence and Jump)",
        "D. Kiểm thử cú pháp (Syntax testing)",
        "E. Phân tích giá trị biên (Boundary value analysis)"
      ],
      "đáp án đúng": "C. LCSAJ (Linear Code Sequence and Jump)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 252: Các kết quả mong đợi (Expected results):",
      "các đáp án": [
        "A. Chỉ quan trọng trong kiểm thử hệ thống",
        "B. Chỉ được sử dụng trong kiểm thử thành phần",
        "C. Không bao giờ được chỉ định trước",
        "D. Hữu ích nhất khi được chỉ định trước",
        "E. Được lấy ra từ mã nguồn"
      ],
      "đáp án đúng": "D. Hữu ích nhất khi được chỉ định trước",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 253: Kiểm thử Beta (Beta testing) là:",
      "các đáp án": [
        "A. Được thực hiện bởi khách hàng tại địa điểm của chính họ",
        "B. Được thực hiện bởi khách hàng tại địa điểm của nhà phát triển phần mềm của họ",
        "C. Được thực hiện bởi một nhóm kiểm thử độc lập",
        "D. Hữu ích để kiểm thử phần mềm đặt hàng (bespoke software)",
        "E. Được thực hiện càng sớm càng tốt trong vòng đời"
      ],
      "đáp án đúng": "A. Được thực hiện bởi khách hàng tại địa điểm của chính họ",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 255: Một công cụ thực thi kiểm thử (test execution tool) thương mại điển hình có thể thực hiện tất cả những điều sau NGOẠI TRỪ:",
      "các đáp án": [
        "A. Tạo ra các kết quả mong đợi (Generating expected outputs)",
        "B. Phát lại (Replaying) các đầu vào theo một kịch bản đã được lập trình",
        "C. So sánh các kết quả mong đợi với các kết quả thực tế",
        "D. Ghi lại (Recording) các đầu vào kiểm thử",
        "E. Đọc các giá trị kiểm thử từ một tệp dữ liệu"
      ],
      "đáp án đúng": "A. Tạo ra các kết quả mong đợi (Generating expected outputs)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 256: Xem xét các phát biểu sau về thiết kế kiểm thử sớm (early test design): i. Thiết kế kiểm thử sớm có thể ngăn ngừa sự nhân lên của lỗi. ii. Các lỗi được tìm thấy trong quá trình thiết kế kiểm thử sớm sẽ tốn kém hơn để sửa. iii. Thiết kế kiểm thử sớm có thể tìm thấy lỗi. iv. Thiết kế kiểm thử sớm có thể gây ra những thay đổi đối với yêu cầu. v. Thiết kế kiểm thử sớm tốn nhiều công sức hơn.",
      "các đáp án": [
        "A. i, iii & iv là đúng. ii & v là sai",
        "B. iii là đúng, i, ii, iv & v là sai",
        "C. iii & iv là đúng. i, ii & v là sai",
        "D. i, iii, iv & v là đúng, ii là sai",
        "E. i & iii là đúng, ii, iv & v là sai"
      ],
      "đáp án đúng": "A. i, iii & iv là đúng. ii & v là sai",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 258: Nơi để bắt đầu nếu bạn muốn có một công cụ kiểm thử (mới) là:",
      "các đáp án": [
        "A. Tham dự một triển lãm công cụ",
        "B. Mời một nhà cung cấp đến demo",
        "C. Phân tích nhu cầu và yêu cầu của bạn",
        "D. Tìm hiểu ngân sách của bạn cho công cụ sẽ là bao nhiêu",
        "E. Tìm kiếm trên internet"
      ],
      "đáp án đúng": "C. Phân tích nhu cầu và yêu cầu của bạn",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 259: Đoán lỗi (Error guessing) được sử dụng tốt nhất",
      "các đáp án": [
        "A. Như là phương pháp tiếp cận đầu tiên để lấy ra các trường hợp kiểm thử",
        "B. Sau khi các kỹ thuật chính thức hơn đã được áp dụng",
        "C. Bởi những người kiểm thử thiếu kinh nghiệm",
        "D. Sau khi hệ thống đã đi vào hoạt động (go live)",
        "E. Chỉ bởi người dùng cuối"
      ],
      "đáp án đúng": "B. Sau khi các kỹ thuật chính thức hơn đã được áp dụng",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 260: Tiêu chí rút lui (Exit Criteria) có thể bao gồm: i. Các thước đo về tính kỹ lưỡng, chẳng hạn như độ bao phủ của mã, chức năng hoặc rủi ro. ii. Các ước tính về mật độ Khuyết tật hoặc các thước đo độ tin cậy. iii. Rủi ro còn sót lại (Residual risk) như các khuyết tật chưa được sửa hoặc thiếu độ bao phủ kiểm thử ở một số khu vực nhất định. iv. Xác minh Môi trường Kiểm thử.",
      "các đáp án": [
        "A. iv là đúng và i, ii, iii là sai.",
        "B. i, ii, iii là đúng và iv là sai",
        "C. ii là đúng và i, ii, iii là sai",
        "D. iii và iv là đúng và i, ii là sai"
      ],
      "đáp án đúng": "B. i, ii, iii là đúng và iv là sai",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 261: Một trong các trường trên một biểu mẫu (form) chứa một hộp văn bản (text box), chấp nhận các bảng chữ cái (alphabets) viết thường hoặc viết hoa. Xác định giá trị Lớp tương đương (Equivalance class) không hợp lệ.",
      "các đáp án": [
        "A. CLASS",
        "B. CLASS (lặp lại A)",
        "C. CLass",
        "D. CLa01ss"
      ],
      "đáp án đúng": "D. CLa01ss",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 264: Xác nhận (Validation) bao gồm những điều sau",
      "các đáp án": [
        "A. Tùy chọn i, ii, iii, iv là đúng.",
        "B. ii là đúng và i, iii, iv là sai",
        "C. i, ii, iii là đúng và iv là sai",
        "D. iii là đúng và i, ii, iv là sai."
      ],
      "đáp án đúng": "B. ii là đúng và i, iii, iv là sai",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 265: Các yếu tố thành công cho một buổi đánh giá (review) bao gồm: i. Mỗi buổi đánh giá không có một mục tiêu được xác định trước. ii. Các khuyết tật được tìm thấy được chào đón và bày tỏ một cách khách quan. iii. Quản lý hỗ trợ một quy trình đánh giá tốt. iv. Có sự nhấn mạnh vào việc học hỏi và cải tiến quy trình.",
      "các đáp án": [
        "A. ii, iii, iv là đúng và i là sai",
        "B. iii, i, iv là đúng và ii là sai",
        "C. i, iii, iv, ii là sai",
        "D. ii là đúng"
      ],
      "đáp án đúng": "A. ii, iii, iv là đúng và i là sai",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 266: Điều nào sau đây giúp giám sát Tiến độ Kiểm thử (Test Progress): i. Tỷ lệ phần trăm Thực thi Trường hợp Kiểm thử. ii. Tỷ lệ phần trăm công việc đã hoàn thành trong việc chuẩn bị môi trường kiểm thử. iii. Thông tin Khuyết tật, ví dụ: mật độ khuyết tật, các khuyết tật được tìm thấy và đã sửa. iv. Quy mô của nhóm kiểm thử và kỹ năng của các kỹ sư.",
      "các đáp án": [
        "A. iv là đúng và i, ii, iii là sai",
        "B. i, ii, iii là đúng và iv là sai",
        "C. i, ii là đúng và iii, iv là sai",
        "D. i, iv là đúng và ii, iii là sai"
      ],
      "đáp án đúng": "B. i, ii, iii là đúng và iv là sai",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 267: Các khuyết tật được phát hiện bởi các công cụ phân tích tĩnh (static analysis) bao gồm: i. Các biến không bao giờ được sử dụng. ii. Các lỗ hổng bảo mật. iii. Vi phạm Tiêu chuẩn Lập trình. iv. Các hàm và thủ tục không được gọi.",
      "các đáp án": [
        "A. i, ii, iii, iv là đúng",
        "B. iii, là đúng i, ii, iv là sai.",
        "C. i, ii, iii và iv là sai",
        "D. iv, ii là đúng"
      ],
      "đáp án đúng": "A. i, ii, iii, iv là đúng",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 268: Điều nào sau đây là đúng về Kỹ thuật Kiểm thử Hộp trắng (White) và Hộp đen (Black Box):-",
      "các đáp án": [
        "A. Phân vùng tương đương, Bảng quyết định và Luồng điều khiển (Control flow) là các Kỹ thuật Kiểm thử Hộp trắng.",
        "B. Phân vùng tương đương, Phân tích giá trị biên, Luồng dữ liệu (Data Flow) là các Kỹ thuật Kiểm thử Hộp đen.",
        "C. Phân vùng tương đương, Chuyển đổi trạng thái, Kiểm thử trường hợp sử dụng là các Kỹ thuật Kiểm thử Hộp đen.",
        "D. Phân vùng tương đương, Chuyển đổi trạng thái, Kiểm thử trường hợp sử dụng và Bảng quyết định là các Kỹ thuật Kiểm thử Hộp trắng."
      ],
      "đáp án đúng": "C. Phân vùng tương đương, Chuyển đổi trạng thái, Kiểm thử trường hợp sử dụng là các Kỹ thuật Kiểm thử Hộp đen.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 269: Kỹ thuật nào sau đây KHÔNG phải là kỹ thuật hộp đen (black box technique)?",
      "các đáp án": [
        "A. Kiểm thử chuyển đổi trạng thái (State transition testing)",
        "B. LCSAJ (Linear Code Sequence and Jump)",
        "C. Kiểm thử cú pháp (Syntax testing)",
        "D. Phân tích giá trị biên (Boundary value analysis)"
      ],
      "đáp án đúng": "B. LCSAJ (Linear Code Sequence and Jump)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 270: Các đặc điểm của Kỹ thuật Kiểm thử Hộp trắng (White Box Testing Technique): i. Chúng ta sử dụng kiến thức rõ ràng về hoạt động bên trong của hạng mục đang được kiểm thử... ii. Sử dụng kiến thức cụ thể về mã lập trình để kiểm tra đầu ra... iii. Kiểm tra hiệu năng của ứng dụng. iv. Đồng thời kiểm tra chức năng.",
      "các đáp án": [
        "A. i, ii là đúng và iii và iv là sai",
        "B. iii là đúng và i, ii, iv là sai",
        "C. ii, iii là đúng và i, iv là sai",
        "D. iii và iv là đúng và i, ii là sai"
      ],
      "đáp án đúng": "A. i, ii là đúng và iii và iv là sai",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 272: Việc lựa chọn một phương pháp kiểm thử (test approach) nên xem xét bối cảnh: i. Rủi ro thất bại của Dự án, các mối nguy hiểm cho sản phẩm... ii. Kỹ năng và kinh nghiệm của nhân sự... iii. Mục tiêu của nỗ lực kiểm thử và sứ mệnh của nhóm kiểm thử. iv. Quy mô của nhóm kiểm thử",
      "các đáp án": [
        "A. i, ii, iii, iv là đúng",
        "B. i, ii, iii là đúng và iv là sai.",
        "C. ii, iii, iv là đúng và i là sai.",
        "D. i, iv là đúng và ii, iii là sai."
      ],
      "đáp án đúng": "B. i, ii, iii là đúng và iv là sai.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 273: Lợi ích của Kiểm thử Độc lập (Independent Testing)",
      "các đáp án": [
        "A. Người kiểm thử độc lập có trình độ cao hơn nhiều so với Nhà phát triển",
        "B. Người kiểm thử độc lập nhìn thấy các khuyết tật khác và không thiên vị.",
        "C. Người kiểm thử độc lập không thể xác định các khuyết tật.",
        "D. Người kiểm thử độc lập có thể kiểm thử tốt hơn nhà phát triển"
      ],
      "đáp án đúng": "B. Người kiểm thử độc lập nhìn thấy các khuyết tật khác và không thiên vị.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 275: Các Điều kiện Kiểm thử (Test Conditions) được lấy từ:",
      "các đáp án": [
        "A. Đặc tả (Specifications)",
        "B. Các Trường hợp Kiểm thử (Test Cases)",
        "C. Dữ liệu Kiểm thử (Test Data)",
        "D. Thiết kế Kiểm thử (Test Design)"
      ],
      "đáp án đúng": "A. Đặc tả (Specifications)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 277: Phân tích Tác động (Impact Analysis) giúp quyết định:",
      "các đáp án": [
        "A. Cần thực hiện bao nhiêu kiểm thử hồi quy.",
        "B. Tiêu chí rút lui (Exit Criteria)",
        "C. Cần viết thêm bao nhiêu trường hợp kiểm thử.",
        "D. Các công cụ khác nhau để thực hiện Kiểm thử Hồi quy"
      ],
      "đáp án đúng": "A. Cần thực hiện bao nhiêu kiểm thử hồi quy.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 279: Đâu không phải là một loại phương pháp kiểm thử gia tăng (incremental testing approach)?",
      "các đáp án": [
        "A. Từ trên xuống (Top down)",
        "B. Big-bang",
        "C. Từ dưới lên (Bottom up)",
        "D. Tăng dần chức năng (Functional incrementation)."
      ],
      "đáp án đúng": "B. Big-bang",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 280: Trong một hệ thống được thiết kế để tính thuế phải nộp: Một nhân viên có £4000 đầu tiên được miễn thuế. £1500 tiếp theo bị đánh thuế 10%. £28000 tiếp theo bị đánh thuế 22%. Bất kỳ số tiền nào thêm nữa bị đánh thuế 40%. Nhóm số nào sau đây sẽ thuộc cùng một lớp tương đương (equivalence class)?",
      "các đáp án": [
        "A. £4800; £14000; £28000",
        "B. £5200; £5500; £28000",
        "C. £28001; £32000; £35000",
        "D. £5800; £28000; £32000"
      ],
      "đáp án đúng": "D. £5800; £28000; £32000",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 281: Trong trường hợp các Hệ thống Lớn (Large Systems):",
      "các đáp án": [
        "A. Chỉ nên chạy một vài bài kiểm thử",
        "B. Kiểm thử nên dựa trên cơ sở Rủi ro (Risk)",
        "C. Chỉ nên thực thi các Trường hợp Kiểm thử Tốt.",
        "D. Các Trường hợp Kiểm thử được viết bởi các kỹ sư kiểm thử giỏi nên được thực thi."
      ],
      "đáp án đúng": "B. Kiểm thử nên dựa trên cơ sở Rủi ro (Risk)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 283: Đâu KHÔNG phải là pha của Quy trình Kiểm thử Cơ bản (Fundamental Test Process)?",
      "các đáp án": [
        "A. Lập kế hoạch và Kiểm soát Kiểm thử (Test Planning and Control)",
        "B. Triển khai và Thực thi Kiểm thử (Test implementation and Execution)",
        "C. Phân tích Yêu cầu (Requirement Analysis)",
        "D. Đánh giá Tiêu chí rút lui và Báo cáo (Evaluating Exit criteria and reporting)"
      ],
      "đáp án đúng": "C. Phân tích Yêu cầu (Requirement Analysis)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 284: Cấu trúc của một báo cáo sự cố (incident report) được đề cập trong Tiêu chuẩn IEEE 829 cho Tài liệu Kiểm thử Phần mềm và được gọi là:",
      "các đáp án": [
        "A. Báo cáo Bất thường (Anomaly Report)",
        "B. Báo cáo Khuyết tật (Defect Report)",
        "C. Báo cáo Khuyết tật Kiểm thử (Test Defect Report)",
        "D. Báo cáo Sự cố Kiểm thử (Test Incident Report)"
      ],
      "đáp án đúng": "D. Báo cáo Sự cố Kiểm thử (Test Incident Report)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 285: Việc Kiểm thử lặp đi lặp lại một chương trình đã được kiểm thử, sau khi sửa đổi, để phát hiện bất kỳ khuyết tật nào được đưa vào hoặc bị phát hiện do kết quả của các thay đổi trong phần mềm đang được kiểm thử hoặc trong một thành phần phần mềm liên quan hoặc không liên quan khác:",
      "các đáp án": [
        "A. Kiểm thử lại (Re Testing)",
        "B. Kiểm thử xác nhận (Confirmation Testing)",
        "C. Kiểm thử hồi quy (Regression Testing)",
        "D. Kiểm thử tiêu cực (Negative Testing)"
      ],
      "đáp án đúng": "C. Kiểm thử hồi quy (Regression Testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 287: Chúng ta sử dụng đầu ra của việc phân tích yêu cầu, tức là đặc tả yêu cầu, làm đầu vào để viết:",
      "các đáp án": [
        "A. Các Trường hợp Kiểm thử Chấp nhận Người dùng (User Acceptance Test Cases)",
        "B. Các Trường hợp Kiểm thử Mức Tích hợp (Integration Level Test Cases)",
        "C. Các Trường hợp Kiểm thử Mức Đơn vị (Unit Level Test Cases)",
        "D. Các đặc tả chương trình (Program specifications)"
      ],
      "đáp án đúng": "A. Các Trường hợp Kiểm thử Chấp nhận Người dùng (User Acceptance Test Cases)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 288: Kiểm thử hồi quy (Regression testing) nên được thực hiện: i. Hàng tuần. ii. Sau khi phần mềm đã thay đổi. iii. Càng thường xuyên càng tốt. iv. Khi môi trường đã thay đổi. v. Khi quản lý dự án nói.",
      "các đáp án": [
        "A. i & ii là đúng, iii, iv & v là sai",
        "B. ii, iii & iv là đúng, i & v là sai",
        "C. ii & iv là đúng, i, iii & v là sai",
        "D. ii là đúng, i, iii, iv & v là sai"
      ],
      "đáp án đúng": "C. ii & iv là đúng, i, iii & v là sai",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 289: Đánh giá khả năng kiểm thử (testability) của các yêu cầu và hệ thống là một phần của pha nào:",
      "các đáp án": [
        "A. Phân tích và Thiết kế Kiểm thử (Test Analysis and Design)",
        "B. Lập kế hoạch và Kiểm soát Kiểm thử (Test Planning and control)",
        "C. Triển khai và Thực thi Kiểm thử (Test Implementation and execution)",
        "D. Đánh giá tiêu chí rút lui và báo cáo (Evaluating exit criteria and reporting)"
      ],
      "đáp án đúng": "A. Phân tích và Thiết kế Kiểm thử (Test Analysis and Design)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 290: Đâu là mức độ độc lập cao nhất trong đó các trường hợp kiểm thử:",
      "các đáp án": [
        "A. Được thiết kế bởi những người viết phần mềm đang được kiểm thử",
        "B. Được thiết kế bởi một người từ một bộ phận khác",
        "C. Được thiết kế bởi một người từ một tổ chức khác",
        "D. Được thiết kế bởi một người khác"
      ],
      "đáp án đúng": "C. Được thiết kế bởi một người từ một tổ chức khác",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 291: Lập kế hoạch kiểm thử (Test planning) có những nhiệm vụ chính nào sau đây? i. Xác định phạm vi và rủi ro, và xác định các mục tiêu của kiểm thử. ii. Xác định phương pháp tiếp cận kiểm thử (kỹ thuật, hạng mục kiểm thử, độ bao phủ, xác định và giao tiếp các nhóm tham gia...). iii. Xem xét Cơ sở Kiểm thử (như yêu cầu, kiến trúc, thiết kế, giao diện). iv. Xác định các tiêu chí rút lui.",
      "các đáp án": [
        "A. i, ii, iv là đúng và iii là sai",
        "B. i,, iv là đúng và ii là sai",
        "C. i, ii là đúng và iii, iv là sai",
        "D. ii, iii, iv là đúng và i là sai"
      ],
      "đáp án đúng": "A. i, ii, iv là đúng và iii là sai",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 292: Quyết định 'Bao nhiêu kiểm thử là đủ' nên tính đến: i. Mức độ Rủi ro bao gồm rủi ro kỹ thuật và kinh doanh của sản phẩm và dự án. ii. Các ràng buộc của dự án như thời gian và ngân sách. iii. Quy mô của Nhóm kiểm thử. iv. Quy mô của Nhóm phát triển.",
      "các đáp án": [
        "A. i, ii, iii là đúng và iv là sai",
        "B. i,, iv là đúng và ii là sai",
        "C. i, ii là đúng và iii, iv là sai",
        "D. ii, iii, iv là đúng và i là sai"
      ],
      "đáp án đúng": "C. i, ii là đúng và iii, iv là sai",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 293: Đâu sẽ là định nghĩa tốt nhất cho Kiểm thử (Testing):",
      "các đáp án": [
        "A. Mục tiêu / mục đích của kiểm thử là để chứng minh rằng chương trình hoạt động.",
        "B. Mục đích của kiểm thử là để chứng minh rằng chương trình không có khuyết tật.",
        "C. Mục đích của kiểm thử là để chứng minh rằng chương trình làm những gì nó được cho là phải làm.",
        "D. Kiểm thử là việc thực thi Phần mềm với mục đích tìm ra các khuyết tật."
      ],
      "đáp án đúng": "D. Kiểm thử là việc thực thi Phần mềm với mục đích tìm ra các khuyết tật.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 295: Ghép mọi giai đoạn của Vòng đời Phát triển Phần mềm với Vòng đời Kiểm thử: i. Thiết kế cấp cao (Hi-level design). ii. Mã nguồn (Code). iii. Thiết kế cấp thấp (Low-level design). iv. Yêu cầu nghiệp vụ (Business requirements). \n a. Kiểm thử đơn vị (Unit tests). b. Kiểm thử chấp nhận (Acceptance tests). c. Kiểm thử hệ thống (System tests). d. Kiểm thử tích hợp (Integration tests).",
      "các đáp án": [
        "A. i-d, ii-a, iii-c, iv-b",
        "B. i-c, ii-d, iii-a, iv-b",
        "C. i-b, ii-a, iii-d, iv-c",
        "D. i-c, ii-a, iii-d, iv-b"
      ],
      "đáp án đúng": "D. i-c, ii-a, iii-d, iv-b",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 296: Đâu là một phần của Các hoạt động Đóng Kiểm thử (Test Closure Activities)? i. Kiểm tra xem các sản phẩm bàn giao (deliverables) đã lên kế hoạch nào đã được giao. ii. Phân tích báo cáo khuyết tật. iii. Hoàn thiện và lưu trữ testware (phần mềm kiểm thử). iv. Phân tích các bài học kinh nghiệm.",
      "các đáp án": [
        "A. i, ii, iv là đúng và iii là sai",
        "B. i, ii, iii là đúng và iv là sai",
        "C. i, iii, iv là đúng và ii là sai",
        "D. Tất cả ở trên đều đúng"
      ],
      "đáp án đúng": "D. Tất cả ở trên đều đúng",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 297: Đâu KHÔNG phải là một phần của kế hoạch kiểm thử cấp cao (high level test plan)?",
      "các đáp án": [
        "A. Các chức năng không được kiểm thử.",
        "B. Các yêu cầu về môi trường.",
        "C. Phân tích Đặc tả (Analysis of Specifications).",
        "D. Tiêu chí đầu vào và đầu ra (Entry and Exit criteria)."
      ],
      "đáp án đúng": "C. Phân tích Đặc tả (Analysis of Specifications).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 298: Nếu một thí sinh làm một bài thi 40 câu hỏi, cần đạt 25 điểm để đỗ (61%) và cần đạt 80% để được loại xuất sắc, lớp tương đương (equivalence class) là gì.",
      "các đáp án": [
        "A. 23, 24, 25",
        "B. 0, 12, 25",
        "C. 30, 36, 39",
        "D. 32, 37, 40"
      ],
      "đáp án đúng": "D. 32, 37, 40",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 299: Phát biểu nào sau đây là đúng về phân tích tĩnh (static analysis):",
      "các đáp án": [
        "A. Biên dịch (Compiling) mã nguồn không phải là một hình thức của phân tích tĩnh.",
        "B. Phân tích tĩnh không cần thực hiện trước khi mã mệnh lệnh (imperative code) được thực thi.",
        "C. Phân tích tĩnh có thể tìm thấy các lỗi (faults) khó tìm bằng kiểm thử động.",
        "D. Phân tích thống kê (statistic) mở rộng sẽ không cần thiết nếu kiểm thử Hộp trắng được thực hiện."
      ],
      "đáp án đúng": "C. Phân tích tĩnh có thể tìm thấy các lỗi (faults) khó tìm bằng kiểm thử động.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 300: Trong một hệ thống được thiết kế để tính thuế phải nộp: [...] $4000 đầu tiên được miễn thuế. $1500 tiếp theo bị đánh thuế 10%. $28000 tiếp theo bị đánh thuế 22%. Bất kỳ số tiền nào thêm nữa bị đánh thuế 40%. Nhóm số nào sau đây sẽ thuộc cùng một lớp tương đương (equivalence class)?",
      "các đáp án": [
        "A. $5800; $28000; $32000",
        "B. $0: $200; $4200",
        "C. $5200; $5500; $28000",
        "D. $28001; $32000; $35000"
      ],
      "đáp án đúng": "B. $0: $200; $4200",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 302: Kiểm thử hồi quy (Regression testing) luôn luôn bao gồm",
      "các đáp án": [
        "A. Kiểm tra xem một lỗi phần mềm đã biết đã được sửa hay chưa.",
        "B. Thực thi một số lượng lớn các bài kiểm thử khác nhau.",
        "C. Kiểm tra xem các sửa đổi (modifications) có gây ra các tác dụng phụ bất lợi hay không.",
        "D. Sử dụng một công cụ tự động hóa kiểm thử."
      ],
      "đáp án đúng": "C. Kiểm tra xem các sửa đổi (modifications) có gây ra các tác dụng phụ bất lợi hay không.",
      "nguồn ảnh": null
    }
  ],
  "Đề 5 (Q. 303 -> Q. 364)": [
    {
      "Câu": "Q. 303: Các cơ sở Ghi và Phát lại (Capture and replay facilities) ít có khả năng được sử dụng nhất cho",
      "các đáp án": [
        "A. Kiểm thử hiệu năng (Performance testing)",
        "B. Kiểm thử phục hồi (Recovery testing)",
        "C. Kiểm thử GUI (GUI testing)",
        "D. Yêu cầu của người dùng (User requirements)."
      ],
      "đáp án đúng": "B. Kiểm thử phục hồi (Recovery testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 304: Công cụ nào sẽ được sử dụng để kiểm tra (flag) rò rỉ bộ nhớ (memory leaks) và con trỏ không được gán (unassigned pointers)",
      "các đáp án": [
        "A. Công cụ phân tích động (Dynamic analysis tool)",
        "B. Công cụ phân tích tĩnh (Static Analysis tool).",
        "C. Công cụ bảo trì (Maintenance tool).",
        "D. Công cụ cấu hình (Configuration tool)."
      ],
      "đáp án đúng": "A. Công cụ phân tích động (Dynamic analysis tool)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 305: Độ phức tạp Cyclomatic (Cyclomatic complexity) được sử dụng để tính toán",
      "các đáp án": [
        "A. Số lượng đường đi độc lập (independent paths) trong tập cơ sở của một chương trình",
        "B. Số lượng quyết định nhị phân + 1",
        "C. Giới hạn số lượng (Number bound) cho số lượng bài kiểm thử phải được tiến hành để đảm bảo rằng tất cả các câu lệnh đã được thực thi ít nhất một lần",
        "D. Số lượng nhánh và quyết định"
      ],
      "đáp án đúng": "A. Số lượng đường đi độc lập (independent paths) trong tập cơ sở của một chương trình",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 306: Điều nào sau đây KHÔNG được bao gồm trong Kế hoạch kiểm thử (Test Plan).",
      "các đáp án": [
        "A. Các tính năng sẽ được kiểm thử (Features to be tested).",
        "B. Nhu cầu về môi trường (Environmental needs).",
        "C. Tiêu chí tạm dừng (Suspension criteria).",
        "D. Kết quả mong đợi (Expected results)."
      ],
      "đáp án đúng": "D. Kết quả mong đợi (Expected results).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 307: Chất lượng phần mềm (Software quality) không liên quan đến",
      "các đáp án": [
        "A. Tính đúng đắn (Correctness)",
        "B. Tính khả dụng (Usability)",
        "C. Tính khả thi (Viability)",
        "D. Tính tái sử dụng (Reusability)."
      ],
      "đáp án đúng": "C. Tính khả thi (Viability)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 308: Ghép nối sau đây: 1. Ước tính kiểm thử (Test estimation). 2. Kiểm soát kiểm thử (Test control). 3. Giám sát kiểm thử (Test monitoring). \n a. Các thước đo theo dõi quy trình. \n b. Nỗ lực cần thiết để thực hiện các hoạt động. \n c. Phân bổ lại nguồn lực.",
      "các đáp án": [
        "A. 1-b, 2-c, 3-а",
        "B. 1-b, 2-a, 3-с",
        "С. 1-с, 2-а, 3-b",
        "D. 1-a, 2-b, 3-c"
      ],
      "đáp án đúng": "A. 1-b, 2-c, 3-а",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 309: Khi nào bạn dừng kiểm thử?",
      "các đáp án": [
        "A. Khi số lượng lỗi được chỉ định đã được tìm thấy.",
        "B. Khi các tiêu chí hoàn thành kiểm thử (test completion criteria) được đáp ứng.",
        "C. Khi tất cả các bài kiểm thử có độ ưu tiên cao và trung bình hoàn tất.",
        "D. Khi tất cả các câu lệnh đã được thực thi"
      ],
      "đáp án đúng": "B. Khi các tiêu chí hoàn thành kiểm thử (test completion criteria) được đáp ứng.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 312: Kiểm thử tích hợp ở quy mô lớn (Integration testing in the large) bao gồm:",
      "các đáp án": [
        "A. Kiểm thử hệ thống khi được kết hợp với các hệ thống khác.",
        "B. Kiểm thử một hệ thống con (sub-system) bằng cách sử dụng stub và driver.",
        "C. Kiểm thử một hệ thống với số lượng lớn người dùng.",
        "D. Kết hợp các thành phần phần mềm và kiểm thử chúng trong một lần."
      ],
      "đáp án đúng": "A. Kiểm thử hệ thống khi được kết hợp với các hệ thống khác.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 313: Một trong những điều sau đây không phải là một phần của kiểm thử hộp trắng theo tiêu chuẩn BS7925-11.",
      "các đáp án": [
        "A. Kiểm thử ngẫu nhiên (Random testing)",
        "B. Kiểm thử luồng dữ liệu (Data Flow testing).",
        "C. Kiểm thử câu lệnh (Statement testing).",
        "D. Kiểm thử cú pháp (Syntax testing)."
      ],
      "đáp án đúng": "A. Kiểm thử ngẫu nhiên (Random testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 314: Một phần mềm đã được đưa cho bạn. Bạn sẽ thực hiện những bài kiểm thử nào sau đây? 1) Kiểm thử các khu vực quan trọng nhất đối với quy trình nghiệp vụ. 2) Kiểm thử các khu vực mà lỗi sẽ là tối đa. 3) Kiểm thử các chức năng dễ nhất.",
      "các đáp án": [
        "A. 1&2 là đúng và 3 là sai.",
        "B. 1, 2&3 là đúng.",
        "C. 1 là đúng, 2&3 là sai.",
        "D. 1&2 là sai, 3 là đúng"
      ],
      "đáp án đúng": "A. 1&2 là đúng và 3 là sai.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 315: Đâu là một loại kiểm thử phi chức năng (non-functional testing)?",
      "các đáp án": [
        "A. Kiểm thử tính khả dụng (Usability testing).",
        "B. Độ bao phủ câu lệnh (Statement Coverage).",
        "C. Kiểm thử luồng dữ liệu (Dataflow testing).",
        "D. Vẽ đồ thị nhân-quả (Cause-effect graphing)."
      ],
      "đáp án đúng": "A. Kiểm thử tính khả dụng (Usability testing).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 319: Một hư hỏng (failure) tại hiện trường xảy ra khi nhiều người dùng truy cập vào một hệ thống. Điều nào sau đây là đúng?",
      "các đáp án": [
        "A. Đây là một rủi ro chấp nhận được của một hệ thống đa người dùng.",
        "B. Kiểm thử chức năng không đủ đã được thực hiện.",
        "C. Điều này chỉ ra một yêu cầu phi chức năng quan trọng đã không được chỉ định và kiểm thử.",
        "D. Không thể kiểm thử chống lại các sự kiện như vậy trước khi phát hành."
      ],
      "đáp án đúng": "C. Điều này chỉ ra một yêu cầu phi chức năng quan trọng đã không được chỉ định và kiểm thử.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 320: Những người không tham gia vào các buổi đánh giá kỹ thuật (technical reviews)",
      "các đáp án": [
        "A. Nhà phân tích (Analysts)",
        "B. Quản lý (Management)",
        "C. Nhà phát triển (Developers)",
        "D. Người kiểm thử (Testers)"
      ],
      "đáp án đúng": "B. Quản lý (Management)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 321: Hư hỏng (Failure) là gì?",
      "các đáp án": [
        "A. Sai lệch giữa kết quả mong đợi và kết quả thực tế",
        "B. Khuyết tật (Defect) trong phần mềm.",
        "C. Lỗi (Error) trong mã chương trình.",
        "D. Lỗi (Fault) trong hệ thống."
      ],
      "đáp án đúng": "A. Sai lệch giữa kết quả mong đợi và kết quả thực tế",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 322: Việc chỉ sử dụng kiểm thử hộp trắng (white box testing) trong một pha kiểm thử sẽ:",
      "các đáp án": [
        "A. Đảm bảo hạng mục kiểm thử được kiểm thử đầy đủ.",
        "B. Làm cho nhu cầu kiểm thử hộp đen trở nên thừa thãi.",
        "C. Có nguy cơ các yêu cầu không được thỏa mãn.",
        "D. Đủ cho pha kiểm thử đơn vị."
      ],
      "đáp án đúng": "C. Có nguy cơ các yêu cầu không được thỏa mãn.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 323: Điều nào sau đây là ít quan trọng nhất trong quản lý kiểm thử (test management)?",
      "các đáp án": [
        "A. Ước tính thời gian kiểm thử.",
        "B. Quản lý sự cố (Incident Management).",
        "C. Quản lý cấu hình (Configuration Management).",
        "D. Gỡ lỗi (De-bugging)."
      ],
      "đáp án đúng": "D. Gỡ lỗi (De-bugging).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 326: Điều nào sau đây cung cấp tiềm năng tiết kiệm chi phí lớn nhất từ việc sử dụng CAST (Computer Aided Software Testing)?",
      "các đáp án": [
        "A. Quản lý kiểm thử (Test management)",
        "B. Thiết kế kiểm thử (Test design)",
        "C. Lập kế hoạch kiểm thử (Test planning)",
        "D. Thực thi kiểm thử (Test execution)"
      ],
      "đáp án đúng": "D. Thực thi kiểm thử (Test execution)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 327: Loại kiểm thử nào được thực hiện để bổ sung cho kiểm thử nghiêm ngặt (rigorous testing)?",
      "các đáp án": [
        "A. Kiểm thử hồi quy (Regression testing).",
        "B. Kiểm thử tích hợp (Integration testing).",
        "C. Đoán lỗi (Error Guessing)",
        "D. Kiểm thử hệ thống (System testing)."
      ],
      "đáp án đúng": "C. Đoán lỗi (Error Guessing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 328: Để làm cho một bài kiểm thử hiệu quả, điều quan trọng nhất là:",
      "các đáp án": [
        "A. Nó dễ thực thi.",
        "B. Nó được thiết kế để phát hiện lỗi (faults) nếu có.",
        "C. Kết quả mong đợi được chỉ định trước khi thực thi.",
        "D. Nó không có khả năng làm chậm tiến độ."
      ],
      "đáp án đúng": "C. Kết quả mong đợi được chỉ định trước khi thực thi.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 329: Đoán lỗi (Error guessing) là:",
      "các đáp án": [
        "A. Một cách thích hợp để lấy ra các bài kiểm thử hệ thống.",
        "B. Chỉ được sử dụng nếu không có các yêu cầu tốt.",
        "C. Chỉ được sử dụng khi có sẵn các yêu cầu tốt.",
        "D. Cách thích hợp nhất để lấy ra các bài kiểm thử hệ thống."
      ],
      "đáp án đúng": "B. Chỉ được sử dụng nếu không có các yêu cầu tốt.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 330: Số lượng kiểm thử được thực hiện sẽ không phụ thuộc vào",
      "các đáp án": [
        "A. Rủi ro liên quan",
        "B. Các yêu cầu hợp đồng",
        "C. Các yêu cầu pháp lý",
        "D. Dữ liệu kiểm thử (Test data)."
      ],
      "đáp án đúng": "D. Dữ liệu kiểm thử (Test data).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 331: Để phần mềm đáng tin cậy (reliable), nó phải:",
      "các đáp án": [
        "A. Dễ bảo trì.",
        "B. Không có khả năng gây ra hư hỏng (failure).",
        "C. Không bao giờ thất bại trong bất kỳ trường hợp nào.",
        "D. Được viết theo các tiêu chuẩn lập trình"
      ],
      "đáp án đúng": "B. Không có khả năng gây ra hư hỏng (failure).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 332: Trong một hệ thống được thiết kế để tính thuế... $4000 miễn thuế. $1500 tiếp theo 10%. $28000 tiếp theo 22%. Bất kỳ số tiền nào thêm nữa 40%. Đến $ gần nhất, đâu là một trường hợp kiểm thử Phân tích giá trị biên (Boundary Value Analysis) hợp lệ?",
      "các đáp án": [
        "A. $1500",
        "B. $32001",
        "C. $28000",
        "D. $33501"
      ],
      "đáp án đúng": "D. $33501",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 334: Một hệ thống ghi nhật ký sự cố (incident logging system)",
      "các đáp án": [
        "A. Chỉ ghi lại các khuyết tật (defects)",
        "B. Có giá trị hạn chế",
        "C. Là một nguồn thông tin dự án có giá trị trong quá trình kiểm thử nếu nó chứa tất cả các sự cố",
        "D. Chỉ nên được sử dụng bởi nhóm kiểm thử."
      ],
      "đáp án đúng": "C. Là một nguồn thông tin dự án có giá trị trong quá trình kiểm thử nếu nó chứa tất cả các sự cố",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 335: Một lỗi (fault) được phát hiện càng muộn trong vòng đời phát triển thì càng tốn kém để sửa chữa. Tại sao?",
      "các đáp án": [
        "A. Tài liệu kém, vì vậy mất nhiều thời gian hơn để tìm ra phần mềm đang làm gì.",
        "B. Lương đang tăng",
        "C. Lỗi đã được xây dựng vào nhiều tài liệu, mã nguồn, bài kiểm thử hơn, v.v.",
        "D. Không có điều nào ở trên"
      ],
      "đáp án đúng": "C. Lỗi đã được xây dựng vào nhiều tài liệu, mã nguồn, bài kiểm thử hơn, v.v.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 336: Điều nào sau đây là đúng?",
      "các đáp án": [
        "A. Kiểm thử thành phần nên là hộp đen, kiểm thử hệ thống nên là hộp trắng.",
        "B. Nếu bạn tìm thấy rất nhiều lỗi (bugs) trong kiểm thử, bạn không nên quá tự tin về chất lượng của phần mềm",
        "C. Bạn càng tìm thấy ít lỗi, kiểm thử của bạn càng tốt",
        "D. Bạn càng chạy nhiều bài kiểm thử, bạn càng tìm thấy nhiều lỗi."
      ],
      "đáp án đúng": "B. Nếu bạn tìm thấy rất nhiều lỗi (bugs) trong kiểm thử, bạn không nên quá tự tin về chất lượng của phần mềm",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 338: Các hoạt động kiểm thử phần mềm nên bắt đầu",
      "các đáp án": [
        "A. Ngay khi mã nguồn được viết",
        "B. Trong giai đoạn thiết kế",
        "C. Khi các yêu cầu đã được lập thành tài liệu chính thức",
        "D. Càng sớm càng tốt trong vòng đời phát triển"
      ],
      "đáp án đúng": "D. Càng sớm càng tốt trong vòng đời phát triển",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 340: Một kỹ thuật thiết kế kiểm thử (test design technique) là",
      "các đáp án": [
        "A. Một quy trình để lựa chọn các trường hợp kiểm thử",
        "B. Một quy trình để xác định các kết quả mong đợi",
        "C. Một cách để đo lường chất lượng của phần mềm",
        "D. Một cách để đo lường trong kế hoạch kiểm thử những gì phải làm"
      ],
      "đáp án đúng": "A. Một quy trình để lựa chọn các trường hợp kiểm thử",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 341: Lý do chính để kiểm thử phần mềm trước khi phát hành là gì?",
      "các đáp án": [
        "A. Để chỉ ra rằng hệ thống sẽ hoạt động sau khi phát hành",
        "B. Để quyết định khi nào phần mềm có chất lượng đủ để phát hành",
        "C. Để tìm càng nhiều lỗi (bugs) càng tốt trước khi phát hành",
        "D. Để cung cấp thông tin cho một quyết định dựa trên rủi ro về việc phát hành"
      ],
      "đáp án đúng": "D. Để cung cấp thông tin cho một quyết định dựa trên rủi ro về việc phát hành",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 342: Testware (trường hợp kiểm thử, bộ dữ liệu kiểm thử)",
      "các đáp án": [
        "A. Cần quản lý cấu hình giống như yêu cầu, thiết kế và mã nguồn",
        "B. Nên được xây dựng mới cho mỗi phiên bản mới của phần mềm",
        "C. Chỉ cần thiết cho đến khi phần mềm được phát hành vào sản xuất hoặc sử dụng",
        "D. Không cần phải được lập tài liệu và bình luận, vì nó không phải là một phần của hệ thống phần mềm được phát hành"
      ],
      "đáp án đúng": "A. Cần quản lý cấu hình giống như yêu cầu, thiết kế và mã nguồn",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 344: Các bài kiểm thử nên được chạy theo thứ tự nào?",
      "các đáp án": [
        "A. Các bài kiểm thử quan trọng nhất trước tiên",
        "B. Các bài kiểm thử khó nhất trước tiên (để cho phép thời gian tối đa để sửa chữa)",
        "C. Các bài kiểm thử dễ nhất trước tiên (để tạo sự tự tin ban đầu)",
        "D. Theo thứ tự chúng được nghĩ ra"
      ],
      "đáp án đúng": "A. Các bài kiểm thử quan trọng nhất trước tiên",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 345: Một chương trình xác thực một trường số như sau: Giá trị nhỏ hơn 10 bị từ chối, giá trị từ 10 đến 21 được chấp nhận, giá trị lớn hơn hoặc bằng 22 bị từ chối. Lựa chọn nào sau đây bao gồm NHIỀU giá trị biên NHẤT?",
      "các đáp án": [
        "A. 9, 10, 11, 22",
        "B. 9, 10, 21, 22",
        "C. 10, 11, 21, 22",
        "D. 10, 11, 20, 21"
      ],
      "đáp án đúng": "B. 9, 10, 21, 22",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 346: Đâu không phải là chiến lược tích hợp (integration strategy)?",
      "các đáp án": [
        "A. Dựa trên thiết kế (Design based)",
        "B. Big-bang",
        "C. Từ dưới lên (Bottom-up)",
        "D. Từ trên xuống (Top-down)"
      ],
      "đáp án đúng": "A. Dựa trên thiết kế (Design based)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 347: Bạn sẽ sử dụng công cụ nào sau đây để phát hiện rò rỉ bộ nhớ (memory leak)?",
      "các đáp án": [
        "A. Phân tích trạng thái (State analysis)",
        "B. Phân tích độ bao phủ (Coverage analysis)",
        "C. Phân tích động (Dynamic analysis)",
        "D. Phân tích bộ nhớ (Memory analysis)"
      ],
      "đáp án đúng": "C. Phân tích động (Dynamic analysis)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 348: Phát biểu nào sau đây là đúng?",
      "các đáp án": [
        "A. Lỗi (Faults) trong đặc tả chương trình là đắt nhất để sửa chữa.",
        "B. Lỗi (Faults) trong mã nguồn là đắt nhất để sửa chữa.",
        "C. Lỗi (Faults) trong yêu cầu là đắt nhất để sửa chữa",
        "D. Lỗi (Faults) trong thiết kế là đắt nhất để sửa chữa."
      ],
      "đáp án đúng": "C. Lỗi (Faults) trong yêu cầu là đắt nhất để sửa chữa",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 349: Việc tăng chất lượng của phần mềm, bằng các phương pháp phát triển tốt hơn, sẽ ảnh hưởng đến thời gian cần thiết cho kiểm thử (các pha kiểm thử) bằng cách:",
      "các đáp án": [
        "A. Giảm thời gian kiểm thử",
        "B. Không thay đổi",
        "C. Tăng thời gian kiểm thử",
        "D. Không thể nói trước"
      ],
      "đáp án đúng": "A. Giảm thời gian kiểm thử",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 350: Đâu là kỹ thuật thiết kế hộp đen (black box design technique)?",
      "các đáp án": [
        "A. Kiểm thử câu lệnh (Statement testing)",
        "B. Phân vùng tương đương (Equivalence partitioning)",
        "C. Đoán lỗi (Error- guessing)",
        "D. Kiểm thử tính khả dụng (Usability testing)"
      ],
      "đáp án đúng": "B. Phân vùng tương đương (Equivalence partitioning)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 351: Khi báo cáo các lỗi (faults) tìm thấy cho các nhà phát triển, người kiểm thử nên:",
      "các đáp án": [
        "A. Lịch sự, mang tính xây dựng và hữu ích nhất có thể",
        "B. Kiên quyết khẳng định rằng một lỗi (bug) không phải là một 'tính năng' nếu nó cần được sửa",
        "C. Ngoại giao, nhạy cảm với cách họ có thể phản ứng với sự chỉ trích",
        "D. Tất cả những điều trên"
      ],
      "đáp án đúng": "D. Tất cả những điều trên",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 352: Phát biểu nào sau đây không đúng",
      "các đáp án": [
        "A. Kiểm thử hiệu năng có thể được thực hiện trong quá trình kiểm thử đơn vị cũng như trong quá trình kiểm thử toàn bộ hệ thống",
        "B. Kiểm thử chấp nhận không nhất thiết bao gồm kiểm thử hồi quy",
        "C. Các hoạt động xác minh (Verification) không nên có người kiểm thử tham gia (đánh giá, kiểm tra, v.v.)",
        "D. Môi trường kiểm thử nên càng giống môi trường sản xuất (production) càng tốt"
      ],
      "đáp án đúng": "C. Các hoạt động xác minh (Verification) không nên có người kiểm thử tham gia (đánh giá, kiểm tra, v.v.)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 353: Tiêu chí quan trọng khi quyết định sử dụng kỹ thuật kiểm thử nào là gì?",
      "các đáp án": [
        "A. Bạn hiểu rõ một kỹ thuật cụ thể đến mức nào",
        "B. Mục tiêu của bài kiểm thử",
        "C. Kỹ thuật đó phù hợp với việc kiểm thử ứng dụng đến mức nào",
        "D. Liệu có công cụ hỗ trợ kỹ thuật đó hay không"
      ],
      "đáp án đúng": "C. Kỹ thuật đó phù hợp với việc kiểm thử ứng dụng đến mức nào",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 354: Khi nào bạn nên dừng kiểm thử?",
      "các đáp án": [
        "A. Khi thời gian kiểm thử đã hết.",
        "B. Khi tất cả các bài kiểm thử đã lên kế hoạch đã được chạy",
        "C. Khi các tiêu chí hoàn thành kiểm thử (test completion criteria) đã được đáp ứng",
        "D. Khi không tìm thấy lỗi nào từ các bài kiểm thử đã chạy"
      ],
      "đáp án đúng": "C. Khi các tiêu chí hoàn thành kiểm thử (test completion criteria) đã được đáp ứng",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 355: Đo lường độ bao phủ (Coverage measurement)",
      "các đáp án": [
        "A. Không liên quan gì đến kiểm thử",
        "B. Là một thước đo một phần của tính kỹ lưỡng của kiểm thử (test thoroughness)",
        "C. Độ bao phủ nhánh (Branch coverage) nên là bắt buộc đối với tất cả phần mềm",
        "D. Chỉ có thể được áp dụng ở kiểm thử đơn vị hoặc mô-đun, không phải ở kiểm thử hệ thống"
      ],
      "đáp án đúng": "B. Là một thước đo một phần của tính kỹ lưỡng của kiểm thử (test thoroughness)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 356: Đâu KHÔNG phải là một loại kiểm thử phi chức năng (non-functional test)?",
      "các đáp án": [
        "A. Chuyển đổi trạng thái (State-Transition)",
        "B. Tính khả dụng (Usability)",
        "C. Hiệu năng (Performance)",
        "D. Bảo mật (Security)"
      ],
      "đáp án đúng": "A. Chuyển đổi trạng thái (State-Transition)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 358: Một chương trình xác thực một trường số như sau: Giá trị nhỏ hơn 10 bị từ chối, giá trị từ 10 đến 21 được chấp nhận, giá trị lớn hơn hoặc bằng 22 bị từ chối. Những giá trị đầu vào nào sau đây bao phủ tất cả các phân vùng tương đương?",
      "các đáp án": [
        "A. 10, 11, 21",
        "B. 3, 20, 21",
        "C. 3, 10, 22",
        "D. 10, 21, 22"
      ],
      "đáp án đúng": "C. 3, 10, 22",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 359: Đâu là không đúng - Người kiểm thử hộp đen",
      "các đáp án": [
        "A. Nên có khả năng hiểu một đặc tả chức năng hoặc tài liệu yêu cầu",
        "B. Nên có khả năng hiểu mã nguồn..",
        "C. Có động lực cao để tìm ra lỗi (faults)",
        "D. Sáng tạo để tìm ra điểm yếu của hệ thống"
      ],
      "đáp án đúng": "B. Nên có khả năng hiểu mã nguồn..",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 360: Đâu là một kiểm thử tĩnh (static test)?",
      "các đáp án": [
        "A. Kiểm tra mã nguồn (Code inspection)",
        "B. Phân tích độ bao phủ (Coverage analysis)",
        "C. Đánh giá tính khả dụng (Usability assessment)",
        "D. Kiểm thử cài đặt (Installation test)"
      ],
      "đáp án đúng": "A. Kiểm tra mã nguồn (Code inspection)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 361: Một chương trình có độ phức tạp cyclomatic cao gần như chắc chắn sẽ:",
      "các đáp án": [
        "A. Lớn",
        "B. Nhỏ",
        "C. Khó viết",
        "D. Khó kiểm thử"
      ],
      "đáp án đúng": "D. Khó kiểm thử",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 362: Cái nào sau đây là khác biệt (odd one out)?",
      "các đáp án": [
        "A. Hộp trắng (White box)",
        "B. Hộp kính (Glass box)",
        "C. Cấu trúc (Structural)",
        "D. Chức năng (Functional)"
      ],
      "đáp án đúng": "D. Chức năng (Functional)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 363: Những kỹ thuật nào sau đây là kỹ thuật hộp đen?",
      "các đáp án": [
        "A. Kiểm thử chuyển đổi trạng thái, kiểm thử mã, kiểm thử linh hoạt (agile testing)",
        "B. Phân vùng tương đương, kiểm thử chuyển đổi trạng thái, kiểm thử bảng quyết định",
        "C. Kiểm thử hệ thống, kiểm thử chấp nhận, phân vùng tương đương",
        "D. Kiểm thử tích hợp hệ thống, kiểm thử hệ thống, kiểm thử bảng quyết định"
      ],
      "đáp án đúng": "B. Phân vùng tương đương, kiểm thử chuyển đổi trạng thái, kiểm thử bảng quyết định",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 364: Một số lỗi nghiêm trọng được sửa trong phần mềm. Tất cả các lỗi đều nằm trong một mô-đun, liên quan đến báo cáo. Người quản lý kiểm thử quyết định chỉ thực hiện kiểm thử hồi quy trên mô-đun báo cáo.",
      "các đáp án": [
        "A. Người quản lý kiểm thử chỉ nên thực hiện kiểm thử hồi quy tự động.",
        "B. Người quản lý kiểm thử là hợp lý trong quyết định của mình vì không có lỗi nào được sửa trong các mô-đun khác",
        "C. Người quản lý kiểm thử chỉ nên thực hiện kiểm thử xác nhận. Không cần thực hiện kiểm thử hồi quy",
        "D. Kiểm thử hồi quy nên được thực hiện trên các mô-đun khác nữa vì việc sửa chữa một mô-đun có thể ảnh hưởng đến các mô-đun khác"
      ],
      "đáp án đúng": "D. Kiểm thử hồi quy nên được thực hiện trên các mô-đun khác nữa vì việc sửa chữa một mô-đun có thể ảnh hưởng đến các mô-đun khác",
      "nguồn ảnh": null
    }
  ],
  "Đề 6 (Q. 365 -> Q. 424)": [
    {
      "Câu": "Q. 365: Phát biểu nào sau đây chứa một mục tiêu hợp lệ cho một bộ kiểm thử chức năng?",
      "các đáp án": [
        "A. Một mục tiêu là sẽ không còn hư hỏng (failures) nào xảy ra từ các khuyết tật còn lại",
        "B. Một mục tiêu là tìm càng nhiều hư hỏng (failures) càng tốt để nguyên nhân của các hư hỏng có thể được xác định và sửa chữa",
        "C. Một mục tiêu là loại bỏ càng nhiều càng tốt các nguyên nhân của khuyết tật",
        "D. Một mục tiêu là hoàn thành tất cả các yêu cầu kiểm thử được định nghĩa trong kế hoạch dự án."
      ],
      "đáp án đúng": "B. Một mục tiêu là tìm càng nhiều hư hỏng (failures) càng tốt để nguyên nhân của các hư hỏng có thể được xác định và sửa chữa",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 367: Tại sao Phân tích giá trị biên (Boundary Value Analysis) cung cấp các trường hợp kiểm thử tốt?",
      "các đáp án": [
        "A. Bởi vì nó là một tiêu chuẩn công nghiệp",
        "B. Bởi vì các lỗi thường xuyên được tạo ra trong quá trình lập trình các trường hợp khác nhau gần 'các cạnh' của dải giá trị",
        "C. Bởi vì chỉ các lớp tương đương bằng nhau từ quan điểm chức năng mới được xem xét trong các trường hợp kiểm thử",
        "D. Bởi vì đối tượng kiểm thử được kiểm tra dưới tải tối đa lên đến giới hạn hiệu suất của nó"
      ],
      "đáp án đúng": "B. Bởi vì các lỗi thường xuyên được tạo ra trong quá trình lập trình các trường hợp khác nhau gần 'các cạnh' của dải giá trị",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 368: Nếu một chương trình được kiểm thử và đạt được 100% độ bao phủ nhánh (branch coverage), tiêu chí độ bao phủ nào sau đây được đảm bảo đạt được?",
      "các đáp án": [
        "A. 100% Độ bao phủ lớp tương đương",
        "B. 100% Độ bao phủ điều kiện và 100% Độ bao phủ câu lệnh",
        "C. 100% Độ bao phủ câu lệnh",
        "D. 100% Độ bao phủ đa điều kiện"
      ],
      "đáp án đúng": "C. 100% Độ bao phủ câu lệnh",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 369: Một hệ thống quản lý khuyết tật sẽ theo dõi trạng thái của mọi khuyết tật được đăng ký và thực thi các quy tắc về việc thay đổi các trạng thái này. Nếu nhiệm vụ của bạn là kiểm thử việc theo dõi trạng thái, phương pháp nào sẽ là tốt nhất?",
      "các đáp án": [
        "A. Kiểm thử dựa trên logic (Logic-based testing)",
        "B. Kiểm thử dựa trên trường hợp sử dụng (Use-case-based testing)",
        "C. Kiểm thử chuyển đổi trạng thái (State transition testing)",
        "D. Kiểm thử có hệ thống theo mô hình V (V-model)"
      ],
      "đáp án đúng": "C. Kiểm thử chuyển đổi trạng thái (State transition testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 370: Trong kiểm thử hệ thống...",
      "các đáp án": [
        "A. Cả yêu cầu chức năng và phi chức năng đều phải được kiểm thử",
        "B. Chỉ các yêu cầu chức năng được kiểm thử; các yêu cầu phi chức năng được xác nhận trong một buổi đánh giá",
        "C. Chỉ các yêu cầu phi chức năng được kiểm thử; các yêu cầu chức năng được xác nhận trong một buổi đánh giá",
        "D. Chỉ các yêu cầu được liệt kê trong tài liệu đặc tả mới được kiểm thử"
      ],
      "đáp án đúng": "A. Cả yêu cầu chức năng và phi chức năng đều phải được kiểm thử",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 371: Kiểm thử tích hợp (Integration testing) có các đặc điểm sau: I. Nó có thể được thực hiện theo cách tăng dần. II. Nó luôn được thực hiện sau kiểm thử hệ thống. III. Nó bao gồm các kiểm thử chức năng. IV. Nó bao gồm các kiểm thử phi chức năng.",
      "các đáp án": [
        "A. I, II và III là đúng",
        "B. I là đúng",
        "C. I, III và IV là đúng",
        "D. I, II và IV là đúng"
      ],
      "đáp án đúng": "C. I, III và IV là đúng",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 373: Tại sao kiểm thử là cần thiết?",
      "các đáp án": [
        "A. Bởi vì kiểm thử là phương pháp tốt để đảm bảo không có khuyết tật trong phần mềm",
        "B. Bởi vì xác minh (verification) và xác nhận (validation) không đủ để biết được chất lượng của phần mềm",
        "C. Bởi vì kiểm thử đo lường chất lượng của hệ thống phần mềm và giúp tăng chất lượng",
        "D. Bởi vì kiểm thử tìm thấy nhiều khuyết tật hơn là đánh giá (reviews) và kiểm tra (inspections).."
      ],
      "đáp án đúng": "C. Bởi vì kiểm thử đo lường chất lượng của hệ thống phần mềm và giúp tăng chất lượng",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 374: Trong giáo trình cấp độ cơ bản, bạn sẽ tìm thấy các nguyên tắc cơ bản chính của kiểm thử. Câu nào sau đây mô tả một trong những nguyên tắc cơ bản này?",
      "các đáp án": [
        "A. Kiểm thử hoàn chỉnh (Complete testing) phần mềm là có thể đạt được nếu bạn có đủ nguồn lực và công cụ kiểm thử",
        "B. Với kiểm thử tự động, bạn có thể đưa ra các phát biểu với sự tự tin hơn về chất lượng của một sản phẩm so với kiểm thử thủ công",
        "C. Đối với một hệ thống phần mềm, trong điều kiện bình thường, không thể kiểm thử tất cả các tổ hợp đầu vào và đầu ra.",
        "D. Một mục tiêu của kiểm thử là để chỉ ra rằng phần mềm không có khuyết tật."
      ],
      "đáp án đúng": "C. Đối với một hệ thống phần mềm, trong điều kiện bình thường, không thể kiểm thử tất cả các tổ hợp đầu vào và đầu ra.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 375: Điều nào sau đây là đúng",
      "các đáp án": [
        "A. Kiểm thử (Testing) giống như đảm bảo chất lượng (quality assurance)",
        "B. Kiểm thử là một phần của đảm bảo chất lượng",
        "C. Kiểm thử không phải là một phần của đảm bảo chất lượng",
        "D. Kiểm thử giống như gỡ lỗi (debugging)"
      ],
      "đáp án đúng": "B. Kiểm thử là một phần của đảm bảo chất lượng",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 376: Cho đoạn mã này: WHILE (condition A) Do B END WHILE. Cần kiểm tra bao nhiêu quyết định (decisions) trong mã này để đạt được 100% độ bao phủ quyết định?",
      "các đáp án": [
        "A. 2",
        "B. Vô định",
        "C. 1",
        "D. 4"
      ],
      "đáp án đúng": "A. 2",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 378: Đâu là một tập hợp hợp lệ các lớp tương đương cho bài toán sau: Một trường số nguyên sẽ chứa các giá trị từ 1 đến 15 (bao gồm cả 1 và 15)",
      "các đáp án": [
        "A. Nhỏ hơn 1, 1 đến 15, lớn hơn 15",
        "B. Số âm, 1 đến 15, trên 15",
        "C. Nhỏ hơn 1, 1 đến 14, lớn hơn 15",
        "D. Nhỏ hơn 0, 1 đến 14, 15 và lớn hơn"
      ],
      "đáp án đúng": "A. Nhỏ hơn 1, 1 đến 15, lớn hơn 15",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 379: Điều nào sau đây là đúng về các công cụ phân tích tĩnh (static analysis tools)",
      "các đáp án": [
        "A. Chúng giúp bạn tìm ra các khuyết tật (defects) thay vì các hư hỏng (failures)",
        "B. Chúng chỉ được sử dụng bởi các nhà phát triển",
        "C. Chúng yêu cầu biên dịch (compilation) mã nguồn",
        "D. Chúng chỉ hữu ích cho các ngành công nghiệp bị quản lý (regulated industries)"
      ],
      "đáp án đúng": "A. Chúng giúp bạn tìm ra các khuyết tật (defects) thay vì các hư hỏng (failures)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 380: Điều nào sau đây thường được coi là lỗi giao diện thành phần (components interface bug) nhất?",
      "các đáp án": [
        "A. Đối với hai thành phần trao đổi dữ liệu, một thành phần sử dụng đơn vị mét, thành phần còn lại sử dụng đơn vị Anh",
        "B. Hệ thống khó sử dụng do cấu trúc nhập liệu đầu cuối (terminal input) quá phức tạp",
        "C. Các thông báo lỗi nhập liệu của người dùng gây hiểu nhầm và không hữu ích để hiểu nguyên nhân lỗi nhập liệu",
        "D. Dưới tải cao, hệ thống không cung cấp đủ cổng (ports) mở để kết nối"
      ],
      "đáp án đúng": "A. Đối với hai thành phần trao đổi dữ liệu, một thành phần sử dụng đơn vị mét, thành phần còn lại sử dụng đơn vị Anh",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 381: Điều nào sau đây là đúng về các công cụ phân tích tĩnh (static analysis tools)?",
      "các đáp án": [
        "A. Công cụ phân tích tĩnh chỉ được sử dụng bởi các nhà phát triển",
        "B. Các trình biên dịch (Compilers) có thể cung cấp một số hỗ trợ cho phân tích tĩnh",
        "C. Công cụ phân tích tĩnh giúp tìm ra các hư hỏng (failures) thay vì các khuyết tật (defects)",
        "D. Công cụ phân tích tĩnh yêu cầu thực thi mã nguồn để phân tích độ bao phủ"
      ],
      "đáp án đúng": "B. Các trình biên dịch (Compilers) có thể cung cấp một số hỗ trợ cho phân tích tĩnh",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 382: Danh sách nào sau đây chỉ chứa các kiểm thử phi chức năng (non-functional tests)?",
      "các đáp án": [
        "A. Kiểm thử khả năng tương tác (tương thích), kiểm thử độ tin cậy, kiểm thử hiệu năng",
        "B. Kiểm thử hệ thống, kiểm thử hiệu năng",
        "C. Kiểm thử tải, kiểm thử căng thẳng, kiểm thử thành phần, kiểm thử tính di động",
        "D. Kiểm thử các cấu hình khác nhau, kiểm thử beta, kiểm thử tải"
      ],
      "đáp án đúng": "A. Kiểm thử khả năng tương tác (tương thích), kiểm thử độ tin cậy, kiểm thử hiệu năng",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 383: Bộ số liệu (metrics) nào có thể được sử dụng để giám sát việc thực thi kiểm thử (test execution)?",
      "các đáp án": [
        "A. Số lượng khuyết tật được phát hiện, chi phí kiểm thử:",
        "B. Số lượng khuyết tật còn sót lại (residual defects) trong đối tượng kiểm thử.",
        "C. Tỷ lệ phần trăm các nhiệm vụ đã hoàn thành trong việc chuẩn bị môi trường kiểm thử; các trường hợp kiểm thử đã chuẩn bị",
        "D. Số lượng trường hợp kiểm thử đã chạy / chưa chạy; các trường hợp kiểm thử đỗ / trượt"
      ],
      "đáp án đúng": "D. Số lượng trường hợp kiểm thử đã chạy / chưa chạy; các trường hợp kiểm thử đỗ / trượt",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 384: Những hạng mục kiểm thử (test items) nào nên được đặt dưới sự quản lý cấu hình (configuration management)?",
      "các đáp án": [
        "A. Đối tượng kiểm thử (test object), tài liệu kiểm thử (test material) và môi trường kiểm thử (test environment)",
        "B. Các báo cáo sự cố (problem reports) và tài liệu kiểm thử",
        "C. Chỉ đối tượng kiểm thử. Các trường hợp kiểm thử cần được điều chỉnh trong quá trình kiểm thử linh hoạt (agile testing)",
        "D. Đối tượng kiểm thử và tài liệu kiểm thử"
      ],
      "đáp án đúng": "A. Đối tượng kiểm thử (test object), tài liệu kiểm thử (test material) và môi trường kiểm thử (test environment)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 385: Cho đoạn mã này: WHILE (condition A) Do B END WHILE. Cần kiểm tra bao nhiêu đường đi (paths) trong mã này để đạt được 100% độ bao phủ đường đi (path coverage)?",
      "các đáp án": [
        "A. Một",
        "B. Vô định (Indefinite)",
        "C. Hai",
        "D. Bốn"
      ],
      "đáp án đúng": "B. Vô định (Indefinite)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 386: Mục đích của tiêu chí rút lui kiểm thử (test exit criteria) trong kế hoạch kiểm thử là gì?",
      "các đáp án": [
        "A. Để chỉ định khi nào dừng hoạt động kiểm thử",
        "B. Để đặt ra các tiêu chí được sử dụng khi tạo ra các đầu vào kiểm thử",
        "C. Để đảm bảo rằng đặc tả trường hợp kiểm thử đã hoàn chỉnh",
        "D. Để biết khi nào một bài kiểm thử cụ thể đã kết thúc việc thực thi"
      ],
      "đáp án đúng": "A. Để chỉ định khi nào dừng hoạt động kiểm thử",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 387: Nếu một chương trình được kiểm thử và đạt được 100% độ bao phủ điều kiện (condition coverage), tiêu chí độ bao phủ nào sau đây được đảm bảo đạt được?",
      "các đáp án": [
        "A. 100% độ bao phủ nhánh (branch coverage)",
        "B. 100% độ bao phủ điều kiện và 100% độ bao phủ câu lệnh",
        "C. Độ bao phủ lớp tương đương và giá trị biên",
        "D. Không có tiêu chí độ bao phủ hộp trắng nào khác được đảm bảo hoàn thành 100%"
      ],
      "đáp án đúng": "D. Không có tiêu chí độ bao phủ hộp trắng nào khác được đảm bảo hoàn thành 100%",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 388: Điều nào sau đây có thể là nguyên nhân gốc rễ (root cause) của một lỗi (bug) trong một sản phẩm phần mềm? (I) Dự án có các thủ tục không đầy đủ cho quản lý cấu hình. (II) Lịch trình thời gian để phát triển một thành phần nhất định đã bị cắt giảm. (III) Đặc tả không rõ ràng. (IV) Việc sử dụng tiêu chuẩn mã nguồn không được tuân thủ. (V) Những người kiểm thử không được chứng nhận.",
      "các đáp án": [
        "A. (I) và (II) là đúng",
        "B. (I) đến (IV) là đúng",
        "C. (III) đến (V) là đúng",
        "D. (I), (II) và (IV) là đúng"
      ],
      "đáp án đúng": "B. (I) đến (IV) là đúng",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 389: Danh sách sau đây chứa các rủi ro đã được xác định cho một sản phẩm phần mềm... Rủi ro nào trong số này là một ví dụ về rủi ro sản phẩm (product risk)?",
      "các đáp án": [
        "A. Không đủ người kiểm thử có trình độ để hoàn thành các bài kiểm thử đã lên kế hoạch",
        "B. Giao hàng phần mềm bị chậm tiến độ",
        "C. Mối đe dọa đến tính mạng của bệnh nhân",
        "D. Nhà cung cấp bên thứ 3 không cung cấp như đã thỏa thuận"
      ],
      "đáp án đúng": "C. Mối đe dọa đến tính mạng của bệnh nhân",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 390: Phát biểu nào sau đây là đúng?",
      "các đáp án": [
        "A. Công cụ phân tích tĩnh tạo ra số liệu thống kê trong quá trình thực thi chương trình",
        "B. Hệ thống quản lý cấu hình cho phép chúng ta cung cấp số liệu thống kê khuyết tật chính xác của các cấu hình khác nhau",
        "C. Công cụ kiểm thử căng thẳng (Stress testing) kiểm tra hành vi của đối tượng kiểm thử tại hoặc vượt quá tải đầy đủ",
        "D. Công cụ đo lường hiệu năng có thể được sử dụng trong tất cả các pha của vòng đời phần mềm"
      ],
      "đáp án đúng": "C. Công cụ kiểm thử căng thẳng (Stress testing) kiểm tra hành vi của đối tượng kiểm thử tại hoặc vượt quá tải đầy đủ",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 391: Những yếu tố đầu vào nào của dự án ảnh hưởng đến kiểm thử? (I) Các yêu cầu hợp đồng. (II) Các yêu cầu pháp lý. (III) Các tiêu chuẩn ngành. (IV) Rủi ro ứng dụng. (V) Quy mô dự án.",
      "các đáp án": [
        "A. (I) đến (III) là đúng",
        "B. Tất cả các lựa chọn đều đúng",
        "C. (II) và (V) là đúng",
        "D. (I), (III) và (V) là đúng"
      ],
      "đáp án đúng": "B. Tất cả các lựa chọn đều đúng",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 393: Kiểm thử bảo trì (Maintenance testing) là:",
      "các đáp án": [
        "A. Quản lý kiểm thử",
        "B. Từ đồng nghĩa của kiểm thử chất lượng dịch vụ",
        "C. Được kích hoạt bởi các sửa đổi, di chuyển hoặc ngừng hoạt động (retirement) của phần mềm hiện có",
        "D. Kiểm thử mức độ bảo trì bởi nhà cung cấp"
      ],
      "đáp án đúng": "C. Được kích hoạt bởi các sửa đổi, di chuyển hoặc ngừng hoạt động (retirement) của phần mềm hiện có",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 394: Tại sao tích hợp gia tăng (incremental integration) được ưu tiên hơn tích hợp 'big bang'?",
      "các đáp án": [
        "A. Bởi vì tích hợp gia tăng có khả năng sàng lọc và cách ly lỗi sớm tốt hơn",
        "B. Bởi vì tích hợp 'big bang' chỉ phù hợp cho các ứng dụng thời gian thực",
        "C. Tích hợp gia tăng chỉ được ưu tiên hơn 'Big Bang' cho mô hình phát triển 'từ dưới lên'",
        "D. Bởi vì tích hợp gia tăng có thể bù đắp cho kiểm thử thành phần yếu và không đầy đủ"
      ],
      "đáp án đúng": "A. Bởi vì tích hợp gia tăng có khả năng sàng lọc và cách ly lỗi sớm tốt hơn",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 395: Mô hình V (V-Model) là:",
      "các đáp án": [
        "A. Một mô hình phát triển phần mềm minh họa cách các hoạt động kiểm thử tích hợp với các pha phát triển phần mềm",
        "B. Một mô hình vòng đời phần mềm không liên quan đến kiểm thử",
        "C. Mô hình vòng đời phát triển và kiểm thử phần mềm chính thức của ISTQB",
        "D. Một mô hình vòng đời kiểm thử bao gồm các pha đơn vị, tích hợp, hệ thống và chấp nhận"
      ],
      "đáp án đúng": "A. Một mô hình phát triển phần mềm minh họa cách các hoạt động kiểm thử tích hợp với các pha phát triển phần mềm",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 396: Mục nào sau đây không cần phải có trong một báo cáo sự cố (incident report)?",
      "các đáp án": [
        "A. Số phiên bản (version number) của đối tượng kiểm thử",
        "B. Dữ liệu kiểm thử và môi trường đã sử dụng",
        "C. Mã định danh của trường hợp kiểm thử đã thất bại",
        "D. Vị trí và hướng dẫn về cách sửa lỗi (fault)"
      ],
      "đáp án đúng": "D. Vị trí và hướng dẫn về cách sửa lỗi (fault)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 397: Lập kế hoạch dữ liệu kiểm thử (Test data planning) về cơ bản bao gồm",
      "các đáp án": [
        "A. Mạng (Network)",
        "B. Mô hình hoạt động (Operational Model)",
        "C. Phân tích giá trị biên (Boundary value analysis)",
        "D. Lập kế hoạch thủ tục kiểm thử (Test Procedure Planning)"
      ],
      "đáp án đúng": "C. Phân tích giá trị biên (Boundary value analysis)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 398: Kiểm thử chấp nhận (Acceptance testing) có nghĩa là",
      "các đáp án": [
        "A. Kiểm thử được thực hiện trên một mô-đun hoặc đơn vị mã nguồn độc lập",
        "B. Kiểm thử sau khi các thay đổi đã được thực hiện để đảm bảo không có thay đổi không mong muốn nào được đưa vào",
        "C. Kiểm thử để đảm bảo rằng hệ thống đáp ứng nhu cầu của tổ chức và người dùng cuối.",
        "D. Người dùng kiểm thử ứng dụng trong môi trường của nhà phát triển"
      ],
      "đáp án đúng": "C. Kiểm thử để đảm bảo rằng hệ thống đáp ứng nhu cầu của tổ chức và người dùng cuối.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 399: Kiểm thử [...] nên bao gồm các kiểm thử hoạt động của môi trường mới cũng như của phần mềm đã thay đổi",
      "các đáp án": [
        "A. Kiểm thử hệ thống (System Testing)",
        "B. Kiểm thử tích hợp (Integration testing)",
        "C. Kiểm thử thành phần (Component testing)",
        "D. Kiểm thử bảo trì (Maintenance testing)"
      ],
      "đáp án đúng": "D. Kiểm thử bảo trì (Maintenance testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 400: Một phương pháp tiếp cận dựa trên rủi ro (risk-based approach) để kiểm thử cung cấp các cơ hội chủ động để giảm mức độ rủi ro sản phẩm, bắt đầu từ các giai đoạn đầu của một dự án",
      "các đáp án": [
        "A. Đúng (True)",
        "B. Sai (False)"
      ],
      "đáp án đúng": "A. Đúng (True)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 401: Kiểm thử chức năng (Functional testing) chủ yếu là",
      "các đáp án": [
        "A. Các kỹ thuật xác nhận (Validation techniques)",
        "B. Các kỹ thuật xác minh (Verification techniques)",
        "C. Cả hai điều trên",
        "D. Không có điều nào ở trên"
      ],
      "đáp án đúng": "A. Các kỹ thuật xác nhận (Validation techniques)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 402: Độ bao phủ nhánh (Branch Coverage)",
      "các đáp án": [
        "A. Một tên gọi khác của độ bao phủ quyết định (decision coverage)",
        "B. Một tên gọi khác của độ bao phủ tất cả các cạnh (all-edges coverage)",
        "C. Một tên gọi khác của độ bao phủ đường đi cơ bản (basic path coverage)",
        "D. Tất cả những điều trên"
      ],
      "đáp án đúng": "D. Tất cả những điều trên",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 403: [...] là hoạt động nơi các mục tiêu kiểm thử chung được chuyển đổi thành các điều kiện kiểm thử và thiết kế kiểm thử cụ thể",
      "các đáp án": [
        "A. Lập kế hoạch kiểm thử (Testing Planning)",
        "B. Kiểm soát kiểm thử (Test Control)",
        "C. Phân tích và thiết kế kiểm thử (Test analysis and design)",
        "D. Triển khai kiểm thử (Test implementation)"
      ],
      "đáp án đúng": "C. Phân tích và thiết kế kiểm thử (Test analysis and design)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 404: Kiểm thử tích hợp trong đó không có kiểm thử gia tăng nào diễn ra trước khi tất cả các thành phần của hệ thống được kết hợp lại để tạo thành hệ thống.",
      "các đáp án": [
        "A. Kiểm thử hệ thống (System testing)",
        "B. Kiểm thử thành phần (Component Testing)",
        "C. Kiểm thử gia tăng (Incremental Testing)",
        "D. Kiểm thử Big bang (Big bang testing)"
      ],
      "đáp án đúng": "D. Kiểm thử Big bang (Big bang testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 405: Một kỹ thuật thiết kế kiểm thử cho một thành phần trong đó các trường hợp kiểm thử được thiết kế để thực thi các câu lệnh (statements) được gọi là gì?",
      "các đáp án": [
        "A. Kiểm thử chuyển đổi trạng thái (State transition Testing)",
        "B. Kiểm thử tĩnh (Static Testing)",
        "C. Kiểm thử chuyển đổi (Transition testing)",
        "D. Kiểm thử câu lệnh (Statement testing)"
      ],
      "đáp án đúng": "D. Kiểm thử câu lệnh (Statement testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 407: Một kế hoạch kiểm thử (Test plan) định nghĩa",
      "các đáp án": [
        "A. Những gì được chọn để kiểm thử",
        "B. Các mục tiêu và kết quả",
        "C. Các kết quả mong đợi",
        "D. Các mục tiêu và những gì bỏ lỡ"
      ],
      "đáp án đúng": "A. Những gì được chọn để kiểm thử",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 408: Kiểm thử tích hợp thành phần (Component integration testing) có thể được thực hiện",
      "các đáp án": [
        "A. Trước khi Kiểm thử tích hợp (Integration testing)",
        "B. Sau khi kiểm thử đơn vị (unit testing)",
        "C. Sau khi kiểm thử thành phần (component testing)",
        "D. Sau khi kiểm thử hệ thống (system testing)"
      ],
      "đáp án đúng": "C. Sau khi kiểm thử thành phần (component testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 409: Tài liệu cơ sở kiểm thử (Test basis documentation) được phân tích trong pha nào của kiểm thử",
      "các đáp án": [
        "A. Phân tích kiểm thử (Test Analysis)",
        "B. Thiết kế kiểm thử (Test Design)",
        "C. Thực thi kiểm thử (Test Execution)",
        "D. Lập kế hoạch kiểm thử (Test Planning)"
      ],
      "đáp án đúng": "A. Phân tích kiểm thử (Test Analysis)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 410: Đâu KHÔNG phải là nhiệm vụ của trưởng nhóm kiểm thử (test leader)?",
      "các đáp án": [
        "A. Điều phối chiến lược và kế hoạch kiểm thử với các quản lý dự án và những người khác",
        "B. Quyết định về việc triển khai môi trường kiểm thử",
        "C. Viết báo cáo tóm tắt kiểm thử",
        "D. Xem xét và đóng góp vào các kế hoạch kiểm thử"
      ],
      "đáp án đúng": "B. Quyết định về việc triển khai môi trường kiểm thử",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 413: Trong kiểm thử [...], các trường hợp kiểm thử (tức là đầu vào cho phần mềm) được tạo ra dựa trên các ngôn ngữ đặc tả",
      "các đáp án": [
        "A. Kiểm thử chuyển đổi trạng thái (State Transition Testing)",
        "B. Kiểm thử ngẫu nhiên (Random Testing)",
        "C. Kiểm thử cú pháp (Syntax Testing)",
        "D. Kiểm thử thâm nhập (Penetration testing)"
      ],
      "đáp án đúng": "C. Kiểm thử cú pháp (Syntax Testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 414: Kiểm thử Hộp trắng (White Box Testing)",
      "các đáp án": [
        "A. Giống như kiểm thử hộp kính (glass box testing)",
        "B. Giống như kiểm thử hộp trong suốt (clear box testing)",
        "C. Cả A. và B.",
        "D. Không có điều nào ở trên."
      ],
      "đáp án đúng": "C. Cả A. và B.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 415: Các hoạt động xác minh (Verification) trong các giai đoạn thiết kế là",
      "các đáp án": [
        "A. Đánh giá và Kiểm tra (Reviewing and Inspecting)",
        "B. Kiểm tra và Kiểm thử (Inspecting and Testing)",
        "C. Đánh giá và Kiểm thử (Reviewing and Testing)",
        "D. Đánh giá, Kiểm tra và Kiểm thử (Reviewing, Inspecting and Testing)."
      ],
      "đáp án đúng": "A. Đánh giá và Kiểm tra (Reviewing and Inspecting)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 416: Phân vùng tương đương (Equivalence partitioning) bao gồm các hoạt động khác nhau:",
      "các đáp án": [
        "A. Đảm bảo rằng các trường hợp kiểm thử kiểm tra mỗi lớp tương đương đầu vào và đầu ra ít nhất một lần",
        "B. Xác định tất cả các đầu vào và tất cả các đầu ra",
        "C. Xác định các lớp tương đương cho mỗi đầu vào",
        "D. Tất cả những điều trên"
      ],
      "đáp án đúng": "D. Tất cả những điều trên",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 417: Phân tích tĩnh (Static Analysis)",
      "các đáp án": [
        "A. Giống như kiểm thử tĩnh (static testing)",
        "B. Được thực hiện bởi các nhà phát triển",
        "C. Cả A. và B",
        "D. Không có điều nào ở trên"
      ],
      "đáp án đúng": "A. Giống như kiểm thử tĩnh (static testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 420: Mục tiêu của cuộc họp đánh giá (review meeting) là",
      "các đáp án": [
        "A. Để xác định các vấn đề với thiết kế",
        "B. Để giải quyết các vấn đề với thiết kế",
        "C. Cả A. và B",
        "D. Không có điều nào ở trên."
      ],
      "đáp án đúng": "A. Để xác định các vấn đề với thiết kế",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 422: Công cụ nào lưu trữ thông tin về các phiên bản và các bản dựng (builds) của phần mềm và testware",
      "các đáp án": [
        "A. Công cụ quản lý kiểm thử (Test Management tool)",
        "B. Công cụ quản lý yêu cầu (Requirements management tool)",
        "C. Công cụ quản lý cấu hình (Configuration management tool)",
        "D. Công cụ phân tích tĩnh (Static analysis too)"
      ],
      "đáp án đúng": "C. Công cụ quản lý cấu hình (Configuration management tool)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 423: Quy trình Kiểm thử (Testing Process) bao gồm",
      "các đáp án": [
        "A. Kế hoạch Kiểm thử và các Trường hợp Kiểm thử",
        "B. Nhật ký Kiểm thử và Trạng thái Kiểm thử",
        "C. Theo dõi Khuyết tật",
        "D. Tất cả những điều trên"
      ],
      "đáp án đúng": "D. Tất cả những điều trên",
      "nguồn ảnh": null
    },
    {
    "Câu": "Q. 424: Chuẩn bị và tự động hóa các trường hợp kiểm thử trước khi lập trình (coding) được gọi là",
    "các đáp án": [
        "A. Phương pháp tiếp cận kiểm thử trước (Test first approach)",
        "B. Phát triển hướng kiểm thử (Test-driven development)",
        "C. Cả A. & B.",
        "D. Không có điều nào ở trên"
    ],
    "đáp án đúng": "C. Cả A. & B.",
    "nguồn ảnh": null
    }
  ],
  "Đề 7 (Q. 425 -> Q. 499)": [
    {
      "Câu": "Q. 425: Tính năng nào KHÔNG phải là đặc điểm của công cụ quản lý kiểm thử (test management tool)?",
      "các đáp án": [
        "A. Hỗ trợ quản lý các bài kiểm thử và các hoạt động kiểm thử được thực hiện",
        "B. Giao diện với các công cụ thực thi kiểm thử",
        "C. Phân tích định lượng liên quan đến các bài kiểm thử",
        "D. Kiểm tra tính nhất quán và các yêu cầu không xác định",
        "E. Không có điều nào ở trên"
      ],
      "đáp án đúng": "D. Kiểm tra tính nhất quán và các yêu cầu không xác định",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 426: Đánh giá đồng cấp mã nguồn (Code Walkthrough)",
      "các đáp án": [
        "A. Là loại kiểm thử động (dynamic testing)",
        "B. Là loại kiểm thử tĩnh (static testing)",
        "C. Không phải động cũng không phải tĩnh",
        "D. Được thực hiện bởi nhóm kiểm thử"
      ],
      "đáp án đúng": "B. Là loại kiểm thử tĩnh (static testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 428: Hai thành phần chính được xem xét trong phân tích rủi ro (risk analysis) là gì?",
      "các đáp án": [
        "A. Xác suất xảy ra sự kiện tiêu cực",
        "B. Mất mát hoặc tác động tiềm tàng liên quan đến sự kiện đó",
        "C. Cả A. và B.",
        "D. Không phải A. cũng không phải B."
      ],
      "đáp án đúng": "C. Cả A. và B.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 430: Các kiểm thử chức năng (Functional tests) có thể được thực hiện ở tất cả các cấp độ kiểm thử",
      "các đáp án": [
        "A. Đúng (True)",
        "B. Sai (False)"
      ],
      "đáp án đúng": "A. Đúng (True)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 431: Kiểm thử cấu trúc (Structural Testing)",
      "các đáp án": [
        "A. Giống như kiểm thử hộp đen (black box testing)",
        "B. Giống như kiểm thử hộp trắng (white box testing)",
        "C. Giống như kiểm thử chức năng (functional testing)",
        "D. Không có điều nào ở trên."
      ],
      "đáp án đúng": "B. Giống như kiểm thử hộp trắng (white box testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 432: Trong một buổi đánh giá chính thức (formal review), việc Sửa lỗi (Rework): sửa chữa các khuyết tật được tìm thấy thường được thực hiện bởi",
      "các đáp án": [
        "A. Người điều phối (Moderator)",
        "B. Tác giả (Author)",
        "C. Người đánh giá (Reviewer)",
        "D. Người ghi chép (Recorder)"
      ],
      "đáp án đúng": "B. Tác giả (Author)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 433: [...] có thể tạo điều kiện thuận lợi cho việc kiểm thử các thành phần hoặc một phần của hệ thống bằng cách mô phỏng môi trường mà đối tượng kiểm thử sẽ chạy trong đó",
      "các đáp án": [
        "A. Công cụ thiết kế kiểm thử (Test Design tool)",
        "B. Công cụ chuẩn bị dữ liệu kiểm thử (Test data preparation tool)",
        "C. Công cụ thực thi kiểm thử (Test execution tool)",
        "D. Bộ khai thác kiểm thử (Test harness)",
        "E. Không có điều nào ở trên"
      ],
      "đáp án đúng": "D. Bộ khai thác kiểm thử (Test harness)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 434: Kiểm thử hồi quy (Regression testing) chủ yếu giúp ích trong việc",
      "các đáp án": [
        "A. Kiểm thử lại các khuyết tật đã sửa",
        "B. Kiểm tra các tác dụng phụ (side-effects) của các bản sửa lỗi",
        "C. Kiểm tra các lỗ hổng cốt lõi",
        "D. Đảm bảo sự tỉnh táo (sanity) ở mức độ cao"
      ],
      "đáp án đúng": "B. Kiểm tra các tác dụng phụ (side-effects) của các bản sửa lỗi",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 435: Đánh giá (Review) là một trong các phương pháp của V&V (Verification & Validation). Các phương pháp khác là",
      "các đáp án": [
        "A. Kiểm tra (Inspection)",
        "B. Đánh giá đồng cấp (Walkthrough)",
        "C. Kiểm thử (Testing)",
        "D. Tất cả những điều trên"
      ],
      "đáp án đúng": "D. Tất cả những điều trên",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 436: Buổi đánh giá (Review) nào là không tốn kém",
      "các đáp án": [
        "A. Đánh giá không chính thức (Informal Review)",
        "B. Đánh giá đồng cấp (Walkthrough)",
        "C. Đánh giá kỹ thuật (Technical review)",
        "D. Kiểm tra (Inspection)"
      ],
      "đáp án đúng": "A. Đánh giá không chính thức (Informal Review)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 437: Sau đây là một số rủi ro kiểm thử (testing risks)",
      "các đáp án": [
        "A. Ngân sách, Môi trường kiểm thử",
        "B. Ngân sách, Số lượng nguồn lực kiểm thử có trình độ",
        "C. Ngân sách, Số lượng nguồn lực kiểm thử có trình độ, Môi trường kiểm thử",
        "D. Không có điều nào ở trên"
      ],
      "đáp án đúng": "C. Ngân sách, Số lượng nguồn lực kiểm thử có trình độ, Môi trường kiểm thử",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 438: Kiểm thử ngẫu nhiên (Random Testing)",
      "các đáp án": [
        "A. Chương trình được kiểm thử bằng cách lấy mẫu ngẫu nhiên đầu vào.",
        "B. Một kỹ thuật kiểm thử hộp đen",
        "C. Cả A. và B..",
        "D. Không có điều nào ở trên."
      ],
      "đáp án đúng": "C. Cả A. và B..",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 439: Kỹ thuật kiểm thử hộp đen (Black-box testing) còn được gọi là kỹ thuật dựa trên cấu trúc (structure based technique)",
      "các đáp án": [
        "A. Đúng (True)",
        "B. Sai (False)"
      ],
      "đáp án đúng": "B. Sai (False)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 440: Độ tin cậy (Reliability), tính khả dụng (usablility), hiệu quả (efficiency) là",
      "các đáp án": [
        "A. Các đặc điểm chức năng (Functional characteristics)",
        "B. Các đặc điểm phi chức năng (Non functional characteristics)",
        "C. Cả A. & B.",
        "D. Không có điều nào ở trên"
      ],
      "đáp án đúng": "B. Các đặc điểm phi chức năng (Non functional characteristics)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 441: Kế hoạch kiểm thử (Test Plan)",
      "các đáp án": [
        "A. Là lộ trình (Road map) cho việc kiểm thử",
        "B. Cho biết về các kết quả thực tế và kết quả mong đợi",
        "C. Cả a và b",
        "D. Không có điều nào ở trên"
      ],
      "đáp án đúng": "A. Là lộ trình (Road map) cho việc kiểm thử",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 443: Độ bao phủ đường đi (Path coverage) bao gồm",
      "các đáp án": [
        "A. Độ bao phủ câu lệnh (Statement coverage)",
        "B. Độ bao phủ điều kiện (Condition coverage)",
        "C. Độ bao phủ quyết định (Decision coverage)",
        "D. Không có điều nào trong số này"
      ],
      "đáp án đúng": "C. Độ bao phủ quyết định (Decision coverage)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 444: Bạn ưu tiên kỹ thuật kiểm thử nào cho các tình huống sau? 1. Áp lực thời gian nghiêm trọng. 2. Đặc tả không đầy đủ.",
      "các đáp án": [
        "A. Kiểm thử quyết định (Decision testing)",
        "B. Đoán lỗi (Error guessing)",
        "C. Kiểm thử câu lệnh (Statement testing)",
        "D. Kiểm thử khám phá (Exploratory testing)"
      ],
      "đáp án đúng": "D. Kiểm thử khám phá (Exploratory testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 445: Kiểm thử phục hồi (Recovery testing) là một kiểm thử hệ thống buộc phần mềm bị hỏng và xác minh rằng việc khôi phục dữ liệu được thực hiện đúng cách. Những điều sau đây nên được kiểm tra tính đúng đắn: 1. Khởi tạo lại (Re-initialization). 2. Khởi động lại (Restart). 3. Phục hồi dữ liệu (Data Recovery). 4. Cơ chế Điểm kiểm tra (Check Point Mechanism).",
      "các đáp án": [
        "A. 1 và 2",
        "B. 1, 2 và 3",
        "C. 1, 2, 3 và 4",
        "D. 2 và 4"
      ],
      "đáp án đúng": "C. 1, 2, 3 và 4",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 446: Phân tích luồng dữ liệu (Data flow analysis) nghiên cứu:",
      "các đáp án": [
        "A. Các tắc nghẽn giao tiếp có thể có trong một chương trình.",
        "B. Tốc độ thay đổi của các giá trị dữ liệu khi một chương trình thực thi.",
        "C. Việc sử dụng dữ liệu trên các đường đi (paths) qua mã nguồn.",
        "D. Độ phức tạp nội tại của mã nguồn."
      ],
      "đáp án đúng": "C. Việc sử dụng dữ liệu trên các đường đi (paths) qua mã nguồn.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 447: Đâu KHÔNG phải là kỹ thuật hộp trắng (white box technique)?",
      "các đáp án": [
        "A. Kiểm thử câu lệnh (Statement testing)",
        "B. Kiểm thử đường đi (Path testing)",
        "C. Kiểm thử luồng dữ liệu (Data flow testing)",
        "D. Kiểm thử chuyển đổi trạng thái (State transition testing)"
      ],
      "đáp án đúng": "D. Kiểm thử chuyển đổi trạng thái (State transition testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 448: Điều nào sau đây mô tả lợi ích lớn nhất của việc xác minh (verification) sớm trong vòng đời?",
      "các đáp án": [
        "A. Nó cho phép xác định các thay đổi trong yêu cầu của người dùng.",
        "B. Nó tạo điều kiện thuận lợi cho việc thiết lập môi trường kiểm thử kịp thời.",
        "C. Nó làm giảm sự nhân lên của khuyết tật (defect multiplication).",
        "D. Nó cho phép người kiểm thử tham gia sớm vào dự án."
      ],
      "đáp án đúng": "C. Nó làm giảm sự nhân lên của khuyết tật (defect multiplication).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 450: Kiểm thử Alpha (Alpha testing) là:",
      "các đáp án": [
        "A. Kiểm thử sau khi phát hành (Post-release) bởi đại diện người dùng cuối tại địa điểm của nhà phát triển.",
        "B. Kiểm thử đầu tiên được thực hiện.",
        "C. Kiểm thử trước khi phát hành (Pre-release) bởi đại diện người dùng cuối tại địa điểm của nhà phát triển.",
        "D. Kiểm thử trước khi phát hành (Pre-release) bởi đại diện người dùng cuối tại địa điểm của họ."
      ],
      "đáp án đúng": "C. Kiểm thử trước khi phát hành (Pre-release) bởi đại diện người dùng cuối tại địa điểm của nhà phát triển.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 451: Chúng ta chia kiểm thử thành các giai đoạn (stages) riêng biệt chủ yếu vì:",
      "các đáp án": [
        "A. Mỗi giai đoạn kiểm thử có một mục đích khác nhau.",
        "B. Dễ dàng hơn để quản lý kiểm thử theo các giai đoạn.",
        "C. Chúng ta có thể chạy các bài kiểm thử khác nhau trong các môi trường khác nhau.",
        "D. Càng có nhiều giai đoạn, kiểm thử càng tốt."
      ],
      "đáp án đúng": "A. Mỗi giai đoạn kiểm thử có một mục đích khác nhau.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 452: Điều nào sau đây KHÔNG thường là một phần của kế hoạch kiểm thử (test plan)?",
      "các đáp án": [
        "A. Các tính năng cần được kiểm thử",
        "B. Các báo cáo sự cố (Incident reports)",
        "C. Các rủi ro (Risks)",
        "D. Lịch trình (Schedule)"
      ],
      "đáp án đúng": "B. Các báo cáo sự cố (Incident reports)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 453: Đâu là một hình thức của kiểm thử chức năng (functional testing)?",
      "các đáp án": [
        "A. Phân tích giá trị biên (Boundary value analysis)",
        "B. Kiểm thử tính khả dụng (Usability testing)",
        "C. Kiểm thử hiệu năng (Performance testing)",
        "D. Kiểm thử bảo mật (Security testing)"
      ],
      "đáp án đúng": "A. Phân tích giá trị biên (Boundary value analysis)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 454: Phát biểu nào sau đây về kiểm thử hệ thống (system testing) là KHÔNG đúng?",
      "các đáp án": [
        "A. Các bài kiểm thử hệ thống thường được thực hiện bởi các nhóm độc lập.",
        "B. Kiểm thử chức năng được sử dụng nhiều hơn kiểm thử cấu trúc.",
        "C. Các lỗi (Faults) được tìm thấy trong quá trình kiểm thử hệ thống có thể rất tốn kém để sửa chữa.",
        "D. Người dùng cuối (End-users) nên được tham gia vào các bài kiểm thử hệ thống."
      ],
      "đáp án đúng": "D. Người dùng cuối (End-users) nên được tham gia vào các bài kiểm thử hệ thống.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 455: Điều nào sau đây không được mô tả trong một tiêu chuẩn kiểm thử đơn vị (unit test standard)?",
      "các đáp án": [
        "A. Kiểm thử cú pháp (Syntax testing)",
        "B. Phân vùng tương đương (Equivalence partitioning)",
        "C. Kiểm thử căng thẳng (Stress testing)",
        "D. Độ bao phủ điều kiện/quyết định đã sửa đổi (Modified condition/decision coverage)"
      ],
      "đáp án đúng": "C. Kiểm thử căng thẳng (Stress testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 456: Điều nào sau đây có khả năng hưởng lợi nhiều nhất từ việc sử dụng các công cụ kiểm thử cung cấp các cơ sở ghi và phát lại (test capture and replay facilities)?",
      "các đáp án": [
        "A. Kiểm thử hồi quy (Regression testing)",
        "B. Kiểm thử tích hợp (Integration testing)",
        "C. Kiểm thử hệ thống (System testing)",
        "D. Kiểm thử chấp nhận người dùng (User acceptance testing)"
      ],
      "đáp án đúng": "A. Kiểm thử hồi quy (Regression testing)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 458: Phân tích tĩnh (Static analysis) được mô tả tốt nhất là:",
      "các đáp án": [
        "A. Việc phân tích các chương trình hàng loạt (batch programs).",
        "B. Việc đánh giá (reviewing) các kế hoạch kiểm thử.",
        "C. Việc phân tích mã chương trình (program code).",
        "D. Việc sử dụng kiểm thử hộp đen."
      ],
      "đáp án đúng": "C. Việc phân tích mã chương trình (program code).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 459: Phát biểu nào sau đây KHÔNG đúng?",
      "các đáp án": [
        "A. Một bộ kiểm thử tối thiểu đạt 100% độ bao phủ LCSAJ cũng sẽ đạt 100% độ bao phủ nhánh (branch coverage).",
        "B. Một bộ kiểm thử tối thiểu đạt 100% độ bao phủ đường đi (path coverage) cũng sẽ đạt 100% độ bao phủ câu lệnh (statement coverage).",
        "C. Một bộ kiểm thử tối thiểu đạt 100% độ bao phủ đường đi (path coverage) thường sẽ phát hiện nhiều lỗi (faults) hơn so với bộ đạt 100% độ bao phủ câu lệnh.",
        "D. Một bộ kiểm thử tối thiểu đạt 100% độ bao phủ câu lệnh (statement coverage) thường sẽ phát hiện nhiều lỗi hơn so với bộ đạt 100% độ bao phủ nhánh."
      ],
      "đáp án đúng": "D. Một bộ kiểm thử tối thiểu đạt 100% độ bao phủ câu lệnh (statement coverage) thường sẽ phát hiện nhiều lỗi hơn so với bộ đạt 100% độ bao phủ nhánh.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 460: Phát biểu nào sau đây về đánh giá (reviews) là đúng?",
      "các đáp án": [
        "A. Đánh giá không thể được thực hiện trên các đặc tả yêu cầu người dùng.",
        "B. Đánh giá là cách kém hiệu quả nhất để kiểm thử mã nguồn.",
        "C. Đánh giá không có khả năng tìm thấy lỗi (faults) trong các kế hoạch kiểm thử.",
        "D. Đánh giá nên được thực hiện trên các đặc tả, mã nguồn, và các kế hoạch kiểm thử."
      ],
      "đáp án đúng": "D. Đánh giá nên được thực hiện trên các đặc tả, mã nguồn, và các kế hoạch kiểm thử.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 462: Hoạt động nào trong số này cung cấp tiềm năng tiết kiệm chi phí lớn nhất từ việc sử dụng CAST (Computer Aided Software Testing)?",
      "các đáp án": [
        "A. Quản lý kiểm thử (Test management)",
        "B. Thiết kế kiểm thử (Test design)",
        "C. Thực thi kiểm thử (Test execution)",
        "D. Lập kế hoạch kiểm thử (Test planning)"
      ],
      "đáp án đúng": "C. Thực thi kiểm thử (Test execution)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 464: Điều nào sau đây mô tả chi phí của các lỗi (faults)?",
      "các đáp án": [
        "A. Chúng rẻ nhất để tìm thấy trong các pha phát triển ban đầu và đắt nhất để sửa chữa trong các pha kiểm thử cuối cùng.",
        "B. Chúng dễ tìm thấy nhất trong quá trình kiểm thử hệ thống nhưng đắt nhất để sửa chữa lúc đó.",
        "C. Lỗi rẻ nhất để tìm thấy trong các pha phát triển ban đầu nhưng đắt nhất để sửa chữa lúc đó.",
        "D. Mặc dù lỗi đắt nhất để tìm thấy trong các pha phát triển ban đầu, chúng lại rẻ nhất để sửa chữa lúc đó."
      ],
      "đáp án đúng": "A. Chúng rẻ nhất để tìm thấy trong các pha phát triển ban đầu và đắt nhất để sửa chữa trong các pha kiểm thử cuối cùng.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 465: Phát biểu nào sau đây về các công cụ ghi-phát lại (capture-replay tools) là KHÔNG đúng?",
      "các đáp án": [
        "A. Chúng được sử dụng để hỗ trợ kiểm thử đa người dùng.",
        "B. Chúng được sử dụng để ghi lại và mô phỏng (animate) các yêu cầu của người dùng.",
        "C. Chúng là loại công cụ CAST được mua thường xuyên nhất.",
        "D. Chúng ghi lại các khía cạnh của hành vi người dùng."
      ],
      "đáp án đúng": "B. Chúng được sử dụng để ghi lại và mô phỏng (animate) các yêu cầu của người dùng.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 466: Điều nào sau đây là đúng về mô hình V (V-model)?",
      "các đáp án": [
        "A. Nó nói rằng các mô-đun được kiểm thử dựa trên các yêu cầu của người dùng.",
        "B. Nó chỉ mô hình hóa pha kiểm thử.",
        "C. Nó chỉ định các kỹ thuật kiểm thử sẽ được sử dụng.",
        "D. Nó bao gồm việc xác minh (verification) các thiết kế."
      ],
      "đáp án đúng": "D. Nó bao gồm việc xác minh (verification) các thiết kế.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 467: Đoán lỗi (Error guessing):",
      "các đáp án": [
        "A. Bổ sung cho các kỹ thuật thiết kế kiểm thử chính thức.",
        "B. Chỉ có thể được sử dụng trong kiểm thử thành phần, tích hợp và hệ thống.",
        "C. Chỉ được thực hiện trong kiểm thử chấp nhận người dùng.",
        "D. Không thể lặp lại và không nên được sử dụng."
      ],
      "đáp án đúng": "A. Bổ sung cho các kỹ thuật thiết kế kiểm thử chính thức.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 468: Trong một hệ thống được thiết kế để tính thuế phải nộp: [...] £4000 miễn thuế. £1500 tiếp theo 10%. £28000 tiếp theo 22%. Bất kỳ số tiền nào thêm nữa 40%. Nhóm số nào sau đây sẽ thuộc cùng một lớp tương đương (equivalence class)?",
      "các đáp án": [
        "A. £4800; £14000; £28000",
        "B. £5200; £5500; £28000",
        "C. £28001; £32000; £35000",
        "D. £5800; £28000; £32000"
      ],
      "đáp án đúng": "D. £5800; £28000; £32000",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 470: Khi ưu tiên những gì cần kiểm thử, mục tiêu quan trọng nhất là:",
      "các đáp án": [
        "A. Tìm càng nhiều lỗi (faults) càng tốt.",
        "B. Kiểm thử các khu vực có rủi ro cao (high risk areas).",
        "C. Đạt được độ bao phủ kiểm thử tốt.",
        "D. Kiểm thử bất cứ điều gì dễ kiểm thử nhất."
      ],
      "đáp án đúng": "B. Kiểm thử các khu vực có rủi ro cao (high risk areas).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 471: Điều quan trọng nhất về thiết kế kiểm thử sớm (early test design) là nó:",
      "các đáp án": [
        "A. Giúp việc chuẩn bị kiểm thử dễ dàng hơn.",
        "B. Có nghĩa là không cần các buổi kiểm tra (inspections).",
        "C. Có thể ngăn chặn sự nhân lên của lỗi (fault multiplication).",
        "D. Sẽ tìm thấy tất cả các lỗi."
      ],
      "đáp án đúng": "C. Có thể ngăn chặn sự nhân lên của lỗi (fault multiplication).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 472: Một hệ thống quản lý cấu hình (configuration management system) thường sẽ KHÔNG cung cấp:",
      "các đáp án": [
        "A. Liên kết các yêu cầu của khách hàng với các số hiệu phiên bản.",
        "B. Các phương tiện để so sánh kết quả kiểm thử với kết quả mong đợi.",
        "C. Sự khác biệt chính xác trong các phiên bản của mã nguồn thành phần phần mềm.",
        "D. Quyền truy cập bị hạn chế vào thư viện mã nguồn."
      ],
      "đáp án đúng": "B. Các phương tiện để so sánh kết quả kiểm thử với kết quả mong đợi.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 473: Kiểm thử tích hợp ở quy mô nhỏ (Integration testing in the small):",
      "các đáp án": [
        "A. Kiểm thử các thành phần riêng lẻ đã được phát triển.",
        "B. Kiểm thử sự tương tác giữa các mô-đun hoặc các hệ thống con (subsystems).",
        "C. Chỉ sử dụng các thành phần là một phần của hệ thống thực (live system).",
        "D. Kiểm thử các giao diện với các hệ thống khác."
      ],
      "đáp án đúng": "B. Kiểm thử sự tương tác giữa các mô-đun hoặc các hệ thống con (subsystems).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 474: Yêu cầu nào sau đây là có thể kiểm thử được (testable)?",
      "các đáp án": [
        "A. Hệ thống phải thân thiện với người dùng.",
        "B. Các phần quan trọng về an toàn của hệ thống phải chứa 0 lỗi.",
        "C. Thời gian phản hồi phải dưới một giây đối với tải thiết kế đã chỉ định.",
        "D. Hệ thống phải được xây dựng để có thể di động (portable)."
      ],
      "đáp án đúng": "C. Thời gian phản hồi phải dưới một giây đối với tải thiết kế đã chỉ định.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 475: Một lợi ích quan trọng của việc kiểm tra mã nguồn (code inspections) là chúng:",
      "các đáp án": [
        "A. Cho phép mã nguồn được kiểm thử trước khi môi trường thực thi sẵn sàng.",
        "B. Có thể được thực hiện bởi người đã viết mã nguồn.",
        "C. Có thể được thực hiện bởi nhân viên thiếu kinh nghiệm.",
        "D. Rẻ để thực hiện."
      ],
      "đáp án đúng": "A. Cho phép mã nguồn được kiểm thử trước khi môi trường thực thi sẵn sàng.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 476: Các trường hợp kiểm thử (Test cases) được thiết kế trong quá trình:",
      "các đáp án": [
        "A. Ghi lại kiểm thử (Test recording).",
        "B. Lập kế hoạch kiểm thử (Test planning).",
        "C. Cấu hình kiểm thử (Test configuration).",
        "D. Đặc tả kiểm thử (Test specification)."
      ],
      "đáp án đúng": "D. Đặc tả kiểm thử (Test specification).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 477: Một hư hỏng (failure) là:",
      "các đáp án": [
        "A. Được tìm thấy trong phần mềm; là kết quả của một lỗi (error).",
        "B. Sự sai lệch so với hành vi được chỉ định.",
        "C. Một bước, quy trình hoặc định nghĩa dữ liệu không chính xác trong một chương trình máy tính.",
        "D. Một hành động của con người tạo ra một kết quả không chính xác."
      ],
      "đáp án đúng": "B. Sự sai lệch so với hành vi được chỉ định.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 478: Bạn sẽ ước tính số lượng kiểm thử lại (re-testing) có khả năng được yêu cầu như thế nào?",
      "các đáp án": [
        "A. Các số liệu (Metrics) từ các dự án tương tự trước đó",
        "B. Thảo luận với nhóm phát triển",
        "C. Thời gian được phân bổ cho kiểm thử hồi quy",
        "D. A. & B."
      ],
      "đáp án đúng": "D. A. & B.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 479: Cho các tập hợp thuật ngữ quản lý kiểm thử (v-z) và mô tả hoạt động (1-5) sau, cái nào ghép nối hai tập hợp tốt nhất? v - Kiểm soát kiểm thử. w - Giám sát kiểm thử. x - Ước tính kiểm thử. y - Quản lý sự cố. z - Kiểm soát cấu hình. \n 1- Tính toán các nguồn lực kiểm thử cần thiết. 2- Duy trì hồ sơ kết quả kiểm thử. 3- Phân bổ lại nguồn lực khi các bài kiểm thử bị chậm tiến độ. 4- Báo cáo về sự sai lệch so với kế hoạch kiểm thử. 5- Theo dõi các kết quả kiểm thử bất thường.",
      "các đáp án": [
        "A. v-3, w-2, x-1, y-5, z-4",
        "B. v-2, w-5, x-1, y-4, z-3",
        "C. v-3, w-4, x-1, y-5, z-2",
        "D. v-2, w-1, x-4, y-3, z-5"
      ],
      "đáp án đúng": "C. v-3, w-4, x-1, y-5, z-2",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 480: Trong một hệ thống được thiết kế để tính thuế phải nộp: [...] £4000 miễn thuế. £1500 tiếp theo 10%. £28000 tiếp theo 22%. Bất kỳ số tiền nào thêm nữa 40%. Đến đồng bảng (pound) gần nhất, đâu là một trường hợp kiểm thử Phân tích giá trị biên (Boundary Value Analysis) hợp lệ?",
      "các đáp án": [
        "A. £1500",
        "B. £32001",
        "C. £33501",
        "D. £28000"
      ],
      "đáp án đúng": "C. £33501",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 481: Điều nào sau đây KHÔNG đúng về các tiêu chí độ bao phủ kiểm thử (test coverage criteria)?",
      "các đáp án": [
        "A. Các tiêu chí độ bao phủ kiểm thử có thể được đo lường bằng số lượng các hạng mục được thực thi bởi một bộ kiểm thử.",
        "B. Một thước đo của các tiêu chí độ bao phủ kiểm thử là tỷ lệ phần trăm các yêu cầu của người dùng được bao phủ.",
        "C. Một thước đo của các tiêu chí độ bao phủ kiểm thử là tỷ lệ phần trăm các lỗi (faults) được tìm thấy.",
        "D. Các tiêu chí độ bao phủ kiểm thử thường được sử dụng khi chỉ định các tiêu chí hoàn thành kiểm thử."
      ],
      "đáp án đúng": "C. Một thước đo của các tiêu chí độ bao phủ kiểm thử là tỷ lệ phần trăm các lỗi (faults) được tìm thấy.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 483: Điều nào sau đây KHÔNG nên là mục tiêu cho một bài kiểm thử?",
      "các đáp án": [
        "A. Để tìm ra các lỗi (faults) trong phần mềm.",
        "B. Để đánh giá xem phần mềm đã sẵn sàng để phát hành hay chưa.",
        "C. Để chứng minh rằng phần mềm không hoạt động.",
        "D. Để chứng minh rằng phần mềm là đúng (correct)."
      ],
      "đáp án đúng": "D. Để chứng minh rằng phần mềm là đúng (correct).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 484: Kiểm thử đã được thực hiện đủ khi:",
      "các đáp án": [
        "A. Hết thời gian.",
        "B. Mức độ tin cậy (confidence) cần thiết đã đạt được.",
        "C. Không tìm thấy thêm lỗi (faults) nào.",
        "D. Người dùng sẽ không tìm thấy bất kỳ lỗi nghiêm trọng nào."
      ],
      "đáp án đúng": "B. Mức độ tin cậy (confidence) cần thiết đã đạt được.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 485: Đâu là nguồn tốt nhất cho các Kết quả Mong đợi (Expected Outcomes) cho các kịch bản Kiểm thử Chấp nhận Người dùng (User Acceptance Test scripts)?",
      "các đáp án": [
        "A. Kết quả thực tế",
        "B. Đặc tả chương trình",
        "C. Yêu cầu của người dùng (User requirements)",
        "D. Đặc tả hệ thống"
      ],
      "đáp án đúng": "C. Yêu cầu của người dùng (User requirements)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 487: Điều nào sau đây là một đặc điểm của kiểm thử tốt trong bất kỳ mô hình vòng đời nào?",
      "các đáp án": [
        "A. Tất cả các buổi đánh giá tài liệu đều có sự tham gia của nhóm phát triển.",
        "B. Một số, nhưng không phải tất cả, các hoạt động phát triển có các hoạt động kiểm thử tương ứng.",
        "C. Mỗi cấp độ kiểm thử (test level) có các mục tiêu kiểm thử cụ thể cho cấp độ đó.",
        "D. Phân tích và thiết kế các bài kiểm thử bắt đầu ngay khi việc phát triển hoàn tất."
      ],
      "đáp án đúng": "C. Mỗi cấp độ kiểm thử (test level) có các mục tiêu kiểm thử cụ thể cho cấp độ đó.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 488: Quy trình thiết kế các trường hợp kiểm thử (designing test cases) bao gồm các hoạt động sau: i. Xây dựng và mô tả chi tiết các trường hợp kiểm thử bằng cách sử dụng các kỹ thuật thiết kế kiểm thử. ii. Chỉ định thứ tự thực thi trường hợp kiểm thử. iii. Phân tích các yêu cầu và đặc tả để xác định các điều kiện kiểm thử. iv. Chỉ định các kết quả mong đợi. \n Theo quy trình xác định và thiết kế các bài kiểm thử, thứ tự đúng của các hoạt động này là gì?",
      "các đáp án": [
        "A. iii, i, iv, ii.",
        "B. iii, iv, i, ii.",
        "C. iii, ii, i, iv.",
        "D. ii, iii, i, iv."
      ],
      "đáp án đúng": "A. iii, i, iv, ii.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 489: Lợi thế quan trọng nhất của tính độc lập trong kiểm thử (independence in testing) là gì?",
      "các đáp án": [
        "A. Một người kiểm thử độc lập có thể tìm thấy các khuyết tật nhanh hơn người đã viết phần mềm.",
        "B. Một người kiểm thử độc lập có thể tập trung hơn vào việc chỉ ra cách phần mềm hoạt động so với người đã viết phần mềm.",
        "C. Một người kiểm thử độc lập có thể hiệu quả và năng suất hơn vì họ ít quen thuộc với phần mềm hơn người đã viết nó.",
        "D. Một người kiểm thử độc lập có thể hiệu quả hơn trong việc tìm ra các khuyết tật mà người đã viết phần mềm bỏ sót."
      ],
      "đáp án đúng": "D. Một người kiểm thử độc lập có thể hiệu quả hơn trong việc tìm ra các khuyết tật mà người đã viết phần mềm bỏ sót.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 490: Cho đặc tả sau, những giá trị nào cho tuổi (age) nằm trong CÙNG một phân vùng tương đương? Nếu bạn dưới 18 tuổi, bạn quá trẻ để được bảo hiểm. Từ 18 đến 30 (bao gồm cả 18 và 30), bạn sẽ được giảm giá 20%. Bất kỳ ai trên 30 tuổi đều không đủ điều kiện để được giảm giá.",
      "các đáp án": [
        "A. 17, 18, 19.",
        "B. 29, 30, 31.",
        "C. 18, 29, 30.",
        "D. 17, 29, 31."
      ],
      "đáp án đúng": "C. 18, 29, 30.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 491: Xem xét các phát biểu sau: i. 100% độ bao phủ câu lệnh đảm bảo 100% độ bao phủ nhánh. ii. 100% độ bao phủ nhánh đảm bảo 100% độ bao phủ câu lệnh. iii. 100% độ bao phủ nhánh đảm bảo 100% độ bao phủ quyết định. iv. 100% độ bao phủ quyết định đảm bảo 100% độ bao phủ nhánh. v. 100% độ bao phủ câu lệnh đảm bảo 100% độ bao phủ quyết định.",
      "các đáp án": [
        "A. ii là Đúng; i, iii, iv & v là Sai",
        "B. i & v là Đúng: ii, iii & iv là Sai",
        "C. ii & iii là Đúng; i, iv & v là Sai",
        "D. ii, iii & iv là Đúng; i & v là Sai"
      ],
      "đáp án đúng": "D. ii, iii & iv là Đúng; i & v là Sai",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 492: Sự khác biệt giữa rủi ro dự án (project risk) và rủi ro sản phẩm (product risk) là gì?",
      "các đáp án": [
        "A. Rủi ro dự án là các khu vực có khả năng thất bại trong phần mềm hoặc hệ thống: rủi ro sản phẩm là các rủi ro liên quan đến khả năng của dự án trong việc cung cấp các mục tiêu của nó.",
        "B. Rủi ro dự án là các rủi ro liên quan đến khả năng của dự án trong việc cung cấp các mục tiêu của nó; rủi ro sản phẩm là các khu vực có khả năng thất bại trong phần mềm hoặc hệ thống.",
        "C. Rủi ro dự án thường liên quan đến các vấn đề nhà cung cấp, yếu tố tổ chức và các vấn đề kỹ thuật; rủi ro sản phẩm thường liên quan đến thiếu hụt kỹ năng và nhân sự.",
        "D. Rủi ro dự án là rủi ro mà phần mềm được giao sẽ không hoạt động; rủi ro sản phẩm thường liên quan đến các vấn đề nhà cung cấp, yếu tố tổ chức và các vấn đề kỹ thuật."
      ],
      "đáp án đúng": "B. Rủi ro dự án là các rủi ro liên quan đến khả năng của dự án trong việc cung cấp các mục tiêu của nó; rủi ro sản phẩm là các khu vực có khả năng thất bại trong phần mềm hoặc hệ thống.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 493: Trong hoạt động nào của quy trình kiểm thử cơ bản, chúng ta xác định xem có cần THÊM bài kiểm thử hay không?",
      "các đáp án": [
        "A. Triển khai và thực thi kiểm thử.",
        "B. Đánh giá tiêu chí rút lui kiểm thử.",
        "C. Phân tích và thiết kế kiểm thử.",
        "D. Lập kế hoạch và kiểm soát kiểm thử."
      ],
      "đáp án đúng": "B. Đánh giá tiêu chí rút lui kiểm thử.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 494: Mục đích CHÍNH của một Kế hoạch Kiểm thử Tổng thể (Master Test Plan) là gì?",
      "các đáp án": [
        "A. Để truyền đạt cách thức các sự cố (incidents) sẽ được quản lý.",
        "B. Để truyền đạt cách thức kiểm thử sẽ được thực hiện.",
        "C. Để tạo ra một lịch trình kiểm thử.",
        "D. Để tạo ra một cấu trúc phân chia công việc."
      ],
      "đáp án đúng": "B. Để truyền đạt cách thức kiểm thử sẽ được thực hiện.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 495: Điều nào sau đây định nghĩa thứ tự (sequence) mà các bài kiểm thử nên được thực thi?",
      "các đáp án": [
        "A. Kế hoạch kiểm thử (Test plan).",
        "B. Đặc tả thủ tục kiểm thử (Test procedure specification).",
        "C. Đặc tả trường hợp kiểm thử (Test case specification).",
        "D. Đặc tả thiết kế kiểm thử (Test design specification)."
      ],
      "đáp án đúng": "B. Đặc tả thủ tục kiểm thử (Test procedure specification).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 496: Đâu là một nhiệm vụ chính của lập kế hoạch kiểm thử (test planning)?",
      "các đáp án": [
        "A. Xác định phương pháp tiếp cận kiểm thử (Determining the test approach).",
        "B. Chuẩn bị các đặc tả kiểm thử (Preparing test specifications).",
        "C. Đánh giá tiêu chí rút lui và báo cáo (Evaluating exit criteria and reporting).",
        "D. Đo lường và phân tích kết quả (Measuring and analyzing results)."
      ],
      "đáp án đúng": "A. Xác định phương pháp tiếp cận kiểm thử (Determining the test approach).",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 497: Mục đích chính của phân tích tác động (impact analysis) đối với người kiểm thử là gì?",
      "các đáp án": [
        "A. Để xác định nỗ lực lập trình cần thiết để thực hiện các thay đổi.",
        "B. Để xác định tỷ lệ nào của các thay đổi cần được kiểm thử.",
        "C. Để xác định mức độ ảnh hưởng của các thay đổi đã lên kế hoạch đối với người dùng.",
        "D. Để xác định hệ thống hiện có có thể bị ảnh hưởng bởi các thay đổi như thế nào."
      ],
      "đáp án đúng": "D. Để xác định hệ thống hiện có có thể bị ảnh hưởng bởi các thay đổi như thế nào.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 498: Trong một hệ thống được thiết kế để tính thuế phải nộp: [...] £4000 miễn thuế. £1500 tiếp theo 10%. £28000 tiếp theo sau đó là 22%. Bất kỳ số tiền nào thêm nữa 40%. Đến đồng bảng (pound) gần nhất, đâu là một trường hợp kiểm thử Phân tích giá trị biên (Boundary Value Analysis) hợp lệ?",
      "các đáp án": [
        "A. £28000.",
        "B. £33501.",
        "C. £32001.",
        "D. £1500."
      ],
      "đáp án đúng": "B. £33501.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 499: Công cụ nào sau đây có nhiều khả năng chứa một bộ so sánh (comparator) nhất?",
      "các đáp án": [
        "A. Công cụ Phân tích Động (Dynamic Analysis tool).",
        "B. Công cụ Thực thi Kiểm thử (Test Execution tool).",
        "C. Công cụ Phân tích Tĩnh (Static Analysis tool).",
        "D. Công cụ Bảo mật (Security tool)."
      ],
      "đáp án đúng": "B. Công cụ Thực thi Kiểm thử (Test Execution tool).",
      "nguồn ảnh": null
    }
  ],
  "Đề 8 (Q. 16 -> Q. 482)": [
    {
      "Câu": "Q. 16: Cho đoạn mã sau, cần bao nhiêu trường hợp kiểm thử để đạt 100% độ bao phủ quyết định (decision coverage)?\nif width > length\nthen\n  biggest_dimension = width\n  if height > width\n  then\n    biggest_dimension = height\n  end_if\nelse\n  biggest_dimension = length\n  if height > length\n  then\n    biggest_dimension = height\n  end_if\nend_if",
      "các đáp án": [
        "A. 3",
        "B. 4",
        "C. 2",
        "D. 1"
      ],
      "đáp án đúng": "B. 4",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 17: Bạn đã thiết kế các trường hợp kiểm thử để cung cấp 100% độ bao phủ câu lệnh (statement coverage) và 100% độ bao phủ quyết định (decision coverage) cho đoạn mã [if width > length...]. Các dòng 'print' sau đã được thêm vào cuối đoạn mã trên. Cần thêm bao nhiêu trường hợp kiểm thử?",
      "các đáp án": [
        "A. Cần thêm một trường hợp kiểm thử cho 100% độ bao phủ quyết định.",
        "B. Cần thêm hai trường hợp kiểm thử cho 100% độ bao phủ câu lệnh...",
        "C. Không cần, các trường hợp kiểm thử hiện có có thể được sử dụng.",
        "D. Cần thêm một trường hợp kiểm thử cho 100% độ bao phủ câu lệnh."
      ],
      "đáp án đúng": "C. Không cần, các trường hợp kiểm thử hiện có có thể được sử dụng.",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 39: Sơ đồ trên biểu diễn các đường đi (path) sau đây qua mã nguồn. A. vwy, B. vwz, C. vxy, D. vxz. Sự kết hợp TỐI THIỂU nào của các đường đi là cần thiết để cung cấp độ bao phủ câu lệnh (statement coverage) đầy đủ?",
      "các đáp án": [
        "A. A",
        "B. ABD",
        "C. ABCD",
        "D. ACD"
      ],
      "đáp án đúng": "D. ACD",
      "nguồn ảnh": "Ảnh tại Trang 11 (500-ISTQB-Sample-Papers...)"
    },
    {
      "Câu": "Q. 184: Cho chương trình sau: IF X <> Z THEN Statement 2; END. Độ phức tạp Cyclomatic của McCabe là:",
      "các đáp án": [
        "A. 2",
        "B. 3",
        "C. 4",
        "D. 5"
      ],
      "đáp án đúng": "A. 2",
      "nguồn ảnh": null
    },  
    {
      "Câu": "Q. 189: Cần bao nhiêu trường hợp kiểm thử để bao phủ tất cả các chuỗi câu lệnh (đường đi) có thể có cho đoạn chương trình sau? (Giả sử hai điều kiện độc lập với nhau):\nif (Condition 1) then statement 1 else statement 2 fi\nif (Condition 2) then statement 3 fi",
      "các đáp án": [
        "A. 2 Trường hợp kiểm thử",
        "B. 3 Trường hợp kiểm thử",
        "C. 4 Trường hợp kiểm thử",
        "D. Không thể đạt được"
      ],
      "đáp án đúng": "C. 4 Trường hợp kiểm thử",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 230: Cho đoạn mã sau: Bật PC -> Khởi động 'outlook' -> IF outlook xuất hiện THEN -> Gửi email -> Đóng outlook. (Cần bao nhiêu kiểm thử cho độ bao phủ câu lệnh và độ bao phủ nhánh?)",
      "các đáp án": [
        "A. 1 kiểm thử cho độ bao phủ câu lệnh, 1 cho độ bao phủ nhánh",
        "B. 1 kiểm thử cho độ bao phủ câu lệnh, 2 cho độ bao phủ nhánh",
        "C. 1 kiểm thử cho độ bao phủ câu lệnh, 3 cho độ bao phủ nhánh",
        "D. 2 kiểm thử cho độ bao phủ câu lệnh, 2 cho độ bao phủ nhánh",
        "E. 2 kiểm thử cho độ bao phủ câu lệnh, 3 cho độ bao phủ nhánh"
      ],
      "đáp án đúng": "B. 1 kiểm thử cho độ bao phủ câu lệnh, 2 cho độ bao phủ nhánh",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 236: Cho đoạn mã sau, điều nào là đúng: \nIF A>B THEN C=A-B ELSE C=A+B ENDIF\nRead D\nIF C=D Then Print \"Error\" ENDIF",
      "các đáp án": [
        "A. 1 kiểm thử cho độ bao phủ câu lệnh, 3 cho độ bao phủ nhánh",
        "B. 2 kiểm thử cho độ bao phủ câu lệnh, 2 cho độ bao phủ nhánh",
        "C. 2 kiểm thử cho độ bao phủ câu lệnh, 3 cho độ bao phủ nhánh",
        "D. 3 kiểm thử cho độ bao phủ câu lệnh, 3 cho độ bao phủ nhánh",
        "E. 3 kiểm thử cho độ bao phủ câu lệnh, 2 cho độ bao phủ nhánh"
      ],
      "đáp án đúng": "B. 2 kiểm thử cho độ bao phủ câu lệnh, 2 cho độ bao phủ nhánh",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 254: Xem xét đoạn mã giả sau: [Đọc báo -> Xem TV -> IF (chương trình thú vị) THEN (bật TV xem) ELSE (Tiếp tục đọc báo) -> IF (có ô chữ) THEN (giải ô chữ)]. (SC = Statement Coverage, DC = Decision Coverage)",
      "các đáp án": [
        "A. SC = 1 và DC = 1",
        "B. SC = 1 và DC = 2",
        "C. SC = 1 và DC = 3",
        "D. SC = 2 và DC = 2",
        "E. SC = 2 và DC = 3"
      ],
      "đáp án đúng": "D. SC = 2 và DC = 2",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 257: Cho đoạn mã sau, điều nào đúng về số lượng trường hợp kiểm thử tối thiểu cần thiết cho độ bao phủ câu lệnh và độ bao phủ nhánh đầy đủ:\nRead P\nRead Q\nIF P+Q > 100 THEN Print \"Large\" ENDIF\nIf P > 50 THEN Print \"P Large\" ENDIF",
      "các đáp án": [
        "A. 1 kiểm thử cho độ bao phủ câu lệnh, 3 cho độ bao phủ nhánh",
        "B. 1 kiểm thử cho độ bao phủ câu lệnh, 2 cho độ bao phủ nhánh",
        "C. 1 kiểm thử cho độ bao phủ câu lệnh, 1 cho độ bao phủ nhánh",
        "D. 2 kiểm thử cho độ bao phủ câu lệnh, 3 cho độ bao phủ nhánh",
        "E. 2 kiểm thử cho độ bao phủ câu lệnh, 2 cho độ bao phủ nhánh"
      ],
      "đáp án đúng": "B. 1 kiểm thử cho độ bao phủ câu lệnh, 2 cho độ bao phủ nhánh",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 274: Số lượng Kiểm thử Tối thiểu Cần thiết cho Độ bao phủ Câu lệnh (Statement Coverage):\nDisc = 0\nOrder-qty = 0\nRead Order-qty\nIf Order-qty >= 20 then\n  Disc = 0.05\n  If Order-qty >= 100 then\n    Disc = 0.1\n  End if\nEnd if",
      "các đáp án": [
        "A. Độ bao phủ câu lệnh là 4",
        "B. Độ bao phủ câu lệnh là 1",
        "C. Độ bao phủ câu lệnh là 3",
        "D. Độ bao phủ câu lệnh là 2"
      ],
      "đáp án đúng": "B. Độ bao phủ câu lệnh là 1",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 294: Số lượng Kiểm thử Tối thiểu Cần thiết cho Độ bao phủ Câu lệnh và Độ bao phủ Nhánh:\nRead P\nRead Q\nIf p+q > 100 then Print \"Large\" End if\nIf p > 50 then Print \"pLarge\" End if",
      "các đáp án": [
        "A. Độ bao phủ câu lệnh là 2, Độ bao phủ nhánh là 2",
        "B. Độ bao phủ câu lệnh là 3 và độ bao phủ nhánh là 2",
        "C. Độ bao phủ câu lệnh là 1 và độ bao phủ nhánh là 2",
        "D. Độ bao phủ câu lệnh là 4 và độ bao phủ nhánh là 2"
      ],
      "đáp án đúng": "C. Độ bao phủ câu lệnh là 1 và độ bao phủ nhánh là 2",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 310: Số lượng trường hợp kiểm thử nhỏ nhất cần thiết để Cung cấp 100% độ bao phủ nhánh (branch coverage) là bao nhiêu?\nIf(x>y)\n  x=x+1;\nelse y=y+1;\nwhile(x>y)\n{\n  y=x*y; x=x+1;\n}",
      "các đáp án": [
        "A. 1",
        "B. 2",
        "C. 3",
        "D. 4"
      ],
      "đáp án đúng": "B. 2",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 337: Nếu đoạn mã giả dưới đây là một ngôn ngữ lập trình, cần bao nhiêu bài kiểm thử để đạt 100% độ bao phủ câu lệnh (statement coverage)?\n1. If x=3 then\n2.   Display_messageX;\n3.   If y=2 then\n4.     Display_messageY;\n5.   Else\n6.     Display_messageZ;\n7. Else\n8.   Display_messageZ;",
      "các đáp án": [
        "A. 1",
        "B. 2",
        "C. 3",
        "D. 4"
      ],
      "đáp án đúng": "C. 3",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 339: Sử dụng cùng một ví dụ mã như câu hỏi 17, cần bao nhiêu bài kiểm thử để đạt 100% độ bao phủ nhánh/quyết định (branch/decision coverage)? (Mã từ Q17: if width > length then ... else ... end_if)",
      "các đáp án": [
        "A. 1",
        "B. 2",
        "C. 3",
        "D. 4"
      ],
      "đáp án đúng": "B. 2",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 376: Cho đoạn mã này: WHILE (condition A) Do B END WHILE. Cần kiểm tra bao nhiêu quyết định (decisions) trong mã này để đạt được 100% độ bao phủ quyết định?",
      "các đáp án": [
        "A. 2",
        "B. Vô định (Indefinite)",
        "C. 1",
        "D. 4"
      ],
      "đáp án đúng": "A. 2",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 385: Cho đoạn mã này: WHILE (condition A) Do B END WHILE. Cần kiểm tra bao nhiêu đường đi (paths) trong mã này để đạt được 100% độ bao phủ đường đi (path coverage)?",
      "các đáp án": [
        "A. Một",
        "B. Vô định (Indefinite)",
        "C. Hai",
        "D. Bốn"
      ],
      "đáp án đúng": "B. Vô định (Indefinite)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 411: [Cho đoạn mã: if (condition1 && (condition2 || function1() )) ... ]. (Câu hỏi này trong file PDF bị thiếu nội dung câu hỏi, chỉ có các phương án. Giả định câu hỏi là 'Đoạn mã này liên quan chặt chẽ nhất đến loại độ bao phủ nào?')",
      "các đáp án": [
        "A. Độ bao phủ quyết định (Decision coverage)",
        "B. Độ bao phủ điều kiện (Condition coverage)",
        "C. Độ bao phủ câu lệnh (Statement coverage)",
        "D. Độ bao phủ đường đi (Path Coverage)"
      ],
      "đáp án đúng": "B. Độ bao phủ điều kiện (Condition coverage)",
      "nguồn ảnh": null
    },
    {
      "Câu": "Q. 482: Phân tích thủ tục đơn giản hóa sau: [Hỏi loại vé 'single' hay 'return'] -> IF 'return' THEN [Hỏi loại vé 'Standard' hay 'Cheap-day'] -> IF 'Cheap-day' THEN [Nói '£11:20'] ELSE [Nói '£19:50'] ENDIF ELSE [Nói '£9:75'] ENDIF. \nHãy quyết định số lượng kiểm thử tối thiểu cần thiết để đảm bảo rằng tất cả các câu hỏi đã được hỏi, tất cả các kết hợp đã xảy ra và tất cả các câu trả lời đã được đưa ra.",
      "các đáp án": [
        "A. 3",
        "B. 4",
        "C. 5",
        "D. 6"
      ],
      "đáp án đúng": "A. 3",
      "nguồn ảnh": null
    }
  ]
}